<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        不如归去 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x72EC;&amp;#x81EA;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5728;&amp;#x706B;&amp;#x8F66;&amp;#x4E0A;&amp;#x671B;&amp;#x7740;&amp;#x7A97;&amp;#x5916;&amp;#x51FA;&amp;#x795E;&amp;#xFF0C;&amp;#x800C;&amp;#x8FD9;&amp;#x79CD;&amp;#x60C5;&amp;#x666F;&amp;#x6211;&amp;#x518D;">
<meta name="keywords" content="回家,成长,亲情">
<meta property="og:type" content="article">
<meta property="og:title" content="不如归去">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/720539850/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x72EC;&amp;#x81EA;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5728;&amp;#x706B;&amp;#x8F66;&amp;#x4E0A;&amp;#x671B;&amp;#x7740;&amp;#x7A97;&amp;#x5916;&amp;#x51FA;&amp;#x795E;&amp;#xFF0C;&amp;#x800C;&amp;#x8FD9;&amp;#x79CD;&amp;#x60C5;&amp;#x666F;&amp;#x6211;&amp;#x518D;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="不如归去">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x72EC;&amp;#x81EA;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5728;&amp;#x706B;&amp;#x8F66;&amp;#x4E0A;&amp;#x671B;&amp;#x7740;&amp;#x7A97;&amp;#x5916;&amp;#x51FA;&amp;#x795E;&amp;#xFF0C;&amp;#x800C;&amp;#x8FD9;&amp;#x79CD;&amp;#x60C5;&amp;#x666F;&amp;#x6211;&amp;#x518D;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">不如归去</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">不如归去</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-10-21T22:31:48.000Z" itemprop="datePublished" class="page-time">
  2017-10-21
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-不如归去" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">不如归去</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-10-21 22:31:48" datetime="2017-10-21T22:31:48.000Z" itemprop="datePublished">2017-10-21</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        14 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x72EC;&#x81EA;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x706B;&#x8F66;&#x4E0A;&#x671B;&#x7740;&#x7A97;&#x5916;&#x51FA;&#x795E;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x60C5;&#x666F;&#x6211;&#x518D;&#x719F;&#x6089;&#x4E0D;&#x8FC7;&#xFF0C;&#x6216;&#x8BB8;&#x98CE;&#x666F;&#x4F1A;&#x56E0;&#x4E3A;&#x5B63;&#x8282;&#x800C;&#x4E0D;&#x540C;&#xFF0C;&#x6216;&#x8BB8;&#x65F6;&#x95F4;&#x4F1A;&#x56E0;&#x4E3A;&#x5E74;&#x9F84;&#x800C;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x719F;&#x6089;&#x5F97;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6211;&#x8BB2;&#x4E86;&#x65E0;&#x6570;&#x904D;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4ECE;&#x5F00;&#x7BC7;&#x5E03;&#x5C40;&#x5230;&#x6545;&#x4E8B;&#x8109;&#x7EDC;&#x90FD;&#x6E05;&#x695A;&#x5230;&#x4E25;&#x4E1D;&#x5408;&#x7F1D;&#x3002;&#x5370;&#x8C61;&#x4E2D;&#x662F;&#x4ECE;&#x521D;&#x4E2D;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x59CB;&#x5BC4;&#x5BBF;&#x751F;&#x6D3B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x6F02;&#x6CCA;&#x7684;&#x611F;&#x89C9;&#x6210;&#x4E3A;&#x6211;&#x751F;&#x547D;&#x91CC;&#x91CD;&#x8981;&#x7684;&#x70D9;&#x5370;&#xFF0C;&#x800C;&#x4ECE;&#x90A3;&#x4E00;&#x523B;&#x8D77;&#xFF0C;&#x6211;&#x6700;&#x671F;&#x5F85;&#x7684;&#x662F;&#x5BD2;&#x6691;&#x5047;&#x671F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x8C61;&#x5F81;&#x7740;&#x4E00;&#x6BB5;&#x6F02;&#x6CCA;&#x65C5;&#x7A0B;&#x7684;&#x7ED3;&#x675F;&#x3002;&#x5927;&#x6982;&#x662F;&#x56E0;&#x4E3A;&#x53CC;&#x5B50;&#x5EA7;&#x5C5E;&#x4E8E;&#x98CE;&#x8C61;&#x661F;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x56DE;&#x5BB6;&#x7684;&#x65C5;&#x7A0B;&#x90FD;&#x4F34;&#x968F;&#x7740;&#x5FE7;&#x6101;&#x98CE;&#x96E8;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x5C06;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7406;&#x89E3;&#x4E3A;&#xFF0C;&#x751F;&#x547D;&#x4E0D;&#x7ECF;&#x610F;&#x7684;&#x88C5;&#x70B9;&#x3002;&#x98CE;&#x6709;&#x8D28;&#x800C;&#x65E0;&#x5F62;&#xFF0C;&#x6216;&#x98DE;&#x6C99;&#x8D70;&#x77F3;&#xFF0C;&#x6216;&#x62C8;&#x82B1;&#x5F04;&#x53F6;&#xFF1B;&#x96E8;&#x6709;&#x8D28;&#x800C;&#x65E0;&#x5F62;&#xFF0C;&#x6216;&#x5760;&#x6563;&#x6210;&#x73E0;&#xFF0C;&#x6216;&#x51DD;&#x805A;&#x6210;&#x6D41;&#x3002;&#x5927;&#x6982;&#x90FD;&#x662F;&#x5728;&#x4E16;&#x95F4;&#x6F02;&#x6CCA;&#x7684;&#x6D6A;&#x5B50;&#xFF0C;&#x6BCF;&#x4E00;&#x523B;&#x90FD;&#x6447;&#x66F3;&#x4E0D;&#x5B9A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x653E;&#x5047;&#x56DE;&#x5BB6;&#x662F;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x65F6;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x8131;&#x79BB;&#x7236;&#x6BCD;&#x7684;&#x5E87;&#x62A4;&#x3002;&#x53EF;&#x5F53;&#x6211;&#x5DE5;&#x4F5C;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x5F53;&#x6211;&#x540C;&#x4ED6;&#x4EEC;&#x7684;&#x8DDD;&#x79BB;&#x4E0D;&#x518D;&#x662F;&#x5B66;&#x6821;&#x548C;&#x5BB6;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x5F53;&#x6211;&#x540C;&#x4ED6;&#x4EEC;&#x6253;&#x7535;&#x8BDD;&#x4E0D;&#x518D;&#x662F;&#x56E0;&#x4E3A;&#x751F;&#x6D3B;&#x8D39;&#x544A;&#x62EE;&#xFF0C;&#x6211;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#x6211;&#x540C;&#x4ED6;&#x4EEC;&#x4EA4;&#x6362;&#x4E86;&#x8FD9;&#x573A;&#x6F02;&#x6CCA;&#x91CC;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4ECE;&#x524D;&#x662F;&#x6211;&#x671F;&#x5F85;&#x7740;&#x5047;&#x671F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x53EF;&#x4EE5;&#x89C1;&#x5230;&#x4ED6;&#x4EEC;&#xFF1B;&#x73B0;&#x5728;&#x5219;&#x662F;&#x4ED6;&#x4EEC;&#x671F;&#x5F85;&#x7740;&#x5047;&#x671F;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x89C1;&#x5230;&#x6211;&#x3002;&#x6211;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#x6211;&#x4E00;&#x5E74;&#x4E2D;&#x6211;&#x966A;&#x4ED6;&#x4EEC;&#x7684;&#x65E5;&#x5B50;&#x5C48;&#x6307;&#x53EF;&#x6570;&#xFF0C;&#x4ECE;&#x524D;&#x5411;&#x5F80;&#x8FDC;&#x65B9;&#x89C9;&#x5F97;&#x5728;&#x90A3;&#x91CC;&#x80FD;&#x627E;&#x5230;&#x6211;&#x7684;&#x68A6;&#xFF0C;&#x73B0;&#x5728;&#x8D8A;&#x53D1;&#x5730;&#x89C9;&#x5F97;&#x4ED6;&#x4EEC;&#x4E00;&#x5929;&#x5929;&#x8001;&#x53BB;&#xFF0C;&#x60F3;&#x52AA;&#x529B;&#x957F;&#x5927;&#x6210;&#x719F;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x653E;&#x5FC3;&#xFF0C;&#x53EF;&#x66F4;&#x6015;&#x56E0;&#x4E3A;&#x8DDD;&#x79BB;&#x800C;&#x758F;&#x8FDC;&#x4E86;&#x4ED6;&#x4EEC;&#xFF0C;&#x53E4;&#x4EBA;&#x8BF4;&#x300E;&#x6811;&#x6B32;&#x9759;&#x800C;&#x98CE;&#x4E0D;&#x6B62;&#xFF0C;&#x5B50;&#x6B32;&#x517B;&#x800C;&#x4EB2;&#x4E0D;&#x5F85;&#x300F;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x56FA;&#x7136;&#x4E0D;&#x518D;&#x662F;&#x53E4;&#x4EBA;&#x6240;&#x8BA4;&#x8BC6;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x60C5;&#x5374;&#x8D85;&#x8D8A;&#x4E86;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x8F6E;&#x56DE;&#x81F3;&#x4ECA;&#x3002;</p>
<p>&#x2003;&#x2003;&#x56FD;&#x5E86;&#x672C;&#x6765;&#x6253;&#x7B97;&#x4E0D;&#x56DE;&#x5BB6;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x65E0;&#x4EBA;&#x53EF;&#x7EA6;&#x65E0;&#x4EBA;&#x53EF;&#x966A;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#x3002;&#x6211;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x966A;&#x6211;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4F1A;&#x5F88;&#x4E50;&#x610F;&#x63A5;&#x7EB3;&#x8FD9;&#x756A;&#x597D;&#x610F;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x7528;&#x6700;&#x597D;&#x7684;&#x72B6;&#x6001;&#x53BB;&#x8BA9;&#x5F7C;&#x6B64;&#x4EAB;&#x53D7;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x966A;&#x4F34;&#x6211;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x52C9;&#x5F3A;&#x66F4;&#x4E0D;&#x4F1A;&#x56E0;&#x6B64;&#x800C;&#x6CAE;&#x4E27;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E86;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x9762;&#x5BF9;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x4ECE;&#x6765;&#x4E0D;&#x7F3A;&#x4E4F;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x52A8;&#x529B;&#x3002;&#x53EF;&#x5F53;&#x5BB6;&#x91CC;&#x4EBA;&#x95EE;&#x6211;&#x56FD;&#x5E86;&#x8981;&#x4E0D;&#x8981;&#x56DE;&#x5BB6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x5FC3;&#x8F6F;&#x5F97;&#x50CF;&#x878D;&#x5316;&#x4E86;&#x7684;&#x96EA;&#xFF0C;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x662F;&#x6211;&#x5FC3;&#x5E95;&#x6D8C;&#x51FA;&#x7684;&#x4E00;&#x80A1;&#x6696;&#x6D41;&#xFF0C;&#x5FEB;&#x901F;&#x5730;&#x6253;&#x5F00;&#x5FAE;&#x4FE1;&#x4E70;&#x56DE;&#x5BB6;&#x7684;&#x706B;&#x8F66;&#x7968;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;15&#x53F7;&#x7684;&#x65F6;&#x5019;&#x7968;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x5988;&#x5988;&#x53D1;&#x5FAE;&#x4FE1;&#x7ED9;&#x6211;&#x8BF4;&#xFF0C;&#x300E;&#x5982;&#x679C;&#x5B9E;&#x5728;&#x4E70;&#x4E0D;&#x5230;&#x706B;&#x8F66;&#x7968;&#xFF0C;&#x5C31;&#x4E70;&#x673A;&#x7968;&#x56DE;&#x6765;&#x5427;&#xFF0C;&#x4E0D;&#x7528;&#x592A;&#x5FC3;&#x75BC;&#x94B1;&#xFF0C;&#x4EBA;&#x56DE;&#x6765;&#x4E86;&#x5C31;&#x597D;&#x300F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x8BB0;&#x5F97;&#x4EE5;&#x524D;&#x4ED6;&#x4EEC;&#x90FD;&#x4E0D;&#x5927;&#x4F1A;&#x7528;&#x8FD9;&#x7C7B;IM&#x4EA7;&#x54C1;&#x7684;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x4ED6;&#x4EEC;&#x5B66;&#x4F1A;&#x4E86;&#x600E;&#x4E48;&#x53D1;&#x6D88;&#x606F;&#x53D1;&#x670B;&#x53CB;&#x5708;&#x3002;&#x8BB0;&#x5F97;&#x8FC7;&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x6559;&#x5988;&#x5988;&#x600E;&#x4E48;&#x6837;&#x53D1;&#x7EA2;&#x5305;&#xFF0C;&#x867D;&#x7136;&#x53EA;&#x6709;&#x4E09;&#x5757;&#x94B1;&#x8FD9;&#x6837;&#x6765;&#x56DE;&#x53D1;&#x7740;&#x73A9;&#xFF0C;&#x4F46;&#x5979;&#x73A9;&#x5F97;&#x6BD4;&#x6211;&#x90FD;&#x5F00;&#x5FC3;&#xFF0C;&#x6216;&#x8BB8;&#x7236;&#x6BCD;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x66FE;&#x7ECF;&#x9752;&#x6625;&#x671F;&#x53DB;&#x9006;&#x65F6;&#x89C9;&#x5F97;&#x4ED6;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x548C;&#x81EA;&#x5DF1;&#x683C;&#x683C;&#x4E0D;&#x5165;&#xFF0C;&#x7B49;&#x4ED6;&#x4EEC;&#x8001;&#x53BB;&#x7684;&#x65F6;&#x5019;&#x4F9D;&#x7136;&#x5728;&#x52AA;&#x529B;&#x7740;&#x878D;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x3002;&#x5C0F;&#x65F6;&#x5019;&#x4ED6;&#x4EEC;&#x7D27;&#x7D27;&#x8FFD;&#x9010;&#x7740;&#x6211;&#x4EEC;&#xFF0C;&#x662F;&#x6015;&#x6211;&#x4EEC;&#x5728;&#x6210;&#x957F;&#x8DEF;&#x4E0A;&#x6454;&#x5012;&#xFF1B;&#x957F;&#x5927;&#x4E86;&#x4ED6;&#x4EEC;&#x4F9D;&#x7136;&#x7D27;&#x7D27;&#x8FFD;&#x9010;&#x7740;&#x6211;&#x4EEC;&#xFF0C;&#x662F;&#x6015;&#x6211;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x6CA1;&#x6709;&#x4E86;&#x4ED6;&#x4EEC;&#x3002;&#x53EF;&#x4ED6;&#x4EEC;&#x5728;&#x4E00;&#x5929;&#x5929;&#x5730;&#x8001;&#x53BB;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x4ED6;&#x4EEC;&#x8FFD;&#x4E0D;&#x52A8;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x613F;&#x610F;&#x505C;&#x4E0B;&#x6765;&#x7B49;&#x7B49;&#x4ED6;&#x4EEC;&#x5462;&#xFF1F;&#x7A97;&#x5916;&#x7684;&#x82E5;&#x660E;&#x82E5;&#x6697;&#x7684;&#xFF0C;&#x50CF;&#x6781;&#x4E86;&#x6211;&#x5F80;&#x5E38;&#x56DE;&#x5BB6;&#x8DEF;&#x4E0A;&#x6570;&#x8FC7;&#x7684;&#x6BCF;&#x4E00;&#x76CF;&#x706F;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x90A3;&#x4E00;&#x76CF;&#xFF0C;&#x662F;&#x6765;&#x81EA;&#x90A3;&#x4E2A;&#x53EB;&#x505A;&#x5BB6;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5B83;&#x6216;&#x8BB8;&#x5E76;&#x4E0D;&#x7480;&#x74A8;&#x8000;&#x773C;&#xFF0C;&#x4F46;&#x5411;&#x6765;&#x4E0D;&#x541D;&#x4E8E;&#x4E3A;&#x4F60;&#x91CA;&#x653E;&#x5149;&#x548C;&#x70ED;&#xFF0C;&#x6C38;&#x8FDC;&#x4E3A;&#x4F60;&#x6307;&#x793A;&#x7740;&#x5BB6;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x2003;&#x2003;&#x65E9;&#x4E0A;&#x53BB;&#x5317;&#x5BA2;&#x7AD9;&#x53D6;&#x7968;&#x5750;&#x8F66;&#xFF0C;&#x5C31;&#x63A5;&#x5230;&#x670B;&#x53CB;&#x4ECE;&#x4E2D;&#x536B;&#x6253;&#x6765;&#x7684;&#x7535;&#x8BDD;&#xFF0C;&#x8BE2;&#x95EE;&#x6211;&#x56FD;&#x5E86;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x56DE;&#x5BB6;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x5BB6;&#x91CC;&#x4EBA;&#x4E00;&#x76F4;&#x8BB0;&#x6302;&#x7740;&#x4F60;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x4F1A;&#x60F3;&#x8D77;&#x9AD8;&#x4E2D;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x65F6;&#x540C;&#x670B;&#x53CB;&#x51FA;&#x53BB;&#x73A9;&#x5230;&#x5F88;&#x665A;&#x56DE;&#x5BB6;&#xFF0C;&#x5E38;&#x5E38;&#x4F1A;&#x5230;&#x670B;&#x53CB;&#x5BB6;&#x91CC;&#x501F;&#x5BBF;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x5BDD;&#x5219;&#x540C;&#x5E8A;&#x98DF;&#x5219;&#x540C;&#x684C;&#xFF0C;&#x5230;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x662F;&#x7279;&#x522B;&#x7279;&#x522B;&#x597D;&#x7684;&#x670B;&#x53CB;&#x3002;&#x6211;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x4E00;&#x76F4;&#x88AB;&#x670B;&#x53CB;&#x8FD9;&#x6837;&#x7167;&#x987E;&#x7740;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x5728;&#x6BD5;&#x4E1A;&#x540E;&#x5929;&#x5404;&#x4E00;&#x65B9;&#xFF0C;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x4E0D;&#x5927;&#x61C2;&#x5F97;&#x7ECF;&#x8425;&#x611F;&#x60C5;&#xFF0C;&#x88AB;&#x8FD9;&#x6837;&#x7684;&#x670B;&#x53CB;&#x4E00;&#x76F4;&#x7167;&#x987E;&#x7740;&#xFF0C;&#x6211;&#x8BE5;&#x662F;&#x6709;&#x591A;&#x5E78;&#x8FD0;&#x554A;&#x3002;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4E70;&#x5230;&#x76F4;&#x8FBE;&#x7684;&#x8F66;&#x7968;&#xFF0C;&#x6240;&#x4EE5;&#x5750;&#x52A8;&#x8F66;&#x5230;&#x5170;&#x5DDE;&#x53BB;&#x8F6C;&#x8F66;&#xFF0C;&#x7136;&#x540E;&#x906D;&#x9047;&#x4E86;&#x4EBA;&#x751F;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x706B;&#x8F66;&#x665A;&#x70B9;&#x3002;&#x706B;&#x8F66;&#x665A;&#x70B9;&#x8FD1;&#x4E09;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FEB;&#x5207;&#x5730;&#x611F;&#x89C9;&#x79BB;&#x5BB6;&#x597D;&#x8FDC;&#x597D;&#x8FDC;&#xFF0C;&#x6BCF;&#x6B21;&#x56DE;&#x5BB6;&#x90FD;&#x662F;&#x62AB;&#x661F;&#x6234;&#x6708;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x591C;&#x6DF1;&#x4EBA;&#x9759;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x66D9;&#x5149;&#x521D;&#x73B0;&#x65F6;&#xFF0C;&#x8BA9;&#x5BB6;&#x4EBA;&#x548C;&#x670B;&#x53CB;&#x7B49;&#x6211;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x8FC7;&#x610F;&#x4E0D;&#x53BB;&#x7684;&#x3002;&#x5927;&#x6982;&#x4ED6;&#x4EEC;&#x90FD;&#x592A;&#x4E86;&#x89E3;&#x6211;&#xFF0C;&#x77E5;&#x9053;&#x6211;&#x4F1A;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x8FD9;&#x526F;&#x300E;&#x957F;&#x4E0D;&#x5927;&#x300F;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x53EF;&#x6211;&#x603B;&#x8981;&#x957F;&#x5927;&#x6210;&#x719F;&#x554A;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x6211;&#x8BB0;&#x5F97;&#x4EE5;&#x524D;&#x8FD8;&#x5728;&#x7236;&#x6BCD;&#x8EAB;&#x8FB9;&#x65F6;&#xFF0C;&#x6211;&#x8111;&#x5B50;&#x91CC;&#x60F3;&#x7684;&#x662F;&#x300E;&#x7236;&#x6BCD;&#x5728;&#xFF0C;&#x4E0D;&#x8FDC;&#x6E38;&#xFF0C;&#x6E38;&#x5FC5;&#x6709;&#x65B9;&#x300F;&#xFF0C;&#x6211;&#x4E00;&#x4F4D;&#x540C;&#x5B66;&#x66FE;&#x95EE;&#x6211;&#xFF0C;&#x4F55;&#x8C13;&#x6709;&#x65B9;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x6211;&#x771F;&#x7684;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x6837;&#x56DE;&#x7B54;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x897F;&#x5B89;&#x53D1;&#x5C55;&#xFF0C;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#xFF0C;&#x4EE5;&#x524D;&#x516C;&#x53F8;&#x91CC;&#x4E00;&#x4E2A;&#x5973;&#x751F;&#x6240;&#x8BF4;&#x7684;&#xFF0C;&#x5728;&#x54EA;&#x91CC;&#x90FD;&#x4E00;&#x6837;&#x3002;&#x60F3;&#x5230;&#x7236;&#x6BCD;&#x5B64;&#x96F6;&#x96F6;&#x5730;&#x5F85;&#x5728;&#x5BB6;&#x91CC;&#xFF0C;&#x60F3;&#x5230;&#x6BCF;&#x5E74;&#x5C48;&#x6307;&#x53EF;&#x6570;&#x7684;&#x56DE;&#x5BB6;&#x6B21;&#x6570;&#xFF0C;&#x66FE;&#x51E0;&#x4F55;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x53BB;&#x66F4;&#x5E7F;&#x9614;&#x7684;&#x4E16;&#x754C;&#x5BFB;&#x627E;&#x8BD7;&#x548C;&#x8FDC;&#x65B9;&#xFF0C;&#x53EF;&#x7236;&#x6BCD;&#x9010;&#x6E10;&#x8E52;&#x8DDA;&#x7684;&#x6B65;&#x5C65;&#x6CE8;&#x5B9A;&#x65E0;&#x6CD5;&#xFF0C;&#x966A;&#x4F34;&#x6211;&#x4EEC;&#x53BB;&#x90A3;&#x4E9B;&#x9065;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8BD7;&#x7ECF;&#x91CC;&#x8BF4;&#x300E;&#x9752;&#x9752;&#x5B50;&#x887F;&#xFF0C;&#x60A0;&#x60A0;&#x6211;&#x5FC3;&#xFF0C;&#x7EB5;&#x6211;&#x4E0D;&#x5F80;&#xFF0C;&#x5B50;&#x5B81;&#x4E0D;&#x6765;&#x300F;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x518D;&#x7D27;&#x7D27;&#x8FFD;&#x968F;&#x6211;&#x4EEC;&#x7684;&#x6B65;&#x4F10;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x505C;&#x4E0B;&#x751A;&#x81F3;&#x8F6C;&#x8EAB;&#x56DE;&#x53BB;&#x53BB;&#x770B;&#x671B;&#x4ED6;&#x4EEC;&#x5462;&#xFF1F;&#x4EE5;&#x524D;&#x548C;&#x6211;&#x5F92;&#x5F1F;&#x804A;&#x5929;&#xFF0C;&#x5979;&#x8BF4;&#x7537;&#x751F;&#x90FD;&#x4E0D;&#x5927;&#x559C;&#x6B22;&#x548C;&#x5BB6;&#x91CC;&#x4EBA;&#x8054;&#x7EDC;&#xFF0C;&#x6211;&#x672C;&#x6765;&#x5C31;&#x662F;&#x6C89;&#x9ED8;&#x5BE1;&#x8A00;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x4ECE;&#x521D;&#x4E2D;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x4E3B;&#x52A8;&#x548C;&#x5BB6;&#x91CC;&#x4EBA;&#x8054;&#x7EDC;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x60F3;&#x6539;&#x53D8;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x6709;&#x7A7A;&#x5C31;&#x966A;&#x966A;&#x5BB6;&#x91CC;&#x4EBA;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x559C;&#x6B22;&#x5728;&#x6F2B;&#x957F;&#x7684;&#x65C5;&#x9014;&#x4E2D;&#x770B;&#x4E66;&#xFF0C;&#x8FD9;&#x79CD;&#x4E60;&#x60EF;&#x5728;&#x6211;&#x6709;&#x4E86;Kindle&#x4EE5;&#x540E;&#x53D8;&#x5F97;&#x66F4;&#x4E3A;&#x660E;&#x663E;&#x3002;&#x65E9;&#x4E0A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x300E;&#x4F60;&#x61C2;&#x5F97;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x8D8A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x50CF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x5B64;&#x513F;&#x300F;&#xFF0C;&#x4EBA;&#x751F;&#x800C;&#x5B64;&#x72EC;&#xFF0C;&#x7236;&#x6BCD;&#x603B;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x79BB;&#x5F00;&#x6211;&#x4EEC;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x6559;&#x4F1A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x53BB;&#x7231;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x4ED6;&#x4EEC;&#x6559;&#x4F1A;&#x6211;&#x7684;&#xFF0C;&#x5728;&#x4ED6;&#x4EEC;&#x6709;&#x751F;&#x4E4B;&#x5E74;&#x505A;&#x4E9B;&#x5728;&#x4ED6;&#x4EEC;&#x773C;&#x91CC;&#x4E0D;&#x518D;&#x300E;&#x5B69;&#x5B50;&#x6C14;&#x300F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x867D;&#x7136;&#x5728;&#x4ED6;&#x4EEC;&#x773C;&#x91CC;&#x6211;&#x4EEC;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x5B69;&#x5B50;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x771F;&#x6B63;&#x7684;&#x6210;&#x719F;&#x5E76;&#x4E0D;&#x662F;&#x53D8;&#x5F97;&#x51B7;&#x9177;&#x9EBB;&#x6728;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6709;&#x9ED1;&#x6697;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x4F9D;&#x7136;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#x90A3;&#x4E9B;&#x6E29;&#x6696;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x5230;&#x73B0;&#x5728;&#x4F9D;&#x7136;&#x4E0D;&#x559C;&#x6B22;&#x542C;&#x522B;&#x4EBA;&#x8BB2;&#x201C;&#x9053;&#x7406;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#x4EBA;&#x751F;&#x6700;&#x5947;&#x7279;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x5373;&#x4F7F;&#x522B;&#x4EBA;&#x8BB2;&#x5F97;&#x8FD9;&#x4E9B;&#x201C;&#x9053;&#x7406;&#x201D;&#x90FD;&#x5BF9;&#xFF0C;&#x522B;&#x4EBA;&#x4F9D;&#x7136;&#x65E0;&#x6CD5;&#x4EE3;&#x66FF;&#x4F60;&#x53BB;&#x4F53;&#x9A8C;&#x6574;&#x4E2A;&#x751F;&#x6D3B;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x751F;&#x6D3B;&#x8FD9;&#x7247;&#x5927;&#x6D77;&#x91CC;&#x7684;&#x4E00;&#x6735;&#x6D6A;&#x82B1;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x88AB;&#x5C81;&#x6708;&#x51B2;&#x4E0A;&#x8352;&#x51C9;&#x5BC2;&#x5BDE;&#x7684;&#x6C99;&#x6EE9;&#xFF0C;&#x6211;&#x4EEC;&#x552F;&#x6709;&#x8FFD;&#x9010;&#x5DE8;&#x6D6A;&#x52AA;&#x529B;&#x751F;&#x5B58;&#x3002;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x60F3;&#x548C;&#x6211;&#x559C;&#x6B22;&#x7684;&#x59D1;&#x5A18;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x91CC;&#xFF0C;&#x7B49;&#x6709;&#x7A7A;&#x4E86;&#x5C31;&#x5E26;&#x4E0A;&#x5979;&#x56DE;&#x5BB6;&#x966A;&#x966A;&#x7236;&#x6BCD;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x6709;&#x6BD4;&#x6545;&#x4E61;&#x66F4;&#x5E7F;&#x9614;&#x7684;&#x5929;&#x7A7A;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x6709;&#x6BD4;&#x6545;&#x4E61;&#x66F4;&#x6E7F;&#x6DA6;&#x7684;&#x571F;&#x58E4;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x6709;&#x6BD4;&#x6545;&#x4E61;&#x66F4;&#x7CBE;&#x5F69;&#x7684;&#x65C5;&#x7A0B;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x8BBA;&#x4F60;&#x662F;&#x5728;&#x8FFD;&#x6C42;&#x8BD7;&#x548C;&#x8FDC;&#x65B9;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x5FCD;&#x53D7;&#x773C;&#x524D;&#x7684;&#x82DF;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x7D2F;&#x4E86;&#xFF0C;&#x8BF7;&#x505C;&#x4E0B;&#x5FD9;&#x788C;&#x7684;&#x811A;&#x6B65;&#xFF0C;&#x627E;&#x627E;&#x56DE;&#x5BB6;&#x7684;&#x8DEF;&#xFF0C;&#x90A3;&#x91CC;&#x6C38;&#x8FDC;&#x6709;&#x4EBA;&#x5728;&#x7B49;&#x4F60;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/1394521917/">青黄未接的2015</a></li><li><a href="https://qinyuanpei.github.io/posts/21112647/">一见钟情，无疾而终</a></li><li><a href="https://blogs.kainy.cn/2010/08/2010暑假回家的一些照片/">2010暑假回家的一些照片</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/720539850/" rel="external">不如归去</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/720539850/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/720539850/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/亲情/">亲情</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/回家/">回家</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/720539850/&title=《不如归去》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/720539850/&title=《不如归去》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/720539850/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《不如归去》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/720539850/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/720539850/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3521618732/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">持续集成在Hexo自动化部署上的实践</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/2617501472/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">秋风劲似去年时</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/720539850/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/720539850/&title=《不如归去》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/720539850/&title=《不如归去》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/720539850/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《不如归去》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/720539850/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/720539850/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/720539850/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
