<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        Redis缓存技术学习系列之发布订阅 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="各位朋友，大家好，我是Payne，欢迎大家关注我的博客，我的博客地址是http://qinyuanpei.com。最近这段时间的天气可谓是变幻莫测，常常是周一到周五像夏天般热烈，而周六和周天像秋天般冷清。你不知道它到底会在何时下雨，即使你可以一直带着伞等雨落下来。但是对于没有伞的我来说，学会努力奔跑以至于不那么狼狈，或许是在这个世界上我唯一可以去做的事情。可是你知道一个人孤独的时候，即使是下雨">
<meta name="keywords" content="Redis,缓存,设计模式">
<meta property="og:type" content="article">
<meta property="og:title" content="Redis缓存技术学习系列之发布订阅">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1444577573/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="各位朋友，大家好，我是Payne，欢迎大家关注我的博客，我的博客地址是http://qinyuanpei.com。最近这段时间的天气可谓是变幻莫测，常常是周一到周五像夏天般热烈，而周六和周天像秋天般冷清。你不知道它到底会在何时下雨，即使你可以一直带着伞等雨落下来。但是对于没有伞的我来说，学会努力奔跑以至于不那么狼狈，或许是在这个世界上我唯一可以去做的事情。可是你知道一个人孤独的时候，即使是下雨">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/None.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/None.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/None.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz68j9g791j20j80c7abz.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.512Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Redis缓存技术学习系列之发布订阅">
<meta name="twitter:description" content="各位朋友，大家好，我是Payne，欢迎大家关注我的博客，我的博客地址是http://qinyuanpei.com。最近这段时间的天气可谓是变幻莫测，常常是周一到周五像夏天般热烈，而周六和周天像秋天般冷清。你不知道它到底会在何时下雨，即使你可以一直带着伞等雨落下来。但是对于没有伞的我来说，学会努力奔跑以至于不那么狼狈，或许是在这个世界上我唯一可以去做的事情。可是你知道一个人孤独的时候，即使是下雨">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/None.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">Redis缓存技术学习系列之发布订阅</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">Redis缓存技术学习系列之发布订阅</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-04-15T21:03:57.000Z" itemprop="datePublished" class="page-time">
  2017-04-15
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据存储/">数据存储</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#从观察者模式说起"><span class="post-toc-number">1.</span> <span class="post-toc-text">从观察者模式说起</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#观察者模式的实现"><span class="post-toc-number">2.</span> <span class="post-toc-text">观察者模式的实现</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#Hey-Redis-Pub-Sub"><span class="post-toc-number">3.</span> <span class="post-toc-text">Hey Redis Pub-Sub</span></a></li></ol><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number"></span> <span class="post-toc-text">你可能感兴趣</span></a>
        </li></nav>
    </aside>
    
<article id="post-Redis缓存技术学习系列之发布订阅" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">Redis缓存技术学习系列之发布订阅</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-04-15 21:03:57" datetime="2017-04-15T21:03:57.000Z" itemprop="datePublished">2017-04-15</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据存储/">数据存储</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        28 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5404;&#x4F4D;&#x670B;&#x53CB;&#xFF0C;&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6211;&#x662F;Payne&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x5730;&#x5740;&#x662F;<a href="http://qinyuanpei" target="_blank" rel="noopener">http://qinyuanpei.com</a>&#x3002;&#x6700;&#x8FD1;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5929;&#x6C14;&#x53EF;&#x8C13;&#x662F;&#x53D8;&#x5E7B;&#x83AB;&#x6D4B;&#xFF0C;&#x5E38;&#x5E38;&#x662F;&#x5468;&#x4E00;&#x5230;&#x5468;&#x4E94;&#x50CF;&#x590F;&#x5929;&#x822C;&#x70ED;&#x70C8;&#xFF0C;&#x800C;&#x5468;&#x516D;&#x548C;&#x5468;&#x5929;&#x50CF;&#x79CB;&#x5929;&#x822C;&#x51B7;&#x6E05;&#x3002;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x5230;&#x5E95;&#x4F1A;&#x5728;&#x4F55;&#x65F6;&#x4E0B;&#x96E8;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x5E26;&#x7740;&#x4F1E;&#x7B49;&#x96E8;&#x843D;&#x4E0B;&#x6765;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x4F1E;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x5B66;&#x4F1A;&#x52AA;&#x529B;&#x5954;&#x8DD1;&#x4EE5;&#x81F3;&#x4E8E;&#x4E0D;&#x90A3;&#x4E48;&#x72FC;&#x72C8;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6211;&#x552F;&#x4E00;&#x53EF;&#x4EE5;&#x53BB;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x53EF;&#x662F;&#x4F60;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x4EBA;&#x5B64;&#x72EC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x4E0B;&#x96E8;&#x8FD9;&#x79CD;&#x518D;&#x5E73;&#x5E38;&#x4E0D;&#x8FC7;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4ED6;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x96E8;&#x58F0;&#x91CC;&#x542C;&#x51FA;&#x5B64;&#x72EC;&#x7684;&#x611F;&#x89C9;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5468;&#x672B;&#x6211;&#x51B3;&#x5B9A;&#x7EE7;&#x7EED;&#x7814;&#x7A76;Redis&#x7F13;&#x5B58;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x4ECA;&#x5929;&#x6211;&#x60F3;&#x548C;&#x5927;&#x5BB6;&#x8BA8;&#x8BBA;&#x7684;&#x8BDD;&#x9898;&#x662F;Redis&#x4E2D;&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;(Pub-Sub)&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x559C;&#x6B22;&#xFF01;</p>
<a id="more"></a>
<h2 id="&#x4ECE;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x8BF4;&#x8D77;"><a href="#&#x4ECE;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x8BF4;&#x8D77;" class="headerlink" title="&#x4ECE;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x8BF4;&#x8D77;"></a>&#x4ECE;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x8BF4;&#x8D77;</h2><p>&#x2003;&#x2003;&#x5982;&#x679C;&#x4F60;&#x719F;&#x6089;&#x5E38;&#x89C1;&#x7684;<a href="https://gof.quanke.name/" target="_blank" rel="noopener">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</a>&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x4F1A;&#x77E5;&#x9053;&#x5728;24&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;<strong>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;</strong>&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x8BE5;&#x6A21;&#x5F0F;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;</strong>&#x3002;&#x5728;&#x6B63;&#x5F0F;&#x8BA8;&#x8BBA;Redis&#x4E2D;&#x7684;<strong>&#x53D1;&#x5E03;-&#x8BA2;&#x9605;</strong>&#x7279;&#x6027;&#x524D;&#xFF0C;&#x6211;&#x60F3;&#x5148;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x6765;&#x4E3A;&#x5927;&#x5BB6;&#x8BB2;&#x89E3;&#x4E0B;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x8BA9;&#x591A;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;&#x540C;&#x65F6;&#x76D1;&#x542C;&#x540C;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#xFF0C;&#x5F53;&#x8BE5;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#x5728;&#x72B6;&#x6001;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x4F1A;&#x901A;&#x77E5;&#x6240;&#x6709;&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#x5E76;&#x4F7F;&#x5176;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x8BE5;&#x6A21;&#x5F0F;&#x7684;UML&#x7C7B;&#x56FE;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/None.jpg" alt="&#x8BBE;&#x8BA1;&#x8005;&#x6A21;&#x5F0F;&#x7684;UML&#x7C7B;&#x56FE;" title>
                </div>
                <div class="image-caption">&#x8BBE;&#x8BA1;&#x8005;&#x6A21;&#x5F0F;&#x7684;UML&#x7C7B;&#x56FE;</div>
            </figure>
<p>&#x2003;&#x2003;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x8BA4;&#x4E3A;&#x5B9E;&#x9645;&#x6A21;&#x5F0F;&#x662F;&#x975E;&#x5E38;&#x62BD;&#x8C61;&#x800C;&#x6666;&#x6DA9;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;&#x7ECF;&#x8FC7;&#x53CD;&#x590D;&#x9A8C;&#x8BC1;&#x7684;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x3002;&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x9762;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x5E76;&#x8BA4;&#x8BC6;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x6839;&#x690D;&#x81EA;&#x751F;&#x6D3B;&#x7684;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x3002;&#x4EE5;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x6216;&#x8BB8;&#x4F1A;&#x5728;&#x5FAE;&#x4FE1;&#x91CC;&#x8BA2;&#x9605;&#x5404;&#x79CD;&#x5404;&#x6837;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x5185;&#x5BB9;&#x53D1;&#x751F;&#x66F4;&#x65B0;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x4E3B;&#x52A8;&#x5411;&#x6211;&#x4EEC;&#x63A8;&#x9001;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x8BA2;&#x9605;&#x7684;&#x516C;&#x4F17;&#x53F7;&#x79F0;&#x4E3A;&#x201D;&#x4E3B;&#x9898;&#x201D;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5219;&#x79F0;&#x4E3A;&#x201D;&#x89C2;&#x5BDF;&#x8005;&#x201D;&#x6216;&#x8005;&#x201D;&#x8BA2;&#x9605;&#x8005;&#x201D;&#xFF0C;&#x800C;&#x8FD9;&#x6B63;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x201D;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x539F;&#x56E0;&#x6240;&#x5728;&#xFF0C;&#x8FD9;&#x79CD;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x8BA9;&#x591A;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;&#x540C;&#x65F6;&#x76D1;&#x542C;&#x540C;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#xFF0C;&#x5F53;&#x8BE5;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#x5728;&#x72B6;&#x6001;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x4F1A;&#x901A;&#x77E5;&#x6240;&#x6709;&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#x5E76;&#x4F7F;&#x5176;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5C31;&#x88AB;&#x79F0;&#x4E3A;&#x201D;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x201D;&#x3002;&#x800C;&#x901A;&#x8FC7;&#x8FD9;&#x5F20;&#x56FE;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x8BD5;&#x56FE;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F8B;&#x5BF9;&#x8C61;&#x95F4;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x964D;&#x4F4E;&#x5176;&#x5404;&#x81EA;&#x8026;&#x5408;&#x5EA6;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7EF4;&#x6301;&#x8FD9;&#x4E9B;&#x793A;&#x4F8B;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5728;&#x8BE5;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x5B58;&#x5728;&#x56DB;&#x79CD;&#x89D2;&#x8272;&#xFF0C;&#x5373;&#xFF1A;</p>
<ul>
<li><strong>&#x62BD;&#x8C61;&#x4E3B;&#x9898;(Subject)</strong>&#xFF1A;&#x62BD;&#x8C61;&#x4E3B;&#x9898;&#x5C06;&#x6240;&#x6709;&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x4FDD;&#x5B58;&#x5230;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E3B;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x4EFB;&#x4F55;&#x6570;&#x91CF;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x3002;&#x62BD;&#x8C61;&#x4E3B;&#x9898;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x52A0;(Attach&#x65B9;&#x6CD5;)&#x548C;&#x5220;&#x9664;(Detach&#x65B9;&#x6CD5;)&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#x3002;</li>
<li><strong>&#x5177;&#x4F53;&#x4E3B;&#x9898;(ConcreteSubject)</strong>&#xFF1A;&#x5177;&#x4F53;&#x4E3B;&#x9898;&#x5C06;&#x5728;&#x5176;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x76F8;&#x5173;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5C06;&#x76F8;&#x5173;&#x72B6;&#x6001;&#x5B58;&#x5165;&#x5177;&#x4F53;&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x5177;&#x4F53;&#x4E3B;&#x9898;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x901A;&#x77E5;&#x6240;&#x6709;&#x6CE8;&#x518C;&#x8FC7;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x53D1;&#x51FA;&#x901A;&#x77E5;&#xFF0C;&#x5373;UML&#x7C7B;&#x56FE;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;Notify()&#x65B9;&#x6CD5;&#x3002;</li>
<li><strong>&#x62BD;&#x8C61;&#x89C2;&#x5BDF;&#x8005;(Observer)</strong>&#xFF1A;&#x62BD;&#x8C61;&#x89C2;&#x5BDF;&#x8005;&#x5C06;&#x4E3A;&#x6240;&#x6709;&#x5177;&#x4F53;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x5728;&#x83B7;&#x5F97;&#x4E3B;&#x9898;&#x66F4;&#x65B0;&#x901A;&#x77E5;&#x65F6;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#xFF0C;&#x5373;UML&#x7C7B;&#x56FE;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;Update()&#x65B9;&#x6CD5;&#xFF0C;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;&#x540E;&#x89C2;&#x5BDF;&#x8005;&#x4E0E;&#x4E3B;&#x9898;&#x7684;&#x72B6;&#x6001;&#x5B9E;&#x73B0;&#x540C;&#x6B65;&#x3002;</li>
<li><strong>&#x5177;&#x4F53;&#x89C2;&#x5BDF;&#x8005;(ConcreteObserver)</strong>&#xFF1A;&#x5177;&#x4F53;&#x89C2;&#x5BDF;&#x8005;&#x5C06;&#x5B9E;&#x73B0;&#x62BD;&#x8C61;&#x89C2;&#x5BDF;&#x8005;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x66F4;&#x65B0;&#x63A5;&#x53E3;&#xFF0C;&#x6765;&#x4F7F;&#x5F97;&#x89C2;&#x5BDF;&#x8005;&#x81EA;&#x8EAB;&#x7684;&#x72B6;&#x6001;&#x4E0E;&#x4E3B;&#x9898;&#x72B6;&#x6001;&#x534F;&#x8C03;&#xFF0C;&#x5373;&#x5177;&#x4F53;&#x89C2;&#x5BDF;&#x8005;&#x9700;&#x8981;&#x91CD;&#x5199;Update()&#x65B9;&#x6CD5;&#x5E76;&#x7EF4;&#x62A4;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x540C;&#x4E3B;&#x9898;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x81F3;&#x6B64;&#x6211;&#x4EEC;&#x5C31;&#x4ECE;&#x601D;&#x60F3;&#x4E0A;&#x7406;&#x89E3;&#x4E86;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5728;&#x7EF4;&#x62A4;&#x4E00;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x89C2;&#x5BDF;&#x8005;&#x4E0E;&#x4E3B;&#x9898;&#x90FD;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#x800C;&#x975E;&#x5177;&#x4F53;&#xFF0C;&#x4E24;&#x8005;&#x5206;&#x522B;&#x5C5E;&#x4E8E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x4E3B;&#x9898;&#x4E24;&#x8005;&#x95F4;&#x662F;&#x89E3;&#x8026;&#x7684;&#x3002;&#x53EF;&#x662F;&#x5F53;&#x4F60;&#x53BB;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4E3B;&#x9898;&#x6216;&#x8005;&#x5177;&#x4F53;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E24;&#x8005;&#x95F4;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x56E0;&#x4E3A;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x4E3B;&#x9898;&#x5728;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x4E0A;&#x9700;&#x8981;&#x534F;&#x8C03;&#xFF0C;&#x56E0;&#x4E3A;&#x4E24;&#x8005;&#x5206;&#x522B;&#x4F5C;&#x4E3A;&#x6D88;&#x606F;&#x7684;&#x201D;&#x63A5;&#x6536;&#x65B9;&#x201D;&#x548C;&#x201D;&#x53D1;&#x9001;&#x65B9;&#x201D;&#x5B58;&#x5728;&#x3002;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x867D;&#x7136;&#x5728;&#x89E3;&#x8026;&#x4E0A;&#x6548;&#x679C;&#x663E;&#x8457;&#xFF0C;&#x53EF;&#x8FD9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x5B83;&#x5C31;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F53;&#x89C2;&#x5BDF;&#x8005;&#x6570;&#x76EE;&#x7279;&#x522B;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3A;&#x4E86;&#x901A;&#x77E5;&#x6240;&#x6709;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x5C06;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5F53;&#x89C2;&#x5BDF;&#x8005;&#x95F4;&#x5B58;&#x5728;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x65F6;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5C06;&#x5BFC;&#x81F4;&#x8FD9;&#x4E9B;&#x89C2;&#x5BDF;&#x8005;&#x51FA;&#x73B0;&#x5FAA;&#x73AF;&#x8C03;&#x7528;&#xFF1B;&#x518D;&#x8005;&#xFF0C;&#x5F53;&#x4E3B;&#x9898;&#x901A;&#x8FC7;&#x5F02;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x901A;&#x77E5;&#x89C2;&#x5BDF;&#x8005;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x901A;&#x77E5;&#x672C;&#x8EAB;&#x662F;&#x4EE5;&#x81EA;&#x6D3D;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7684;&#xFF1B;&#x6700;&#x540E;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x89C2;&#x5BDF;&#x8005;&#x6355;&#x6349;&#x5230;&#x4E3B;&#x9898;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x53EF;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x673A;&#x5236;&#x672C;&#x8EAB;&#x4E0D;&#x5177;&#x5907;&#x77E5;&#x6653;&#x4E3B;&#x9898;&#x5982;&#x4F55;&#x53D8;&#x5316;&#x7684;&#x80FD;&#x529B;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x3002;</p>
<h2 id="&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;"><a href="#&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;" class="headerlink" title="&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;"></a>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;</h2><p>&#x2003;&#x2003;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7136;&#x4E86;&#x89E3;&#x5230;&#x5728;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x4E3B;&#x8981;&#x6709;&#x56DB;&#x7C7B;&#x89D2;&#x8272;&#xFF0C;&#x5373;&#x62BD;&#x8C61;&#x4E3B;&#x9898;&#x3001;&#x62BD;&#x8C61;&#x89C2;&#x5BDF;&#x8005;&#x3001;&#x5177;&#x4F53;&#x4E3B;&#x9898;&#x548C;&#x5177;&#x4F53;&#x89C2;&#x5BDF;&#x8005;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x56DB;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x8272;&#x3002;&#x56DE;&#x5230;&#x6211;&#x4EEC;&#x6700;&#x521D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5373;&#x5FAE;&#x4FE1;&#x7528;&#x6237;&#x8BA2;&#x9605;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x5047;&#x8BBE;&#x535A;&#x4E3B;&#x5E0C;&#x671B;&#x5728;&#x535A;&#x5BA2;&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE5;&#x90AE;&#x4EF6;&#x6216;&#x8005;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x901A;&#x77E5;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x535A;&#x5BA2;&#x66F4;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7EF4;&#x62A4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x663E;&#x7136;&#x6B64;&#x65F6;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x90AE;&#x4EF6;&#x548C;&#x516C;&#x4F17;&#x53F7;&#x662F;&#x4E24;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x800C;&#x535A;&#x5BA2;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4E3B;&#x9898;&#x3002;&#x53C2;&#x7167;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;UML&#x7C7B;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x4E24;&#x4E2A;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5373;Subject&#x548C;Observer&#x3002;</p>
<p>&#x2003;&#x2003;&#x5BF9;Subject&#x7C7B;&#x800C;&#x8A00;&#xFF0C;&#x9996;&#x5148;&#x5B83;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8BA2;&#x9605;(Subscribe&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x53D6;&#x6D88;&#x8BA2;&#x9605;(Unsubscribe)&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x548C;&#x6211;&#x4EEC;&#x5728;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x8BA2;&#x9605;&#x62A5;&#x7EB8;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;(Update)&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x8D1F;&#x8D23;&#x5411;&#x6240;&#x6709;&#x7684;&#x8BA2;&#x9605;&#x8005;&#x5E7F;&#x64AD;&#x6D88;&#x606F;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x505A;&#x5E7F;&#x64AD;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x8BA2;&#x9605;&#x8005;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x8FD9;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x79CD;&#x8BA2;&#x9605;&#x8005;&#x88AB;&#x52A8;&#x63A5;&#x53D7;&#x4E3B;&#x9898;&#x63A8;&#x9001;&#x6D88;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201D;&#x63A8;&#x9001;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x5373;&#x5728;Update&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3B;&#x9898;&#x4F1A;&#x4E3B;&#x52A8;&#x63A8;&#x9001;&#x201D;&#x53C2;&#x6570;&#x201D;&#x7ED9;&#x8BA2;&#x9605;&#x8005;&#xFF1B;&#x800C;&#x8BA2;&#x9605;&#x8005;&#x4E3B;&#x52A8;&#x62C9;&#x53D6;&#x4E3B;&#x9898;&#x6D88;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201D;&#x62C9;&#x53D6;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x5373;&#x5728;Update&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3B;&#x9898;&#x5E76;&#x4E0D;&#x4E3B;&#x52A8;&#x63A8;&#x9001;&#x201D;&#x53C2;&#x6570;&#x201D;&#x7ED9;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x8BA2;&#x9605;&#x8005;&#x901A;&#x8FC7;&#x6CE8;&#x5165;&#x7684;&#x4E3B;&#x9898;&#x6765;&#x83B7;&#x53D6;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x201D;&#x63A8;&#x9001;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span> <span class="keyword">abstract</span> <span class="keyword">class</span> <span class="title">Subject</span></span><br><span class="line">{</span><br><span class="line">   <span class="keyword">private</span> IList&lt;Observer&gt; observers = <span class="keyword">new</span> List&lt;Observer&gt;();</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">Attach</span>(<span class="params">Observer observer</span>)</span></span><br><span class="line"><span class="function"></span>   {</span><br><span class="line">      observers.Add(observer);</span><br><span class="line">   }</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">Deatch</span>(<span class="params">Observer observer</span>)</span></span><br><span class="line"><span class="function"></span>   {</span><br><span class="line">      observers.Remove(observer);</span><br><span class="line">   }</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">Notify</span>(<span class="params"><span class="keyword">string</span> message</span>)</span></span><br><span class="line"><span class="function"></span>   {</span><br><span class="line">      observers.ToList().ForEach(o =&gt; o.Update(message));</span><br><span class="line">   }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x2003;&#x2003;&#x5BF9;Observer&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x5728;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x627F;&#x62C5;&#x7740;&#x6D88;&#x606F;&#x63A5;&#x6536;&#x8005;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;&#x5176;&#x5B9A;&#x4E49;&#x597D;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x8BE5;&#x63A5;&#x53E3;&#x5FC5;&#x987B;&#x4E0E;&#x5177;&#x4F53;&#x4E3B;&#x9898;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x4FBF;&#x662F;&#x6211;&#x5728;&#x6587;&#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x4E3B;&#x9898;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4F9D;&#x8D56;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8003;&#x8651;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x90AE;&#x4EF6;&#x548C;&#x516C;&#x4F17;&#x53F7;&#x91C7;&#x53D6;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x63A8;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x56E0;&#x6B64;Update&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x88AB;&#x58F0;&#x660E;&#x4E3A;&#x865A;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x63D0;&#x4F9B;&#x91CD;&#x5199;&#x7684;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x3002;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span> <span class="keyword">abstract</span> <span class="keyword">class</span> <span class="title">Observer</span></span><br><span class="line">{</span><br><span class="line">   <span class="function"><span class="keyword">public</span> <span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">Update</span>(<span class="params"><span class="keyword">string</span> message</span>)</span></span><br><span class="line"><span class="function"></span>   {</span><br><span class="line">   </span><br><span class="line">   }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x2003;&#x2003;&#x5BF9;&#x5177;&#x4F53;&#x89C2;&#x5BDF;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7EE7;&#x627F;Observer&#x7C7B;&#x7136;&#x540E;&#x91CD;&#x5199;Update&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;EmailObserver&#x548C;WechatObserver&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x6765;&#x5B9E;&#x73B0;&#x90AE;&#x4EF6;&#x548C;&#x516C;&#x4F17;&#x53F7;&#x63A5;&#x6536;&#x5230;&#x4E3B;&#x9898;&#x63A8;&#x9001;&#x6D88;&#x606F;&#x4EE5;&#x540E;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x8FD9;&#x91CC;&#x4EE5;EmailObserver&#x4E3A;&#x4F8B;&#xFF0C;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;<br></p><figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span> <span class="keyword">class</span> <span class="title">EmailObserver</span>:<span class="title">Observer</span></span><br><span class="line">{</span><br><span class="line">   <span class="function"><span class="keyword">public</span> <span class="keyword">override</span> <span class="keyword">void</span> <span class="title">Update</span>(<span class="params"><span class="keyword">string</span> message</span>)</span></span><br><span class="line"><span class="function"></span>   {</span><br><span class="line">      Console.WriteLine(<span class="string">&quot;&#x90AE;&#x7BB1;&#x63A5;&#x6536;&#x5230;&#x8BA2;&#x9605;&#x6D88;&#x606F;:{0}&quot;</span>, message);</span><br><span class="line">   }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x5BF9;&#x5177;&#x4F53;&#x4E3B;&#x9898;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x5173;&#x5FC3;&#x5982;&#x4F55;&#x5411;&#x6240;&#x6709;&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x8BE5;&#x529F;&#x80FD;&#x5728;Subject&#x7236;&#x7C7B;&#x4E2D;&#x5DF2;&#x7136;&#x5B8C;&#x6210;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x9898;&#x7C7B;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x63CF;&#x8FF0;&#x5176;&#x5185;&#x90E8;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F8B;&#x5982;&#x6587;&#x7AE0;&#x6570;&#x76EE;&#x3001;&#x8BC4;&#x8BBA;&#x6570;&#x76EE;&#x6216;&#x8005;&#x662F;&#x5185;&#x5BB9;&#x66F4;&#x6539;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x7B80;&#x5355;&#x901A;&#x77E5;&#x8FD9;&#x4E24;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x7EE7;&#x627F;Subject&#x7C7B;&#x5373;&#x53EF;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5B8C;&#x6574;&#x7684;&#x8C03;&#x7528;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br></p><figure class="highlight haxe"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">BlogSubject blog = <span class="keyword">new</span> <span class="type">BlogSubject</span>();</span><br><span class="line">blog.Attach(<span class="keyword">new</span> <span class="type">EmailObserver</span>());</span><br><span class="line">blog.Attach(<span class="keyword">new</span> <span class="type">WechatObserver</span>());</span><br><span class="line">blog.Notify(<span class="string">&quot;Payne&#x66F4;&#x65B0;&#x4E86;Redis&#x7F13;&#x5B58;&#x6280;&#x672F;&#x5B66;&#x4E60;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&quot;</span>);</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;EmailObserver&#x548C;WechatObserver&#xFF0C;&#x90FD;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x6765;&#x81EA;&#x4E3B;&#x9898;Blog&#x7684;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5566;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x53EF;&#x662F;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#x516C;&#x4F17;&#x53F7;&#x4EE5;&#x540E;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x968F;&#x7740;&#x4F60;&#x8BA2;&#x9605;&#x7684;&#x5185;&#x5BB9;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x7684;&#x5FAE;&#x4FE1;&#x6D88;&#x606F;&#x5217;&#x8868;&#x91CC;&#x51FA;&#x73B0;&#x7684;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x597D;&#x50CF;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x53D6;&#x6D88;&#x8BA2;&#x9605;&#x3002;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x201D;&#x63A8;&#x9001;&#x6A21;&#x5F0F;&#x201D;&#x8BA9;&#x8BA2;&#x9605;&#x8005;&#x9971;&#x53D7;&#x6D88;&#x606F;&#x9A9A;&#x6270;&#xFF0C;&#x800C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x4E86;&#x201D;&#x62C9;&#x53D6;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x6B64;&#x65F6;&#x4E3B;&#x9898;&#x4EC5;&#x4EC5;&#x662F;&#x544A;&#x8BC9;&#x89C2;&#x5BDF;&#x8005;&#x535A;&#x5BA2;&#x5185;&#x5BB9;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x800C;&#x66F4;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x9700;&#x8981;&#x89C2;&#x5BDF;&#x8005;&#x81EA;&#x5DF1;&#x53BB;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53C2;&#x7167;&#x201D;&#x63A8;&#x9001;&#x6A21;&#x5F0F;&#x201D;&#x6765;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/None.jpg" alt="&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x57FA;&#x672C;&#x5B9E;&#x4F8B;" title>
                </div>
                <div class="image-caption">&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x57FA;&#x672C;&#x5B9E;&#x4F8B;</div>
            </figure>
<p>&#x2003;&#x2003;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#x5566;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x5B83;&#x89E3;&#x9664;&#x4E86;&#x4E3B;&#x9898;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x95F4;&#x7684;&#x8026;&#x5408;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x5F97;&#x8FD9;&#x4E24;&#x8005;&#x5404;&#x81EA;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#x800C;&#x975E;&#x5177;&#x4F53;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x9002;&#x7528;&#x7684;&#x573A;&#x666F;&#x662F;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6539;&#x53D8;&#x9700;&#x8981;&#x7ED9;&#x53D8;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4E0D;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;&#x5F85;&#x6539;&#x53D8;&#x65F6;&#x3002;&#x5728;C#&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x59D4;&#x6258;&#x3001;&#x4E8B;&#x4EF6;&#x4EE5;&#x53CA;Observable&#x63A5;&#x53E3;&#x8FD9;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x5FEB;&#x7684;&#x5B9E;&#x73B0;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x81EA;&#x7136;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x540E;&#x8BDD;&#x5566;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x63A2;&#x8BA8;&#x3002;</p>
<h2 id="Hey-Redis-Pub-Sub"><a href="#Hey-Redis-Pub-Sub" class="headerlink" title="Hey Redis Pub-Sub"></a>Hey Redis Pub-Sub</h2><p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x4E86;&#x89E3;&#x5B8C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5373;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Redis&#x4E2D;&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x5566;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Redis&#x4E2D;&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x524D;&#xFF0C;&#x4E86;&#x89E3;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x76F8;&#x5173;&#x7684;&#x6982;&#x5FF5;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;Redis&#x4E2D;&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x548C;Gof&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E00;&#x8109;&#x76F8;&#x627F;&#xFF0C;&#x8B6C;&#x5982;&#x4E8B;&#x4EF6;&#x673A;&#x5236;&#x3001;&#x6D88;&#x606F;&#x673A;&#x5236;&#x7B49;&#x6982;&#x5FF5;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x638C;&#x63E1;&#x4E86;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5145;&#x6EE1;&#x4E86;&#x5957;&#x8DEF;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x5BF9;&#x4F60;&#x6211;&#x800C;&#x8A00;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E9B;&#x7C7B;&#x56FE;&#xFF0C;&#x800C;&#x662F;&#x80FD;&#x5728;&#x6700;&#x6070;&#x5F53;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;Redis&#x4E2D;&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;&#x6D88;&#x606F;&#x901A;&#x4FE1;&#x6A21;&#x5F0F;&#xFF0C;&#x5373;&#x53D1;&#x5E03;&#x8005;&#x53D1;&#x5E03;&#x6D88;&#x606F;&#xFF0C;&#x8BA2;&#x9605;&#x8005;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x3002;&#x5728;Redis&#x4E2D;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x8BA2;&#x9605;&#x4EFB;&#x610F;&#x4E2A;&#x9891;&#x9053;&#xFF0C;&#x5F53;&#x8BE5;&#x9891;&#x9053;&#x5185;&#x63A5;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x8BA2;&#x9605;&#x8BE5;&#x9891;&#x9053;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x8FD9;&#x6761;&#x65B0;&#x6D88;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7406;&#x89E3;&#x8FD9;&#x79CD;&#x6D88;&#x606F;&#x901A;&#x4FE1;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x5FAE;&#x4FE1;&#x8D26;&#x53F7;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x53EF;&#x4EE5;&#x8BA2;&#x9605;&#x4EFB;&#x610F;&#x4E2A;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x5F53;&#x5FAE;&#x4FE1;&#x7684;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x4E0A;&#x63A5;&#x6536;&#x5230;&#x67D0;&#x4E2A;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x8BF7;&#x6C42;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x8BA2;&#x9605;&#x4E86;&#x8BE5;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x8BE5;&#x63A8;&#x9001;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x56FE;&#x793A;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/None.jpg" alt="Redis&#x4E2D;&#x7684;&#x6D88;&#x606F;&#x6A21;&#x5F0F;" title>
                </div>
                <div class="image-caption">Redis&#x4E2D;&#x7684;&#x6D88;&#x606F;&#x6A21;&#x5F0F;</div>
            </figure>
<p>&#x2003;&#x2003;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x548C;&#x6211;&#x4EEC;&#x5728;&#x6587;&#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x201D;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x201D;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x901A;&#x4FE1;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F5C;&#x4E3A;&#x6D88;&#x606F;&#x7684;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x5373;&#x89C2;&#x5BDF;&#x8005;&#x3002;&#x800C;&#x9891;&#x9053;&#x4F5C;&#x4E3A;&#x6D88;&#x606F;&#x7684;&#x53D1;&#x5E03;&#x8005;&#xFF0C;&#x5373;&#x4E3B;&#x9898;&#x3002;&#x5728;Redis&#x4E2D;&#x9891;&#x9053;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;Id&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x6765;&#x8BB2;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;Redis&#x4E2D;&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x662F;&#x975E;&#x5E38;&#x8F7B;&#x91CF;&#x5E76;&#x4E14;&#x5F3A;&#x5927;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x5E38;&#x89C1;&#x7684;&#x547D;&#x4EE4;&#xFF1A;</p>
<ul>
<li><p>PSUBSCRIBE&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x8BA2;&#x9605;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x7B26;&#x5408;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x9891;&#x9053;</p>
</li>
<li><p>PUBSUB&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x8FD4;&#x56DE;&#x7531;&#x6D3B;&#x8DC3;&#x9891;&#x9053;&#x7EC4;&#x6210;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5373;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x8BA2;&#x9605;&#x4E0E;&#x53D1;&#x5E03;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;</p>
</li>
<li><p>PUBLISH&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x9891;&#x9053;</p>
</li>
<li><p>PUNSUBSCRIBE&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x9000;&#x8BA2;&#x6240;&#x6709;&#x7B26;&#x5408;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x9891;&#x9053;</p>
</li>
<li><p>SUBSCRIBE&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x8BA2;&#x9605;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x9891;&#x9053;</p>
</li>
<li><p>UNSUBSCRIBE&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x9000;&#x8BA2;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x9891;&#x9053;</p>
</li>
</ul>
<p>&#x2003;&#x2003;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x548C;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x76F8;&#x5173;&#x7684;&#x547D;&#x4EE4;&#x5566;&#xFF0C;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x800C;&#x8A00;&#x5B83;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x6D01;&#x548C;&#x7D27;&#x51D1;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x901A;&#x7BC7;&#x90FD;&#x5728;&#x8BF4;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;Redis&#x7684;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x8BB2;&#x8FD8;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;Redis&#x5185;&#x90E8;&#x4F1A;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x9891;&#x9053;&#x7684;&#x5B57;&#x5178;&#xFF0C;&#x9996;&#x5148;&#x5B83;&#x4F1A;&#x4ECE;&#x9891;&#x9053;&#x5B57;&#x5178;&#x4E2D;&#x67E5;&#x627E;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5982;&#x679C;&#x5B57;&#x5178;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x8BE5;&#x9891;&#x9053;&#xFF0C;&#x5219;&#x5C06;&#x8BA2;&#x9605;&#x8BE5;&#x9891;&#x9053;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5217;&#x8868;&#x6DFB;&#x52A0;&#x5230;&#x5B57;&#x5178;&#x4E2D;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4F1A;&#x8FD4;&#x56DE;&#x5B57;&#x5178;&#x4E2D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5217;&#x8868;&#x3002;&#x5728;&#x83B7;&#x53D6;&#x5230;&#x6240;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x5217;&#x8868;&#x4EE5;&#x540E;&#xFF0C;Redis&#x5C06;&#x4F1A;&#x904D;&#x5386;&#x5BA2;&#x6237;&#x7AEF;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x7684;&#x89E3;&#x8BFB;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF1A;<a href="http://www.cnblogs.com/huangxincheng/p/5002794.html" target="_blank" rel="noopener">15&#x5929;&#x73A9;&#x8F6C;redis &#x2014;&#x2014; &#x7B2C;&#x4E5D;&#x7BC7; &#x53D1;&#x5E03;/&#x8BA2;&#x9605;&#x6A21;&#x5F0F;</a>&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6682;&#x65F6;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5B50;&#x5566;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x611F;&#x89C9;&#x6700;&#x8FD1;&#x5B66;&#x4E60;Redis&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x4E86;&#x5462;&#xFF1F;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x7684;&#x547D;&#x4EE4;&#x6F14;&#x793A;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x662F;&#x5728;Windows&#x7CFB;&#x7EDF;&#x4E0B;&#x5199;&#x5B8C;&#x7684;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6DF1;&#x591C;&#x5566;&#xFF0C;&#x7761;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#x6211;&#x4EEC;&#x8BA9;&#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;A&#x548C;B&#xFF0C;&#x8BA2;&#x9605;&#x540C;&#x4E00;&#x4E2A;&#x9891;&#x9053;News&#xFF0C;&#x7136;&#x540E;&#x7531;&#x5BA2;&#x6237;&#x7AEF;C&#x6765;&#x5411;&#x8FD9;&#x4E2A;&#x9891;&#x9053;News&#x5E7F;&#x64AD;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x5BA2;&#x6237;&#x7AEF;A&#x548C;&#x5BA2;&#x6237;&#x7AEF;B&#x90FD;&#x5C06;&#x4F1A;&#x6536;&#x5230;&#x8FD9;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x6B64;&#x65F6;&#x670D;&#x52A1;&#x7AEF;&#x662F;&#x5F00;&#x542F;&#x7684;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5BF9;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;A&#x548C;&#x5BA2;&#x6237;&#x7AEF;B&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x6253;&#x5F00;redis-cli&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#xFF1A;</p>
<figure class="highlight armasm"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&gt; <span class="keyword">SUBSCRIBE </span>News</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5728;&#x6309;&#x4E0B;&#x56DE;&#x8F66;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x4FE1;&#x606F;&#xFF1A;</p>
<figure class="highlight lsl"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line"><span class="number">1</span>) <span class="string">&quot;subscribe&quot;</span></span><br><span class="line"><span class="number">2</span>) <span class="string">&quot;News&quot;</span></span><br><span class="line"><span class="number">3</span>) (<span class="type">integer</span>) <span class="number">1</span></span><br></pre></td></tr></tbody></table></figure>
<p>&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5728;&#x5BA2;&#x6237;&#x7AEF;C&#x4E2D;&#x6765;&#x5E7F;&#x64AD;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF1A;</p>
<figure class="highlight css"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&gt; <span class="selector-tag">PUBLISH</span> <span class="selector-tag">News</span> &quot;<span class="selector-tag">This</span> <span class="selector-tag">is</span> <span class="selector-tag">a</span> <span class="selector-tag">message</span> <span class="selector-tag">sent</span> <span class="selector-tag">by</span> 127<span class="selector-class">.0</span><span class="selector-class">.0</span><span class="selector-class">.1</span><span class="selector-pseudo">:6379&quot;</span></span><br></pre></td></tr></tbody></table></figure>
<p>&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0B;&#x56FE;&#x4E2D;&#x6240;&#x793A;&#x7684;&#x7ED3;&#x679C;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz68j9g791j20j80c7abz.jpg" alt="Redis&#x4E2D;&#x53D1;&#x5E03;&#x8BA2;&#x9605;&#x6A21;&#x5F0F;" title>
                </div>
                <div class="image-caption">Redis&#x4E2D;&#x53D1;&#x5E03;&#x8BA2;&#x9605;&#x6A21;&#x5F0F;</div>
            </figure>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/4197961431/">Redis缓存技术学习系列之Lua脚本</a></li><li><a href="https://qinyuanpei.github.io/posts/335366821/">Redis缓存技术学习系列之事务处理</a></li><li><a href="https://qinyuanpei.github.io/posts/3032366281/">Redis缓存技术学习系列之邂逅Redis</a></li><li><a href="http://www.buildupchao.cn/2018/05/15/Redis缓存设计之令人兴奋的OOM/">Redis缓存设计之令人兴奋的OOM</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1444577573/" rel="external">Redis缓存技术学习系列之发布订阅</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1444577573/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1444577573/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Redis/">Redis</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/缓存/">缓存</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/设计模式/">设计模式</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1444577573/&title=《Redis缓存技术学习系列之发布订阅》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1444577573/&title=《Redis缓存技术学习系列之发布订阅》 — PayneQinのBlog&source=  各位朋友，大家好，我是Payne，欢迎大家关注我的博客，我的博客地址是http://qinyuanpei.com。最近这段时间的天气可谓是变幻莫测，常..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1444577573/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《Redis缓存技术学习系列之发布订阅》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1444577573/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1444577573/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/187480982/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">异步Lambda表达式问题的探索</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/335366821/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Redis缓存技术学习系列之事务处理</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1444577573/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1444577573/&title=《Redis缓存技术学习系列之发布订阅》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1444577573/&title=《Redis缓存技术学习系列之发布订阅》 — PayneQinのBlog&source=  各位朋友，大家好，我是Payne，欢迎大家关注我的博客，我的博客地址是http://qinyuanpei.com。最近这段时间的天气可谓是变幻莫测，常..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1444577573/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《Redis缓存技术学习系列之发布订阅》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1444577573/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1444577573/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1444577573/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
