<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        毕业就像指尖流沙 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;毕业就像指尖流沙，而我是那从指尖流过的沙子。我不知道该怎样来总结我的大学，即使我努力地寻找、努力地回避，我依然觉得大学对我而言就是这样一个讽刺的过程，曾经努力地想要摆脱这个专业最后却留了下来，最初对这个专业的热情随着时间一天天地消逝，到最后却发现自己夹在某种缝隙中左右为难。">
<meta name="keywords" content="梦想,人生,毕业">
<meta property="og:type" content="article">
<meta property="og:title" content="毕业就像指尖流沙">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/3461518355/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;毕业就像指尖流沙，而我是那从指尖流过的沙子。我不知道该怎样来总结我的大学，即使我努力地寻找、努力地回避，我依然觉得大学对我而言就是这样一个讽刺的过程，曾经努力地想要摆脱这个专业最后却留了下来，最初对这个专业的热情随着时间一天天地消逝，到最后却发现自己夹在某种缝隙中左右为难。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="毕业就像指尖流沙">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;毕业就像指尖流沙，而我是那从指尖流过的沙子。我不知道该怎样来总结我的大学，即使我努力地寻找、努力地回避，我依然觉得大学对我而言就是这样一个讽刺的过程，曾经努力地想要摆脱这个专业最后却留了下来，最初对这个专业的热情随着时间一天天地消逝，到最后却发现自己夹在某种缝隙中左右为难。">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">毕业就像指尖流沙</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">毕业就像指尖流沙</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-05-16T08:45:05.000Z" itemprop="datePublished" class="page-time">
  2015-05-16
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-毕业就像指尖流沙" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">毕业就像指尖流沙</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-05-16 08:45:05" datetime="2015-05-16T08:45:05.000Z" itemprop="datePublished">2015-05-16</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        9 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6BD5;&#x4E1A;&#x5C31;&#x50CF;&#x6307;&#x5C16;&#x6D41;&#x6C99;&#xFF0C;&#x800C;&#x6211;&#x662F;&#x90A3;&#x4ECE;&#x6307;&#x5C16;&#x6D41;&#x8FC7;&#x7684;&#x6C99;&#x5B50;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x6837;&#x6765;&#x603B;&#x7ED3;&#x6211;&#x7684;&#x5927;&#x5B66;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x52AA;&#x529B;&#x5730;&#x5BFB;&#x627E;&#x3001;&#x52AA;&#x529B;&#x5730;&#x56DE;&#x907F;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x89C9;&#x5F97;&#x5927;&#x5B66;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BBD;&#x523A;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x66FE;&#x7ECF;&#x52AA;&#x529B;&#x5730;&#x60F3;&#x8981;&#x6446;&#x8131;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#x6700;&#x540E;&#x5374;&#x7559;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x6700;&#x521D;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#x7684;&#x70ED;&#x60C5;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x4E00;&#x5929;&#x5929;&#x5730;&#x6D88;&#x901D;&#xFF0C;&#x5230;&#x6700;&#x540E;&#x5374;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5939;&#x5728;&#x67D0;&#x79CD;&#x7F1D;&#x9699;&#x4E2D;&#x5DE6;&#x53F3;&#x4E3A;&#x96BE;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x5927;&#x5BB6;&#x90FD;&#x8BA4;&#x4E3A;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x6BD4;&#x8F83;&#x51B7;&#x6DE1;&#xFF0C;&#x53EF;&#x662F;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x60F3;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x7B80;&#x5355;&#x5355;&#x7684;&#x4EBA;&#x800C;&#x5DF2;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x5373;&#x5C06;&#x6BD5;&#x4E1A;&#x5C31;&#x8868;&#x73B0;&#x51FA;&#x67D0;&#x79CD;&#x6BB7;&#x5207;&#x7684;&#x795E;&#x60C5;&#xFF0C;&#x5728;&#x6211;&#x7684;&#x5FC3;&#x91CC;&#x6211;&#x5F53;&#x505A;&#x670B;&#x53CB;&#x7684;&#x4F1A;&#x4E00;&#x76F4;&#x5F53;&#x4F5C;&#x670B;&#x53CB;&#xFF0C;&#x5373;&#x4F7F;&#x4EE5;&#x540E;&#x5927;&#x5BB6;&#x90FD;&#x9C9C;&#x6709;&#x673A;&#x4F1A;&#x518D;&#x805A;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x8BA8;&#x538C;&#x9152;&#x684C;&#x4E0A;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x4F1A;&#x7528;&#x559D;&#x9152;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x6765;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x5F7C;&#x6B64;&#x60C5;&#x611F;&#x7684;&#x89C1;&#x8BC1;&#x3002;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5584;&#x4E8E;&#x5356;&#x5F04;&#x548C;&#x6BB7;&#x52E4;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x5FC3;&#x76F4;&#x53E3;&#x5FEB;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x53C8;&#x7231;&#x53C8;&#x6068;&#xFF0C;&#x53EF;&#x662F;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x505A;&#x4E00;&#x4E2A;&#x8868;&#x91CC;&#x5982;&#x4E00;&#x7684;&#x4EBA;&#x3002;&#x670B;&#x53CB;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x76F4;&#x662F;&#x6211;&#x6240;&#x73CD;&#x89C6;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x541B;&#x5B50;&#x4E4B;&#x4EA4;&#x6DE1;&#x5982;&#x6C34;&#x8FD9;&#x6837;&#x7684;&#x5173;&#x7CFB;&#x5C31;&#x5F88;&#x597D;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5584;&#x4E8E;&#x8868;&#x6F14;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x62CD;VCR&#x8FD8;&#x662F;&#x548C;&#x5927;&#x5BB6;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x60F3;&#x6211;&#x559C;&#x6B22;&#x7684;&#x662F;&#x5927;&#x5BB6;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5149;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4E00;&#x8D77;&#x559D;&#x9152;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x627F;&#x8BA4;&#xFF0C;&#x56E0;&#x4E3A;&#x957F;&#x671F;&#x505A;&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#xFF0C;&#x8BA9;&#x6211;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x91CC;&#x53EA;&#x6709;0&#x548C;1&#xFF0C;&#x53EA;&#x6709;&#x5BF9;&#x548C;&#x9519;&#x3002;&#x53EF;&#x662F;&#x4EBA;&#x5374;&#x662F;&#x4E00;&#x79CD;&#x5947;&#x602A;&#x7684;&#x611F;&#x60C5;&#x52A8;&#x7269;&#xFF0C;&#x6211;&#x6709;&#x65F6;&#x5019;&#x751A;&#x81F3;&#x4F1A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x66F4;&#x559C;&#x6B22;&#x8BA1;&#x7B97;&#x673A;&#x800C;&#x4E0D;&#x662F;&#x4EBA;&#xFF0C;&#x4EBA;&#x5728;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x611F;&#x5230;&#x5B64;&#x72EC;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x5927;&#x5BB6;&#x90FD;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x771F;&#x7684;&#x4F1A;&#x5FEB;&#x4E50;&#x5417;&#xFF1F;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5B9E;&#x5728;&#x662F;&#x5FAE;&#x5999;&#x800C;&#x590D;&#x6742;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x751A;&#x81F3;&#x7269;&#x8054;&#x7F51;&#x90FD;&#x4E0D;&#x80FD;&#x4E0E;&#x4E4B;&#x5339;&#x654C;&#x3002;&#x6211;&#x77E5;&#x9053;&#x5728;&#x4E2D;&#x56FD;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x91CC;&#xFF0C;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x7279;&#x522B;&#x5730;&#x6B63;&#x5E38;&#xFF0C;&#x56E0;&#x4E3A;&#x4E2D;&#x56FD;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EBA;&#x60C5;&#x793E;&#x4F1A;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x542C;&#x5230;&#x522B;&#x4EBA;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x600E;&#x4E48;&#x6837;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4F60;&#x5904;&#x5728;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5708;&#x5B50;&#x91CC;&#x3002;&#x867D;&#x7136;&#x5728;&#x6211;&#x9605;&#x8BFB;&#x8FC7;&#x7684;&#x4E66;&#x7C4D;&#x91CC;&#x3001;&#x63A5;&#x89E6;&#x8FC7;&#x7684;&#x4EBA;&#x7684;&#x8BDD;&#x8BED;&#x91CC;&#x90FD;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x7ED3;&#x8BBA;&#xFF0C;&#x53EF;&#x662F;&#x9053;&#x7406;&#x7EC8;&#x7A76;&#x662F;&#x9053;&#x7406;&#xFF0C;&#x5F53;&#x4F60;&#x8BD5;&#x56FE;&#x53BB;&#x5C06;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x771F;&#x6B63;&#x5B9E;&#x8DF5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x5207;&#x662F;&#x5982;&#x6B64;&#x7684;&#x8270;&#x96BE;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5927;&#x5BB6;&#x6216;&#x8BB8;&#x89C9;&#x5F97;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x73ED;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x611F;&#x60C5;&#xFF0C;&#x53EF;&#x662F;&#x4EBA;&#x548C;&#x4EBA;&#x76F8;&#x5904;&#x4E0D;&#x80FD;&#x5355;&#x7EAF;&#x5730;&#x770B;&#x91CD;&#x5BF9;&#x65B9;&#x76EE;&#x524D;&#x3001;&#x4EE5;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x4F60;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E0D;&#x53EB;&#x670B;&#x53CB;&#x53EB;&#x505A;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x773C;&#x4E2D;&#x7684;&#x670B;&#x53CB;&#x662F;&#x90A3;&#x79CD;&#x5373;&#x4F7F;&#x81EA;&#x8EAB;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5F3A;&#x5927;&#x7684;&#x793E;&#x4F1A;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5E2E;&#x52A9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4ECD;&#x7136;&#x4F1A;&#x771F;&#x5FC3;&#x5B9E;&#x610F;&#x5730;&#x4E3A;&#x4F60;&#x4ED8;&#x51FA;&#xFF0C;&#x6211;&#x5BF9;&#x4E8E;&#x670B;&#x53CB;&#x548C;&#x5173;&#x7CFB;&#x7684;&#x754C;&#x5B9A;&#x5B9E;&#x5728;&#x662F;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x6211;&#x9762;&#x5BF9;&#x8FD9;&#x573A;&#x4E0D;&#x77E5;&#x662F;&#x9001;&#x522B;&#x8FD8;&#x662F;&#x4EA4;&#x53CB;&#x7684;&#x6BD5;&#x4E1A;&#x805A;&#x4F1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x7A81;&#x7136;&#x9677;&#x5165;&#x67D0;&#x79CD;&#x8FF7;&#x832B;&#xFF0C;&#x5373;&#x4F7F;&#x9EA6;&#x514B;&#x98CE;&#x97F3;&#x91CF;&#x5F00;&#x5230;&#x6700;&#x5927;&#x3001;&#x55D3;&#x5B50;&#x558A;&#x5230;&#x58F0;&#x5636;&#x529B;&#x7AED;&#xFF0C;&#x5F53;&#x4E00;&#x5207;&#x90FD;&#x7ED3;&#x675F;&#x4E86;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x7559;&#x4E0B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7EC8;&#x6709;&#x4E00;&#x5929;&#x5927;&#x5BB6;&#x90FD;&#x4F1A;&#x5954;&#x5411;&#x5404;&#x81EA;&#x7684;&#x524D;&#x7A0B;&#xFF0C;&#x53BB;&#x505A;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x50CF;&#x6155;&#x5BB9;&#x7D2B;&#x82F1;&#x4E00;&#x6837;&#xFF0C;&#x767E;&#x5E74;&#x8E49;&#x8DCE;&#x5C81;&#x6708;&#x4E0D;&#x8FC7;&#x8F6C;&#x77AC;&#xFF0C;&#x5F53;&#x670B;&#x53CB;&#x4EEC;&#x90FD;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4ED6;&#x7167;&#x987E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4F1A;&#x4E49;&#x65E0;&#x53CD;&#x987E;&#x5730;&#x8E0F;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x8DEF;&#xFF0C;&#x4ED6;&#x5FC3;&#x91CC;&#x8BB0;&#x5F97;&#x90A3;&#x53E5;&#x201C;&#x627F;&#x541B;&#x6B64;&#x8BFA;&#xFF0C;&#x5FC5;&#x5B88;&#x4E00;&#x751F;&#x201D;&#xFF0C;&#x53EF;&#x662F;&#x5343;&#x767E;&#x5E74;&#x540E;&#x5F53;&#x6606;&#x4ED1;&#x5C71;&#x4E0A;&#x4E0B;&#x8D77;&#x96EA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E16;&#x4E0A;&#x7559;&#x7ED9;&#x4ED6;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4ED6;&#x7EC8;&#x7A76;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E0A;&#x5929;&#x601C;&#x60AF;&#x4ED6;&#x5374;&#x4E0D;&#x66FE;&#x5FC3;&#x75BC;&#x4ED6;&#xFF0C;&#x5F53;&#x5FC3;&#x4E2D;&#x4FE1;&#x5FF5;&#x574D;&#x584C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x662F;&#x4E0D;&#x662F;&#x548C;&#x6211;&#x4E00;&#x6837;&#x6709;&#x8FC7;&#x8FD9;&#x79CD;&#x8FF7;&#x832B;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x6628;&#x5929;&#x6211;&#x548C;&#x73ED;&#x91CC;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4EBA;&#x559D;&#x4E86;&#x9152;&#xFF0C;&#x76EE;&#x7684;&#x5355;&#x7EAF;&#x800C;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x60F3;&#x611F;&#x8C22;&#x5927;&#x5BB6;&#x5728;&#x8FD9;&#x56DB;&#x5E74;&#x91CC;&#x5BF9;&#x6211;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x5C31;&#x662F;&#x60F3;&#x8BB0;&#x4F4F;&#x548C;&#x5927;&#x5BB6;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x8FD9;&#x6BB5;&#x65F6;&#x5149;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x548C;&#x7684;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x4F1A;&#x5F3A;&#x8FEB;&#x522B;&#x4EBA;&#x559D;&#x591A;&#x5C11;&#x9152;&#xFF0C;&#x56E0;&#x4E3A;&#x559D;&#x9152;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x52A9;&#x5174;&#x7684;&#x5F62;&#x5F0F;&#x800C;&#x5DF2;&#xFF0C;&#x771F;&#x6B63;&#x8BA9;&#x6211;&#x4EEC;&#x94ED;&#x8BB0;&#x4E8E;&#x5FC3;&#x7684;&#x4E0D;&#x662F;&#x8FD9;&#x987F;&#x9152;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x4EEC;&#x5F7C;&#x6B64;&#x5728;&#x5404;&#x81EA;&#x7684;&#x751F;&#x547D;&#x91CC;&#x51FA;&#x73B0;&#x8FC7;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5C1A;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x4EBA;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x4EE5;&#x540E;&#x6211;&#x4F1A;&#x53D8;&#x6210;&#x8BA9;&#x5927;&#x5BB6;&#x3001;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x559C;&#x6B22;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EE5;&#x540E;&#x4F9D;&#x7136;&#x4F1A;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x2026;&#x2026;&#x751F;&#x547D;&#x4E2D;&#x6709;&#x592A;&#x591A;&#x7684;&#x6216;&#x8BB8;&#x8BA9;&#x4EBA;&#x65E0;&#x6CD5;&#x9884;&#x6599;&#xFF0C;&#x53EF;&#x4F60;&#x7684;&#x751F;&#x547D;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x5B8C;&#x5168;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x4E3A;&#x672A;&#x6765;&#x57CB;&#x4E0B;&#x592A;&#x591A;&#x7684;&#x4F0F;&#x7B14;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x3001;&#x5E73;&#x51E1;&#x7684;&#x4EBA;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#x2026;&#x2026;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/786195243/">做最初的自己</a></li><li><a href="https://qinyuanpei.github.io/posts/3321992673/">当梦想照进现实</a></li><li><a href="https://qinyuanpei.github.io/posts/786195243/">做最初的自己</a></li><li><a href="https://blog.yuanpei.me/posts/786195243/">做最初的自己</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/3461518355/" rel="external">毕业就像指尖流沙</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/3461518355/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/3461518355/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/人生/">人生</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/梦想/">梦想</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/毕业/">毕业</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3461518355/&title=《毕业就像指尖流沙》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3461518355/&title=《毕业就像指尖流沙》 — PayneQinのBlog&source=&emsp;&emsp;毕业就像指尖流沙，而我是那从指尖流过的沙子。我不知道该怎样来总结我的大学，即使我努力地寻找、努力地回避，我依然觉得大学对我而言就是..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3461518355/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《毕业就像指尖流沙》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3461518355/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3461518355/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/719322223/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">Unity3D游戏开发之路：一周工作总结</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/4088452183/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Unity3D游戏开发之MMD For Unity插件研究</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/3461518355/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3461518355/&title=《毕业就像指尖流沙》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3461518355/&title=《毕业就像指尖流沙》 — PayneQinのBlog&source=&emsp;&emsp;毕业就像指尖流沙，而我是那从指尖流过的沙子。我不知道该怎样来总结我的大学，即使我努力地寻找、努力地回避，我依然觉得大学对我而言就是..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3461518355/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《毕业就像指尖流沙》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3461518355/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3461518355/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/3461518355/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
