<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        愿浮萍乘风破浪 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="或许是今年的贺岁档电影全部遭遇“滑铁卢”的缘故，在这种情况下，电影《乘风破浪》或许会成为拯救整个贺一个岁档的奇迹。同往常一样，我依然选择一个人去看电影，而庆幸的是韩寒真的没有让我们失望。虽然前期在微博上经常看到韩寒在为这部电影做宣传，但我一直想知道它会一种什么样的方式来讲述这个故事，我隐隐约约觉得徐太浪(邓超饰)、徐正太(彭于晏饰)、小花(赵丽颖饰)三个人之间的关系非同寻常，我甚至臆想这">
<meta name="keywords" content="电影,韩寒,青春">
<meta property="og:type" content="article">
<meta property="og:title" content="愿浮萍乘风破浪">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2314414875/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="或许是今年的贺岁档电影全部遭遇“滑铁卢”的缘故，在这种情况下，电影《乘风破浪》或许会成为拯救整个贺一个岁档的奇迹。同往常一样，我依然选择一个人去看电影，而庆幸的是韩寒真的没有让我们失望。虽然前期在微博上经常看到韩寒在为这部电影做宣传，但我一直想知道它会一种什么样的方式来讲述这个故事，我隐隐约约觉得徐太浪(邓超饰)、徐正太(彭于晏饰)、小花(赵丽颖饰)三个人之间的关系非同寻常，我甚至臆想这">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="愿浮萍乘风破浪">
<meta name="twitter:description" content="或许是今年的贺岁档电影全部遭遇“滑铁卢”的缘故，在这种情况下，电影《乘风破浪》或许会成为拯救整个贺一个岁档的奇迹。同往常一样，我依然选择一个人去看电影，而庆幸的是韩寒真的没有让我们失望。虽然前期在微博上经常看到韩寒在为这部电影做宣传，但我一直想知道它会一种什么样的方式来讲述这个故事，我隐隐约约觉得徐太浪(邓超饰)、徐正太(彭于晏饰)、小花(赵丽颖饰)三个人之间的关系非同寻常，我甚至臆想这">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">愿浮萍乘风破浪</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">愿浮萍乘风破浪</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-02-04T22:31:33.000Z" itemprop="datePublished" class="page-time">
  2017-02-04
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-愿浮萍乘风破浪" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">愿浮萍乘风破浪</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-02-04 22:31:33" datetime="2017-02-04T22:31:33.000Z" itemprop="datePublished">2017-02-04</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        17 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <embed src="//music.163.com/style/swf/widget.swf?sid=456185374&amp;type=2&amp;auto=1&amp;width=320&amp;height=66" width="340" height="86" allownetworking="all">

<p>&#x2003;&#x2003; &#x6216;&#x8BB8;&#x662F;&#x4ECA;&#x5E74;&#x7684;&#x8D3A;&#x5C81;&#x6863;&#x7535;&#x5F71;&#x5168;&#x90E8;&#x906D;&#x9047;&#x201C;&#x6ED1;&#x94C1;&#x5362;&#x201D;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7535;&#x5F71;&#x300A;&#x4E58;&#x98CE;&#x7834;&#x6D6A;&#x300B;&#x6216;&#x8BB8;&#x4F1A;&#x6210;&#x4E3A;&#x62EF;&#x6551;&#x6574;&#x4E2A;&#x8D3A;&#x4E00;&#x4E2A;&#x5C81;&#x6863;&#x7684;&#x5947;&#x8FF9;&#x3002;&#x540C;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x770B;&#x7535;&#x5F71;&#xFF0C;&#x800C;&#x5E86;&#x5E78;&#x7684;&#x662F;&#x97E9;&#x5BD2;&#x771F;&#x7684;&#x6CA1;&#x6709;&#x8BA9;&#x6211;&#x4EEC;&#x5931;&#x671B;&#x3002;&#x867D;&#x7136;&#x524D;&#x671F;&#x5728;&#x5FAE;&#x535A;&#x4E0A;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x97E9;&#x5BD2;&#x5728;&#x4E3A;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x505A;&#x5BA3;&#x4F20;&#xFF0C;&#x4F46;&#x6211;&#x4E00;&#x76F4;&#x60F3;&#x77E5;&#x9053;&#x5B83;&#x4F1A;&#x4E00;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8BB2;&#x8FF0;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x6211;&#x9690;&#x9690;&#x7EA6;&#x7EA6;&#x89C9;&#x5F97;&#x5F90;&#x592A;&#x6D6A;(&#x9093;&#x8D85;&#x9970;)&#x3001;&#x5F90;&#x6B63;&#x592A;(&#x5F6D;&#x4E8E;&#x664F;&#x9970;)&#x3001;&#x5C0F;&#x82B1;(&#x8D75;&#x4E3D;&#x9896;&#x9970;)&#x4E09;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x975E;&#x540C;&#x5BFB;&#x5E38;&#xFF0C;&#x6211;&#x751A;&#x81F3;&#x81C6;&#x60F3;&#x8FD9;&#x662F;&#x4E00;&#x90E8;&#x4FD7;&#x5957;&#x7684;&#x4E09;&#x89D2;&#x604B;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x53EF;&#x7ED3;&#x679C;&#x5374;&#x662F;&#x5B8C;&#x5168;&#x51FA;&#x4EBA;&#x610F;&#x6599;&#x7684;&#xFF0C;&#x6211;&#x5F88;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x9996;&#x5148;&#xFF0C;&#x7535;&#x5F71;&#x4E00;&#x5F00;&#x5934;&#x5C31;&#x9879;&#x6211;&#x4EEC;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x77DB;&#x76FE;&#x51B2;&#x7A81;&#xFF0C;&#x4ECE;&#x5C0F;&#x559C;&#x6B22;&#x8D5B;&#x8F66;&#x7684;&#x513F;&#x5B50;&#x5F90;&#x592A;&#x6D6A;&#x548C;&#x575A;&#x51B3;&#x53CD;&#x5BF9;&#x513F;&#x5B50;&#x4EE5;&#x8D5B;&#x8F66;&#x4F5C;&#x4E3A;&#x804C;&#x4E1A;&#x7684;&#x7236;&#x4EB2;&#x5F90;&#x6B63;&#x592A;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x6216;&#x8BB8;&#x90FD;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x6267;&#x8457;&#x5730;&#x559C;&#x6B22;&#x8FC7;&#x4EC0;&#x4E48;&#x6216;&#x662F;&#x70ED;&#x7231;&#x8FC7;&#x4EC0;&#x4E48;&#xFF0C;&#x53EF;&#x8FD9;&#x79CD;&#x559C;&#x6B22;&#x5728;&#x7236;&#x6BCD;&#x773C;&#x4E2D;&#x5E38;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x53DB;&#x9006;&#x3002;&#x6211;&#x5927;&#x5B66;&#x56DB;&#x5E74;&#x91CC;&#x6700;&#x53CD;&#x611F;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x6211;&#x7684;&#x672C;&#x79D1;&#x4E13;&#x4E1A;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5F88;&#x559C;&#x6B22;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#xFF0C;&#x786E;&#x5207;&#x5730;&#x8BF4;&#x662F;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x6765;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x9AD8;&#x8003;&#x6210;&#x7EE9;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x5F53;&#x65F6;&#x5728;&#x7236;&#x4EB2;&#x7684;&#x5EFA;&#x8BAE;&#x4E0B;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x7684;&#x4E13;&#x4E1A;&#xFF0C;&#x5728;&#x8FD9;&#x56DB;&#x5E74;&#x91CC;&#x6211;&#x505A;&#x8FC7;&#x6700;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x6781;&#x529B;&#x60F3;&#x8981;&#x6446;&#x8131;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#x3002;&#x6211;&#x4ECE;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x5C06;&#x7F16;&#x7A0B;&#x89C6;&#x4E3A;&#x6211;&#x4E3B;&#x8981;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x6211;&#x4ECE;&#x5927;&#x5B66;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x59CB;&#x7814;&#x7A76;&#x81EA;&#x5DF1;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5F00;&#x59CB;&#x5728;&#x6280;&#x672F;&#x793E;&#x533A;&#x91CC;&#x64B0;&#x5199;&#x535A;&#x5BA2;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x6BB5;&#x7ECF;&#x5386;&#x8BA9;&#x6211;&#x81F3;&#x4ECA;&#x90FD;&#x96BE;&#x4EE5;&#x5FD8;&#x6000;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x6559;&#x4F1A;&#x6211;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x5F53;&#x4F60;&#x8BA4;&#x51C6;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x5DE6;&#x53F3;&#x4F60;&#x7684;&#x9009;&#x62E9;&#xFF0C;2016&#x5E74;&#x4E0A;&#x534A;&#x5E74;&#x6211;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5931;&#x4E1A;&#x3002;&#x867D;&#x7136;&#x5468;&#x56F4;&#x4EBA;&#x90FD;&#x5728;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x8003;&#x516C;&#x52A1;&#x5458;&#x6216;&#x8005;&#x9009;&#x62E9;&#x6211;&#x672C;&#x4E13;&#x4E1A;&#x6216;&#x8BB8;&#x4F1A;&#x6BD4;&#x6211;&#x7684;&#x9009;&#x62E9;&#x66F4;&#x4E3A;&#x5149;&#x660E;&#xFF0C;&#x4F46;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4E00;&#x76F4;&#x627E;&#x4E0D;&#x5230;&#x559C;&#x6B22;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x5728;&#x5FC3;&#x91CC;&#x95EE;&#x6211;&#x81EA;&#x5DF1;&#xFF1A;&#x96BE;&#x9053;&#x6211;&#x6CE8;&#x5B9A;&#x4E0D;&#x80FD;&#x53BB;&#x505A;&#x6211;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#x5417;&#xFF1F;&#x540E;&#x6765;&#x6211;&#x72EC;&#x81EA;&#x4E00;&#x4E2A;&#x4EBA;&#x6765;&#x5230;&#x897F;&#x5B89;&#xFF0C;&#x6211;&#x754F;&#x60E7;&#x9003;&#x79BB;&#x5317;&#x4E0A;&#x5E7F;&#x7684;&#x90A3;&#x79CD;&#x65E0;&#x529B;&#x611F;&#x548C;&#x5B64;&#x72EC;&#x611F;&#xFF0C;&#x53EF;&#x5176;&#x5B9E;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x897F;&#x5B89;&#x540C;&#x6837;&#x662F;&#x5B64;&#x72EC;&#x7684;&#x3002;&#x7236;&#x6BCD;&#x81EA;&#x7136;&#x662F;&#x4E3A;&#x4E86;&#x6211;&#x4EEC;&#x597D;&#xFF0C;&#x53EF;&#x8FD9;&#x79CD;&#x4E24;&#x4EE3;&#x4EBA;&#x7684;&#x77DB;&#x76FE;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x6301;&#x7EED;&#x4E0B;&#x53BB;&#xFF0C;&#x5F53;&#x5F90;&#x592A;&#x6D6A;&#x9762;&#x5BF9;&#x7740;&#x955C;&#x5934;&#x5927;&#x58F0;&#x8BF4;&#x51FA;&#x90A3;&#x4E9B;&#x538B;&#x6291;&#x5728;&#x5FC3;&#x5E95;&#x7684;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E2A;&#x61E6;&#x5F31;&#x800C;&#x82CD;&#x8001;&#x7684;&#x7236;&#x4EB2;&#xFF0C;&#x6216;&#x8BB8;&#x5728;&#x6BCF;&#x4E2A;&#x4EBA;&#x8EAB;&#x4E0A;&#x90FD;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5F71;&#x5B50;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x592A;&#x60F3;&#x5728;&#x7236;&#x4EB2;&#x9762;&#x524D;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x5F90;&#x592A;&#x6D6A;&#x53D6;&#x5F97;&#x8D5B;&#x8F66;&#x6BD4;&#x8D5B;&#x51A0;&#x519B;&#x65F6;&#xFF0C;&#x4ED6;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x8BA9;&#x7236;&#x4EB2;&#x5750;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x526F;&#x9A7E;&#x9A76;&#x4F4D;&#x4E0A;&#xFF0C;&#x4E00;&#x5982;&#x7535;&#x5F71;&#x5F00;&#x5934;&#x90A3;&#x547C;&#x5578;&#x800C;&#x8FC7;&#x7684;&#x4E00;&#x62B9;&#x8F66;&#x5F71;&#xFF0C;&#x5F53;&#x8D5B;&#x8F66;&#x7A7F;&#x8FC7;&#x873F;&#x8712;&#x7684;&#x5C71;&#x8DEF;&#x3001;&#x7A7F;&#x8FC7;&#x5E9F;&#x65E7;&#x7684;&#x57CE;&#x9547;&#xFF0C;&#x5728;&#x604D;&#x60DA;&#x95F4;&#x6211;&#x597D;&#x50CF;&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x5728;&#x300A;&#x5E73;&#x51E1;&#x4E4B;&#x8DEF;&#x300B;&#x4E2D;&#x4E00;&#x76F4;&#x8513;&#x5EF6;&#x7740;&#x7684;&#x65E0;&#x5C3D;&#x7684;&#x957F;&#x8DEF;&#xFF0C;&#x5F53;&#x955C;&#x5934;&#x548C;&#x753B;&#x9762;&#x9891;&#x7E41;&#x5207;&#x6362;&#x7740;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x662F;&#x65F6;&#x95F4;&#x7A7F;&#x8D8A;&#x4E86;&#x5386;&#x53F2;&#xFF0C;&#x5176;&#x5B9E;&#x65F6;&#x95F4;&#x5C31;&#x9759;&#x6B62;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#x4E0D;&#x8FC7;&#x662F;&#x90A3;&#x4E9B;&#x8F6C;&#x77AC;&#x5373;&#x901D;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x6240;&#x542C;&#x5230;&#x7684;&#x4E0D;&#x8FC7;&#x662F;&#x90A3;&#x4E9B;&#x547C;&#x5578;&#x800C;&#x8FC7;&#x7684;&#x98CE;&#x58F0;&#x3002;&#x6211;&#x7279;&#x522B;&#x559C;&#x6B22;&#x5F90;&#x592A;&#x6D6A;&#x7684;&#x8D5B;&#x8F66;&#x4E0E;&#x8D27;&#x8F66;&#x64E6;&#x80A9;&#x800C;&#x8FC7;&#x65F6;&#xFF0C;&#x4E00;&#x5207;&#x53D8;&#x5F97;&#x652F;&#x79BB;&#x7834;&#x788E;&#x7684;&#x90A3;&#x7EC4;&#x6162;&#x955C;&#x5934;&#xFF0C;&#x5B83;&#x5C31;&#x50CF;&#x4E00;&#x5C42;&#x5C42;&#x5730;&#x892A;&#x53BB;&#x5916;&#x8868;&#x534E;&#x4E3D;&#x7684;&#x6CB9;&#x6F06;&#xFF0C;&#x76F4;&#x63A5;&#x8BA9;&#x6591;&#x9A73;&#x7684;&#x7EB9;&#x7406;&#x4E00;&#x70B9;&#x70B9;&#x5730;&#x88F8;&#x9732;&#x51FA;&#x6765;&#xFF0C;&#x5F53;&#x8F66;&#x7A97;&#x73BB;&#x7483;&#x7834;&#x788E;&#x5E76;&#x8DCC;&#x843D;&#x5728;&#x7A7A;&#x6C14;&#x91CC;&#xFF0C;&#x5F53;&#x5E86;&#x795D;&#x6210;&#x529F;&#x7684;&#x9999;&#x69DF;&#x548C;&#x5956;&#x676F;&#x6DF7;&#x6742;&#x5728;&#x7A7A;&#x6C14;&#x91CC;&#x3002;&#x6216;&#x8BB8;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x6240;&#x6709;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x518D;&#x91CD;&#x8981;&#x4E86;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x6D17;&#x53BB;&#x94C5;&#x534E;&#x8FD4;&#x749E;&#x5F52;&#x771F;&#xFF0C;&#x5927;&#x6982;&#x53EA;&#x6709;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x7684;&#x7075;&#x9B42;&#x5B8C;&#x5168;&#x53D8;&#x5F97;&#x7EAF;&#x51C0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6216;&#x8BB8;&#x7A7F;&#x8D8A;&#x8FD9;&#x79CD;&#x5F71;&#x89C6;&#x8868;&#x73B0;&#x624B;&#x6CD5;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x5F90;&#x592A;&#x6D6A;&#x5728;&#x533B;&#x9662;&#x75C5;&#x5E8A;&#x4E0A;&#x9192;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x773C;&#x89D2;&#x662F;&#x5E26;&#x7740;&#x6CEA;&#x6C34;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#x91CC;&#x6240;&#x53D9;&#x8FF0;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6211;&#x5B81;&#x613F;&#x5C06;&#x5176;&#x5F53;&#x4F5C;&#x662F;&#x5F90;&#x592A;&#x6D6A;&#x7684;&#x4E00;&#x4E2A;&#x68A6;&#x5427;&#xFF01;&#x4ED6;&#x56E0;&#x4E3A;&#x4ECE;&#x5C0F;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x6BCD;&#x4EB2;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x8981;&#x52AA;&#x529B;&#x77E5;&#x9053;&#x6BCD;&#x4EB2;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x5728;&#x6B7B;&#x4EA1;&#x8FB9;&#x7F18;&#x6210;&#x4E3A;&#x4E86;&#x4ED6;&#x7684;&#x4E00;&#x79CD;&#x6267;&#x5FF5;&#x3002;&#x5F71;&#x7247;&#x4E3A;&#x4E86;&#x523B;&#x610F;&#x5236;&#x9020;&#x7B11;&#x70B9;&#xFF0C;&#x8BA9;&#x5F90;&#x592A;&#x6D6A;&#x8EAB;&#x4E0A;&#x591A;&#x4E86;&#x8BB8;&#x591A;&#x201C;&#x7A7F;&#x8D8A;&#x201D;&#x7684;&#x7279;&#x8D28;&#xFF0C;&#x5176;&#x5B9E;&#x5BF9;&#x89C2;&#x4F17;&#x800C;&#x8A00;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x79CD;&#x4EE3;&#x5165;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x201C;&#x7A7F;&#x8D8A;&#x201D;&#x4EE5;&#x540E;&#x7684;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x4E0D;&#x662F;&#x5F90;&#x592A;&#x6D6A;&#x672C;&#x8EAB;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x91CD;&#x8981;&#x4E86;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x4EBA;&#x4E86;&#x89E3;&#x4E86;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x89E3;&#x60D1;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7EBF;&#x7D22;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x5F90;&#x592A;&#x6D6A;&#x660E;&#x767D;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x7236;&#x4EB2;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x53D8;&#x6210;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x800C;&#x56F4;&#x7ED5;&#x8FD9;&#x4E9B;&#x7EBF;&#x7D22;&#xFF0C;&#x6574;&#x7406;&#x7684;&#x51B2;&#x7A81;&#x53D1;&#x751F;&#x5728;&#x4EE5;&#x5F90;&#x6B63;&#x592A;&#x3001;&#x516D;&#x4E00;&#x3001;&#x963F;&#x6D6A;&#x3001;&#x5C0F;&#x9A6C;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x201C;&#x6B63;&#x592A;&#x5E2E;&#x201D;&#x548C;&#x9EC4;&#x5FD7;&#x5F3A;&#x3001;&#x7F57;&#x529B;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x201C;&#x9ED1;&#x793E;&#x4F1A;&#x201D;&#xFF0C;&#x53CC;&#x65B9;&#x7684;&#x5229;&#x76CA;&#x51B2;&#x7A81;&#x4EA4;&#x7EC7;&#x5728;&#x4E00;&#x95F4;&#x6B4C;&#x821E;&#x5385;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5F90;&#x6B63;&#x592A;&#x7684;&#x4E00;&#x4E2A;&#x68A6;&#x60F3;&#x662F;&#x201C;&#x6B4C;&#x821E;&#x5385;&#x91CC;&#x53EA;&#x5531;&#x6B4C;&#xFF0C;&#x6851;&#x62FF;&#x623F;&#x91CC;&#x5C31;&#x6D17;&#x6FA1;&#x201D;&#xFF0C;&#x800C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x8FD1;&#x4E4E;&#x4E4C;&#x6258;&#x90A6;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x6240;&#x4EE5;&#x5E74;&#x8F7B;&#x7684;&#x5F90;&#x6B63;&#x592A;&#x6709;&#x7406;&#x60F3;&#x548C;&#x62B1;&#x8D1F;&#xFF0C;&#x60F3;&#x6210;&#x4E3A;&#x675C;&#x6708;&#x7B19;&#x90A3;&#x6837;&#x7684;&#x8001;&#x5927;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x7684;&#x521D;&#x8877;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x59BB;&#x5B50;&#x505A;&#x6B4C;&#x821E;&#x5385;&#x7684;&#x8001;&#x677F;&#x5A18;&#x3002;&#x800C;&#x901A;&#x8FC7;&#x963F;&#x6D6A;&#x591C;&#x5BFB;&#x5C0F;&#x82B1;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x65F6;&#x77E5;&#x9053;&#xFF0C;&#x5F90;&#x6B63;&#x592A;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x56E0;&#x4E3A;&#x670B;&#x53CB;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x7B49;&#x5BF9;&#x65B9;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x5B88;&#x4FE1;&#x7528;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x5BFC;&#x81F4;&#x5F90;&#x6B63;&#x592A;&#x5750;&#x7262;&#x7684;&#x76F4;&#x63A5;&#x539F;&#x56E0;&#x662F;&#x4ED6;&#x4E3A;&#x670B;&#x53CB;&#x516D;&#x4E00;&#x62A5;&#x4EC7;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x4E49;&#x6C14;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x7684;&#x5C40;&#x9650;&#x6027;&#x5728;&#x54EA;&#x91CC;&#x5462;&#xFF1F;&#x4ED6;&#x8BA4;&#x4E3A;&#x5F55;&#x50CF;&#x5385;&#x6BD4;&#x7535;&#x5F71;&#x9662;&#x6709;&#x524D;&#x9014;&#xFF0C;&#x5C31;&#x5927;&#x91CF;&#x8D2D;&#x4E70;&#x5F55;&#x50CF;&#x5E26;&#xFF1B;&#x4ED6;&#x8BA4;&#x4E3A;BP&#x673A;&#x4EE3;&#x8868;&#x4E86;&#x901A;&#x4FE1;&#x884C;&#x4E1A;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x5C31;&#x5927;&#x91CF;&#x56E4;&#x79EF;BP&#x673A;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x660E;&#x767D;&#xFF0C;&#x4ED6;&#x540E;&#x6765;&#x4F1A;&#x5BF9;&#x963F;&#x6D6A;&#x91C7;&#x53D6;&#x201C;&#x68CD;&#x68D2;&#x6559;&#x80B2;&#x201D;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x773C;&#x754C;&#x5C31;&#x5C40;&#x9650;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4ED6;&#x5728;&#x5BF9;&#x5F85;&#x65B0;&#x4E8B;&#x7269;&#x4E0A;&#x5B58;&#x5728;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x770B;&#x4E0D;&#x5230;&#x4E16;&#x754C;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4ED6;&#x5728;&#x5929;&#x53F0;&#x4E0A;&#x8BF4;&#x7684;&#x90A3;&#x53E5;&#x201C;&#x4E16;&#x754C;&#x662F;&#x4E0D;&#x4F1A;&#x53D8;&#x7684;&#x201D;&#x5C31;&#x662F;&#x6700;&#x597D;&#x7684;&#x8BC1;&#x660E;&#x3002;&#x516D;&#x4E00;&#x4EE3;&#x8868;&#x4E86;&#x90A3;&#x79CD;&#x5E76;&#x4E0D;&#x806A;&#x660E;&#x4F46;&#x613F;&#x610F;&#x4E3A;&#x670B;&#x53CB;&#x4E24;&#x808B;&#x63D2;&#x5200;&#x7684;&#x201C;&#x50BB;&#x6C14;&#x201D;&#xFF0C;&#x5C0F;&#x9A6C;&#x5219;&#x4EE3;&#x8868;&#x4E86;&#x90A3;&#x79CD;&#x613F;&#x610F;&#x53BB;&#x8FFD;&#x9010;&#x68A6;&#x60F3;&#x7684;&#x201C;&#x6267;&#x7740;&#x201D;&#xFF0C;&#x5F53;OICQ&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x4ECE;&#x4ED6;&#x53E3;&#x4E2D;&#x8BF4;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4EBA;&#x7684;&#x4E00;&#x751F;&#x90FD;&#x5C06;&#x6CE8;&#x5B9A;&#x4E0D;&#x5E73;&#x51E1;&#x3002;&#x9EC4;&#x5FD7;&#x5F3A;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x5546;&#x4E1A;&#x5229;&#x76CA;&#x65E2;&#x5F97;&#x8005;&#xFF0C;&#x800C;&#x7F57;&#x529B;&#x5219;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x5931;&#x53BB;&#x4E00;&#x5207;&#x540E;&#x8FF7;&#x9014;&#x77E5;&#x8FD4;&#x7684;&#x56DE;&#x5934;&#x6D6A;&#x5B50;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5982;&#x679C;&#x8BF4;&#x7537;&#x4EBA;&#x4EEC;&#x7684;&#x6545;&#x4E8B;&#x90FD;&#x662F;&#x8FD9;&#x822C;&#x7C97;&#x72B7;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x91CC;&#x5973;&#x6027;&#x89D2;&#x8272;&#x5219;&#x663E;&#x5F97;&#x7EC6;&#x817B;&#x3002;&#x9996;&#x5148;&#x4ECE;&#x5C0F;&#x82B1;&#x8BF4;&#x8D77;&#xFF0C;&#x5C0F;&#x82B1;&#x548C;&#x963F;&#x6D6A;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7236;&#x4EB2;&#x6000;&#x6709;&#x654C;&#x610F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F5C;&#x4E3A;&#x98DE;&#x884C;&#x5458;&#x7684;&#x7236;&#x4EB2;&#x820D;&#x5F03;&#x4E86;&#x548C;&#x5BB6;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6295;&#x5165;&#x5168;&#x90E8;&#x8EAB;&#x5FC3;&#x5230;&#x98DE;&#x884C;&#x4E8B;&#x4E1A;&#x4E0A;&#x53BB;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x5979;&#x5A5A;&#x793C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7236;&#x4EB2;&#x90FD;&#x6CA1;&#x6709;&#x6765;&#x53C2;&#x52A0;&#x3002;&#x5F71;&#x7247;&#x4E2D;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x6700;&#x540E;&#x5F90;&#x6B63;&#x592A;&#x548C;&#x963F;&#x6D6A;&#x6740;&#x6B7B;&#x9EC4;&#x5FD7;&#x5F3A;&#x4EE5;&#x540E;&#xFF0C;&#x6000;&#x6709;&#x8EAB;&#x5B55;&#x7684;&#x5C0F;&#x82B1;&#x5306;&#x5306;&#x8D76;&#x6765;&#xFF0C;&#x5C06;&#x6EE1;&#x8EAB;&#x8840;&#x6C61;&#x7684;&#x5F90;&#x6B63;&#x592A;&#x7D27;&#x7D27;&#x62B1;&#x5728;&#x6000;&#x91CC;&#xFF0C;&#x5C0F;&#x82B1;&#x8BF4;&#x5F90;&#x6B63;&#x592A;&#x6709;&#x65F6;&#x5019;&#x50CF;&#x4E2A;&#x5B69;&#x5B50;&#xFF0C;&#x5176;&#x5B9E;&#x7537;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x50CF;&#x5B69;&#x5B50;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x5C0F;&#x82B1;&#x5176;&#x5B9E;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x6BCD;&#x6027;&#x7684;&#x5173;&#x6000;&#x5427;&#xFF01;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#x7535;&#x5F71;&#x91CC;&#x4F73;&#x6021;&#x548C;&#x677E;&#x5B50;&#x8FD9;&#x4E2A;&#x5973;&#x6027;&#x89D2;&#x8272;&#xFF0C;&#x867D;&#x7136;&#x516D;&#x4E00;&#x559C;&#x6B22;&#x4F73;&#x6021;&#xFF0C;&#x53EF;&#x4F9D;&#x7433;&#x8BF4;&#x5979;&#x6709;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x9ED8;&#x9ED8;&#x5730;&#x9009;&#x62E9;&#x653E;&#x624B;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x5FC3;&#x91CC;&#x4F9D;&#x7136;&#x6709;&#x5979;&#xFF0C;&#x800C;&#x6700;&#x7EC8;&#x516D;&#x4E00;&#x8EBA;&#x5728;&#x592A;&#x5E73;&#x95F4;&#x91CC;&#xFF0C;&#x6B64;&#x65F6;&#x966A;&#x4F34;&#x5728;&#x4ED6;&#x8EAB;&#x8FB9;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x54ED;&#x6210;&#x6CEA;&#x4EBA;&#x5730;&#x4F73;&#x6021;&#x548C;&#x90A3;&#x6761;&#x5DE1;&#x56DE;&#x72AC;&#xFF0C;&#x5927;&#x6982;&#x6211;&#x4EEC;&#x90FD;&#x4E60;&#x60EF;&#x4E86;&#x5FFD;&#x89C6;&#x8EAB;&#x8FB9;&#x4EBA;&#x7684;&#x7231;&#x5427;&#xFF0C;&#x4ECE;&#x7236;&#x6BCD;&#x5230;&#x4F34;&#x4FA3;&#xFF0C;&#x5F71;&#x7247;&#x4E2D;&#x6B63;&#x592A;&#x548C;&#x5C0F;&#x82B1;&#x4ECE;&#x56DB;&#x5C81;&#x7ED3;&#x8BC6;&#x4ECE;&#x59CB;&#x81EA;&#x7EC8;&#xFF0C;&#x8FD9;&#x5927;&#x6982;&#x5C31;&#x8DB3;&#x4EE5;&#x4EE4;&#x4EBA;&#x550F;&#x5618;&#x4E86;&#x5427;&#x3002;&#x9876;&#x98CE;&#x4F5C;&#x6848;&#x7684;&#x7F57;&#x529B;&#xFF0C;&#x627F;&#x8BFA;&#x8981;&#x7ED9;&#x677E;&#x5B50;&#x4E00;&#x65B9;&#x5929;&#x5730;&#xFF0C;&#x7136;&#x800C;&#x7B49;&#x4ED6;&#x4ECE;&#x72F1;&#x4E2D;&#x51FA;&#x6765;&#xFF0C;&#x89C1;&#x5230;&#x7684;&#x5374;&#x662F;&#x5750;&#x5728;&#x9EC4;&#x5FD7;&#x5F3A;&#x8F66;&#x4E0A;&#x795E;&#x8272;&#x590D;&#x6742;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x662F;&#x4F1A;&#x53D8;&#x7684;&#xFF0C;&#x53EF;&#x5B83;&#x4F1A;&#x53D8;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#x6211;&#x4EEC;&#x6C38;&#x8FDC;&#x65E0;&#x4ECE;&#x5F97;&#x77E5;&#xFF0C;&#x5C0F;&#x9A6C;&#x5E0C;&#x671B;&#x7684;&#x662F;&#x90A3;&#x4E2A;&#x62E8;&#x53F7;&#x4E0A;&#x7F51;&#x9891;&#x9891;&#x6389;&#x7EBF;&#x7684;&#x65F6;&#x4EE3;&#x8BDE;&#x751F;&#x4E00;&#x6B3E;OICQ&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5F90;&#x6B63;&#x592A;&#x5E0C;&#x671B;&#x7684;&#x662F;&#x50CF;&#x675C;&#x6708;&#x7B19;&#x90A3;&#x6837;&#x6536;&#x201C;&#x7269;&#x4E1A;&#x8D39;&#x201D;&#x2026;&#x2026;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x7B49;&#x5F85;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4E16;&#x754C;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5982;&#x6D6E;&#x840D;&#xFF0C;&#x6216;&#x968F;&#x98CE;&#x6F02;&#x6CCA;&#xFF0C;&#x6216;&#x4E58;&#x98CE;&#x7834;&#x6D6A;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7535;&#x5F71;&#x7ED3;&#x5C3E;&#xFF0C;&#x963F;&#x6D6A;&#x548C;&#x6B63;&#x592A;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5E73;&#x884C;&#x5B87;&#x5B99;&#xFF0C;&#x4E00;&#x5982;&#x5F71;&#x7247;&#x5F00;&#x59CB;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x5750;&#x5728;&#x540C;&#x4E00;&#x8F86;&#x8F66;&#x4E0A;&#x4E00;&#x6837;&#xFF0C;&#x963F;&#x6D6A;&#x95EE;&#x6B63;&#x592A;&#xFF1A;&#x201C;&#x4F60;&#x7684;&#x8F66;&#x6280;&#x8FD9;&#x4E48;&#x597D;&#x662F;&#x8DDF;&#x8C01;&#x5B66;&#x7684;&#xFF1F;&#x201D;&#xFF0C;&#x6B63;&#x592A;&#x56DE;&#x7B54;&#xFF1A;&#x201C;&#x5929;&#x8D4B;&#x6765;&#x7684;&#x201D;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x6B63;&#x592A;&#x95EE;&#x4E86;&#x963F;&#x6D6A;&#x76F8;&#x540C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x963F;&#x6D6A;&#x8BF4;&#xFF1A;&#x201C;&#x9057;&#x4F20;&#x6765;&#x7684;&#x201D;&#x3002;&#x5176;&#x5B9E;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x662F;&#x7236;&#x5B50;&#x95F4;&#x771F;&#x6B63;&#x7684;&#x63E1;&#x624B;&#x8A00;&#x548C;&#xFF0C;&#x6700;&#x7EC8;&#x4E24;&#x4E2A;&#x4EBA;&#x4E92;&#x76F8;&#x7406;&#x89E3;&#x4E86;&#x5BF9;&#x65B9;&#xFF0C;&#x7535;&#x5F71;&#x5F00;&#x5934;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x77DB;&#x76FE;&#x51B2;&#x7A81;&#xFF0C;&#x4EE5;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x5316;&#x89E3;&#xFF0C;&#x662F;&#x4EF6;&#x8BA9;&#x4EBA;&#x6B23;&#x6170;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x4E9B;&#x88AB;&#x65F6;&#x4EE3;&#x629B;&#x5F03;&#x7684;BP&#x673A;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x6211;&#x90FD;&#x4E0D;&#x518D;&#x8BA4;&#x540C;&#x5B83;&#x4EEC;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x4F46;&#x90A3;&#x66FE;&#x662F;&#x7236;&#x6BCD;&#x773C;&#x4E2D;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x6700;&#x597D;&#x7684;&#x7231;&#xFF0C;&#x4E16;&#x754C;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x8D77;&#x98CE;&#x4E86;&#xFF0C;&#x552F;&#x6709;&#x52AA;&#x529B;&#x751F;&#x5B58;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2941880815/">米花之味：永远相信美好的事情</a></li><li><a href="https://qinyuanpei.github.io/posts/1358971951/">致前任：愿余生各自安好</a></li><li><a href="https://qinyuanpei.github.io/posts/1684318907/">《大护法》—— 花生镇里的成人童话</a></li><li><a href="https://zymin.cn/arcticle/100-children-movies.html">百部经典儿童电影推荐</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2314414875/" rel="external">愿浮萍乘风破浪</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2314414875/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2314414875/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/电影/">电影</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/青春/">青春</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/韩寒/">韩寒</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2314414875/&title=《愿浮萍乘风破浪》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2314414875/&title=《愿浮萍乘风破浪》 — PayneQinのBlog&source=

   或许是今年的贺岁档电影全部遭遇“滑铁卢”的缘故，在这种情况下，电影《乘风破浪》或许会成为拯救整个贺一个岁档的奇迹。同往常一样，我依然选择一个人去..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2314414875/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《愿浮萍乘风破浪》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2314414875/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2314414875/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/2734896333/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">使用C#开发HTTP服务器之支持HTTPS</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/2171683728/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">函数式编程常用术语</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2314414875/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2314414875/&title=《愿浮萍乘风破浪》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2314414875/&title=《愿浮萍乘风破浪》 — PayneQinのBlog&source=

   或许是今年的贺岁档电影全部遭遇“滑铁卢”的缘故，在这种情况下，电影《乘风破浪》或许会成为拯救整个贺一个岁档的奇迹。同往常一样，我依然选择一个人去..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2314414875/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《愿浮萍乘风破浪》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2314414875/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2314414875/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2314414875/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
