<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        在Unity3D中使用uGUI实现3D旋转特效 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;各位朋友大家好，欢迎大家关注我的博客，我是Payne，我的博客地址是http://qinyuanpei.com。最近一位朋友问我，如何在Unity引擎中实现类似《英雄联盟》中选择皮肤时的3D滚动视图效果，虽然我非常不喜欢这个游戏，可是大学四年在宿舍里被周围同学们耳濡目染，对这个游戏中常见英雄的口头禅还是颇为熟悉的，曾经在周围同学的“硝烟”和“噪杂”中熬夜编程，此时此刻想起来">
<meta name="keywords" content="Unity3D,游戏开发,uGUI">
<meta property="og:type" content="article">
<meta property="og:title" content="在Unity3D中使用uGUI实现3D旋转特效">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1150143610/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;各位朋友大家好，欢迎大家关注我的博客，我是Payne，我的博客地址是http://qinyuanpei.com。最近一位朋友问我，如何在Unity引擎中实现类似《英雄联盟》中选择皮肤时的3D滚动视图效果，虽然我非常不喜欢这个游戏，可是大学四年在宿舍里被周围同学们耳濡目染，对这个游戏中常见英雄的口头禅还是颇为熟悉的，曾经在周围同学的“硝烟”和“噪杂”中熬夜编程，此时此刻想起来">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy4xe3bqj20zk0m8grl.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixyfcuz1j20i90e7dld.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixbd5ajtj20kz0gtk0w.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix8dwz8rg20l90gpb29.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="在Unity3D中使用uGUI实现3D旋转特效">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;各位朋友大家好，欢迎大家关注我的博客，我是Payne，我的博客地址是http://qinyuanpei.com。最近一位朋友问我，如何在Unity引擎中实现类似《英雄联盟》中选择皮肤时的3D滚动视图效果，虽然我非常不喜欢这个游戏，可是大学四年在宿舍里被周围同学们耳濡目染，对这个游戏中常见英雄的口头禅还是颇为熟悉的，曾经在周围同学的“硝烟”和“噪杂”中熬夜编程，此时此刻想起来">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy4xe3bqj20zk0m8grl.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">在Unity3D中使用uGUI实现3D旋转特效</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">在Unity3D中使用uGUI实现3D旋转特效</h1>
        <h5 class="subtitle">
            
                <time datetime="2016-07-10T14:29:33.000Z" itemprop="datePublished" class="page-time">
  2016-07-10
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/Unity3D/">Unity3D</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-在Unity3D中使用uGUI实现3D旋转特效" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">在Unity3D中使用uGUI实现3D旋转特效</h1>
        <div class="post-meta">
            <time class="post-time" title="2016-07-10 14:29:33" datetime="2016-07-10T14:29:33.000Z" itemprop="datePublished">2016-07-10</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/Unity3D/">Unity3D</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        27 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5404;&#x4F4D;&#x670B;&#x53CB;&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x6211;&#x662F;Payne&#xFF0C;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x5730;&#x5740;&#x662F;<a href="http://qinyuanpei.com" target="_blank" rel="noopener">http://qinyuanpei.com</a>&#x3002;&#x6700;&#x8FD1;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x95EE;&#x6211;&#xFF0C;&#x5982;&#x4F55;&#x5728;Unity&#x5F15;&#x64CE;&#x4E2D;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;&#x300A;&#x82F1;&#x96C4;&#x8054;&#x76DF;&#x300B;&#x4E2D;&#x9009;&#x62E9;&#x76AE;&#x80A4;&#x65F6;&#x7684;3D&#x6EDA;&#x52A8;&#x89C6;&#x56FE;&#x6548;&#x679C;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x975E;&#x5E38;&#x4E0D;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x53EF;&#x662F;&#x5927;&#x5B66;&#x56DB;&#x5E74;&#x5728;&#x5BBF;&#x820D;&#x91CC;&#x88AB;&#x5468;&#x56F4;&#x540C;&#x5B66;&#x4EEC;&#x8033;&#x6FE1;&#x76EE;&#x67D3;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x4E2D;&#x5E38;&#x89C1;&#x82F1;&#x96C4;&#x7684;&#x53E3;&#x5934;&#x7985;&#x8FD8;&#x662F;&#x9887;&#x4E3A;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x66FE;&#x7ECF;&#x5728;&#x5468;&#x56F4;&#x540C;&#x5B66;&#x7684;&#x201C;&#x785D;&#x70DF;&#x201D;&#x548C;&#x201C;&#x566A;&#x6742;&#x201D;&#x4E2D;&#x71AC;&#x591C;&#x7F16;&#x7A0B;&#xFF0C;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x60F3;&#x8D77;&#x6765;&#x5927;&#x6982;&#x662F;&#x6700;&#x80FD;&#x8BA9;&#x6211;&#x6000;&#x5FF5;&#x548C;&#x9A84;&#x50B2;&#x7684;&#x8BB0;&#x5FC6;&#x4E86;&#x3002;&#x5251;&#x5723;&#x8BF4;&#x201C;&#x4F60;&#x7684;&#x5251;&#x5C31;&#x662F;&#x6211;&#x7684;&#x5251;&#x201D;&#xFF0C;&#x4F0A;&#x6CFD;&#x745E;&#x5C14;&#x8BF4;&#x201C;&#x662F;&#x65F6;&#x5019;&#x8868;&#x6F14;&#x771F;&#x6B63;&#x7684;&#x6280;&#x672F;&#x4E86;&#x201D;&#xFF0C;&#x6770;&#x65AF;&#x8BF4;&#x201C;&#x4E3A;&#x4E86;&#x66F4;&#x7F8E;&#x597D;&#x7684;&#x660E;&#x5929;&#x800C;&#x6218;&#x201D;&#x2026;&#x2026;&#x6216;&#x8BB8;&#x66FE;&#x7ECF;&#x7684;&#x67D0;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x6709;&#x8FC7;&#x7C7B;&#x4F3C;&#x7684;&#x8BA9;&#x4F60;&#x6211;&#x75AF;&#x72C2;&#x7740;&#x8FF7;&#x7684;&#x4EBA;&#x751F;&#x4FE1;&#x6761;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x6C38;&#x8FDC;&#x5730;&#x94ED;&#x523B;&#x5728;&#x5FC3;&#x91CC;&#xFF0C;&#x5982;&#x540C;&#x5FC3;&#x4E2D;&#x683D;&#x79CD;&#x4E0B;&#x4E00;&#x68F5;&#x7EA2;&#x83B2;&#xFF0C;&#x5728;&#x9ED1;&#x591C;&#x4E2D;&#x9759;&#x9759;&#x5730;&#x7B49;&#x5F85;&#x5F00;&#x653E;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x6B64;&#x53BB;&#x7ECF;&#x5E74;&#x4EA6;&#x6216;&#x65F6;&#x8FC7;&#x5883;&#x8FC1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x8BF4;&#x662F;&#x65F6;&#x5149;&#x62B9;&#x53BB;&#x4E86;&#x4F60;&#x6211;&#x5E74;&#x8F7B;&#x7684;&#x68F1;&#x89D2;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x76F8;&#x4FE1;&#x771F;&#x6B63;&#x7684;&#x68F1;&#x89D2;&#x4F1A;&#x56E0;&#x4E3A;&#x78E8;&#x783A;&#x800C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x660E;&#x4EAE;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6B64;&#x523B;&#x7684;&#x82DF;&#x4E14;&#x5C31;&#x53D8;&#x7684;&#x9EBB;&#x6728;&#x751A;&#x81F3;&#x8FF7;&#x832B;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x559D;&#x5B8C;&#x6211;&#x8FD9;&#x7897;&#x5FC3;&#x7075;&#x9E21;&#x6C64;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x8D77;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5728;Unity3D&#x4E2D;&#x4F7F;&#x7528;uGUI&#x5B9E;&#x73B0;3D&#x6EDA;&#x52A8;&#x89C6;&#x56FE;&#x6548;&#x679C;&#x3002;</p>
<a id="more"></a>
<p>#&#x9700;&#x6C42;&#x5206;&#x6790;<br>&#x2003;&#x2003;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x5BF9;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x4ECE;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x9898;&#x76EE;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x4FE1;&#x606F;&#x662F;&#xFF0C;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;3D&#x6EDA;&#x52A8;&#x7279;&#x6548;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x91C7;&#x7528;2D&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x8FD8;&#x662F;&#x91C7;&#x7528;3D&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x754C;&#x9762;&#x6548;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x8FD9;&#x91CC;&#x5E0C;&#x671B;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x4ECE;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x8BBE;&#x8BA1;&#x521D;&#x8877;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x4ECB;&#x7ECD;&#x4EA7;&#x54C1;&#x7279;&#x6027;&#x7684;&#x6587;&#x6848;&#x8BBE;&#x8BA1;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4EC5;&#x4EC5;&#x662F;&#x60F3;&#x901A;&#x8FC7;&#x8FD9;&#x5F20;&#x56FE;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6548;&#x679C;&#x3002;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x6210;&#x672C;&#x5728;&#x6211;&#x770B;&#x6765;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x6C9F;&#x901A;&#x3002;&#x56E0;&#x4E3A;&#x4E8B;&#x5B9E;&#x4E0A;&#x5BF9;&#x666E;&#x901A;&#x7528;&#x6237;&#x800C;&#x8A00;&#x6280;&#x672F;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x80FD;&#x5426;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x60F3;&#x8981;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x662F;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x5F62;&#x662F;&#x7528;&#x6237;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x5C06;&#x5B9E;&#x9645;&#x7684;&#x4EA7;&#x54C1;&#x653E;&#x5230;&#x7528;&#x6237;&#x773C;&#x524D;&#x751A;&#x81F3;&#x624B;&#x4E2D;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x5728;&#x5BF9;&#x9700;&#x6C42;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5370;&#x8C61;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x79CD;&#x601D;&#x8DEF;&#xFF1A;</p>
<ul>
<li>&#x5176;&#x4E00;&#x662F;&#x91C7;&#x7528;&#x771F;&#x5B9E;&#x7684;3D&#x6765;&#x5236;&#x4F5C;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5706;&#x67F1;&#x4F53;&#x6216;&#x8005;&#x662F;&#x591A;&#x68F1;&#x67F1;&#x5C06;&#x56FE;&#x7247;&#x201D;&#x7C98;&#x8D34;&#x201D;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9762;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x5706;&#x67F1;&#x4F53;&#x6216;&#x8005;&#x591A;&#x68F1;&#x67F1;&#x8FDB;&#x884C;&#x65CB;&#x8F6C;&#xFF0C;&#x7136;&#x540E;&#x4EE5;&#x771F;&#x5B9E;&#x7684;3D&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002;</li>
<li>&#x5176;&#x4E8C;&#x662F;&#x91C7;&#x7528;&#x4F2A;3D&#x6765;&#x5236;&#x4F5C;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5728;2D&#x5E73;&#x9762;&#x5185;&#x5BF9;&#x56FE;&#x7247;&#x7684;&#x5C42;&#x6B21;&#x8FDB;&#x884C;&#x5408;&#x7406;&#x5316;&#x8C03;&#x6574;&#x5B9E;&#x73B0;&#x4F2A;3D&#x6548;&#x679C;&#xFF0C;&#x914D;&#x5408;&#x63D2;&#x503C;&#x3001;&#x7F29;&#x653E;&#x7B49;&#x6280;&#x5DE7;&#x6765;&#x5B9E;&#x73B0;2D&#x5E73;&#x9762;&#x4E0A;&#x7684;&#x65CB;&#x8F6C;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x7528;&#x6237;&#x4E00;&#x79CD;&#x89C6;&#x89C9;&#x4E0A;&#x7684;3D&#x6548;&#x679C;&#x3002;</li>
</ul>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy4xe3bqj20zk0m8grl.jpg" alt="&#x9700;&#x6C42;&#x8BBE;&#x5B9A;" title>
                </div>
                <div class="image-caption">&#x9700;&#x6C42;&#x8BBE;&#x5B9A;</div>
            </figure>
<p>#&#x6838;&#x5FC3;&#x539F;&#x7406;<br>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x91C7;&#x7528;&#x4F2A;3D&#x6765;&#x5236;&#x4F5C;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5B83;&#x7B80;&#x5355;&#x554A;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C06;&#x5B9E;&#x9645;&#x7684;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x66F2;&#x7EBF;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6BCF;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x4E2D;&#x5FC3;&#x7528;&#x5E73;&#x6ED1;&#x7684;&#x66F2;&#x7EBF;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x6761;&#x629B;&#x7269;&#x7EBF;&#x6216;&#x8005;&#x662F;&#x5706;&#x9525;&#x66F2;&#x7EBF;&#x6216;&#x8005;&#x662F;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x66F2;&#x7EBF;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6700;&#x7EC8;&#x5F71;&#x54CD;&#x5230;&#x7684;&#x662F;&#x66F2;&#x7EBF;&#x7684;&#x5E73;&#x6ED1;&#x5EA6;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x7EC6;&#x8282;&#x4E0A;&#x7684;&#x8C03;&#x6574;&#x3002;&#x6CBF;&#x7740;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6839;&#x636E;&#x66F2;&#x7EBF;&#x5E73;&#x5747;&#x5206;&#x5E03;&#x5750;&#x6807;&#x70B9;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;5&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x4E14;&#x66F2;&#x7EBF;&#x5728;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x6761;&#x5782;&#x76F4;&#x7684;&#x5BF9;&#x79F0;&#x8F74;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x8FD9;5&#x4E2A;&#x70B9;&#x5728;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#x5E73;&#x5747;&#x5206;&#x5E03;&#x5373;&#x53EF;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6839;&#x636E;&#x4EBA;&#x7C7B;&#x89C6;&#x89C9;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DDD;&#x79BB;&#x5E94;&#x8BE5;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x4E00;&#x6392;&#x5E76;&#x5217;&#x7684;&#x6811;&#x6728;&#xFF0C;&#x8D8A;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#x5B83;&#x4EEC;&#x7684;&#x95F4;&#x8DDD;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B83;&#x4EEC;&#x7684;&#x95F4;&#x8DDD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8868;&#x73B0;&#x51FA;&#x8FD9;&#x79CD;&#x89C6;&#x89C9;&#x4E0A;&#x7684;&#x7EB5;&#x6DF1;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#x5B83;&#x53D6;&#x51B3;&#x4E8E;&#x7F8E;&#x672F;&#x8BBE;&#x5B9A;&#x548C;&#x7B56;&#x5212;&#x8BBE;&#x5B9A;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5C31;&#x4ECE;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x5F00;&#x59CB;&#x5206;&#x6790;&#x3002;</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x5728;&#x89E3;&#x51B3;&#x4E86;&#x7CBE;&#x7075;&#x653E;&#x7F6E;&#x7684;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x7CBE;&#x7075;&#x7684;&#x5C42;&#x7EA7;&#xFF0C;&#x56E0;&#x4E3A;&#x5C42;&#x7EA7;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8425;&#x9020;&#x4E00;&#x79CD;&#x89C6;&#x89C9;&#x4E0A;&#x7684;&#x5C42;&#x6B21;&#x611F;&#x548C;&#x7ACB;&#x4F53;&#x611F;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x8DD1;&#x9177;&#x6E38;&#x620F;&#x4E2D;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F7F;&#x7528;&#x89C6;&#x5DEE;&#x6EDA;&#x52A8;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x6765;&#x8868;&#x73B0;3D&#x6548;&#x679C;&#xFF0C;&#x4EE5;&#x53CA;&#x4F20;&#x7EDF;&#x7684;&#x659C;45&#x5EA6;&#x74E6;&#x7247;&#x5730;&#x56FE;&#x6765;&#x5B9E;&#x73B0;2.5D&#x6548;&#x679C;&#x90FD;&#x662F;&#x4F7F;&#x7528;2D&#x6765;&#x6A21;&#x62DF;3D&#x6548;&#x679C;&#x7684;&#x7ECF;&#x5178;&#x6848;&#x4F8B;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x9664;&#x4E86;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;&#x7CBE;&#x7075;&#x7684;&#x653E;&#x7F6E;&#x4F4D;&#x7F6E;&#x4EE5;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x5BF9;&#x8FD9;&#x4E9B;&#x7CBE;&#x7075;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x6240;&#x5E78;&#x7684;&#x662F;&#x5728;uGUI&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;SetSiblingIndex&#x65B9;&#x6CD5;&#x6765;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x7CBE;&#x7075;&#x7684;&#x6DF1;&#x5EA6;&#xFF0C;&#x5F53;&#x6BCF;&#x6B21;&#x901A;&#x8FC7;&#x6309;&#x94AE;&#x5207;&#x6362;&#x7CBE;&#x7075;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x5BF9;&#x6240;&#x6709;&#x7CBE;&#x7075;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x5750;&#x6807;&#x548C;&#x6DF1;&#x5EA6;&#xFF0C;&#x800C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x89C6;&#x89C9;&#x8868;&#x73B0;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5207;&#x6362;&#x7684;&#x65F6;&#x5019;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F4D;&#x79FB;&#x52A8;&#x753B;&#xFF0C;&#x81F3;&#x6B64;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x52A8;&#x624B;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#x5566;&#x3002;</p>
<p>#&#x5177;&#x4F53;&#x5B9E;&#x73B0;<br>&#x2003;&#x2003;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5C06;&#x4E00;&#x5207;&#x6D6E;&#x534E;&#x892A;&#x5C3D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x573A;&#x666F;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x9009;&#x4E2D;&#x7684;&#x5361;&#x7247;&#xFF0C;&#x800C;&#x754C;&#x9762;&#x5E95;&#x90E8;&#x7684;&#x6807;&#x7B7E;&#x4F1A;&#x663E;&#x793A;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x9009;&#x62E9;&#x7684;&#x89D2;&#x8272;&#x540D;&#x79F0;&#x3002;&#x867D;&#x7136;&#x5728;&#x8FD9;&#x91CC;&#x91C7;&#x7528;&#x89E6;&#x5C4F;&#x6ED1;&#x52A8;&#x7684;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x5F53;&#x5F15;&#x5165;&#x8FD9;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x7684;&#x8BBE;&#x8BA1;&#x4EE5;&#x540E;&#xFF0C;&#x4F1A;&#x589E;&#x52A0;&#x5927;&#x5BB6;&#x5728;&#x6574;&#x4F53;&#x7406;&#x89E3;&#x4E0A;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4EE5;&#x5FEB;&#x901F;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#x4E3A;&#x4E3B;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x5361;&#x7247;&#x6B64;&#x65F6;&#x90FD;&#x662F;&#x76F8;&#x5F53;&#x201C;&#x4EFB;&#x6027;&#x201D;&#x5730;&#x653E;&#x7F6E;&#x5728;&#x754C;&#x9762;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x4F1A;&#x91C7;&#x7528;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x5361;&#x7247;&#x7684;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x5176;&#x201C;&#x7F8E;&#x89C2;&#x6027;&#x201D;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixyfcuz1j20i90e7dld.jpg" alt="&#x573A;&#x666F;&#x5C55;&#x793A;" title>
                </div>
                <div class="image-caption">&#x573A;&#x666F;&#x5C55;&#x793A;</div>
            </figure>
<p>&#x2003;&#x2003;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x5B9A;&#x573A;&#x666F;&#x7684;&#x5927;&#x5C0F;&#x4E3A;800x460&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x4E0B;&#x9762;&#x56FE;&#x4E2D;&#x6240;&#x793A;&#x7684;&#x66F2;&#x7EBF;&#x8F68;&#x8FF9;&#x6765;&#x6784;&#x9020;&#x4E00;&#x6761;&#x66F2;&#x7EBF;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x692D;&#x5706;&#x65B9;&#x7A0B;&#x6BD4;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x6613;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x9009;&#x62E9;&#x692D;&#x5706;&#x65B9;&#x7A0B;&#x6765;&#x4F5C;&#x4E3A;&#x573A;&#x666F;&#x4E2D;&#x8FD9;&#x4E9B;&#x5361;&#x7247;&#x6392;&#x5217;&#x7684;&#x66F2;&#x7EBF;&#x65B9;&#x7A0B;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixbd5ajtj20kz0gtk0w.jpg" alt="&#x66F2;&#x7EBF;&#x65B9;&#x7A0B;" title>
                </div>
                <div class="image-caption">&#x66F2;&#x7EBF;&#x65B9;&#x7A0B;</div>
            </figure>
<p>&#x2003;&#x2003;&#x6B64;&#x65F6;&#x4EE5;&#x5C4F;&#x5E55;&#x4E2D;&#x5FC3;&#x4E3A;&#x539F;&#x70B9;&#x6784;&#x5EFA;&#x5E73;&#x9762;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x692D;&#x5706;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x957F;&#x8F74;2A=400&#x3001;&#x77ED;&#x8F74;2B=640&#x3001;&#x4E2D;&#x5FC3;&#x5728;(0,320)&#x4E0A;&#x7684;&#x692D;&#x5706;&#x3002;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x539F;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5361;&#x7247;&#x5B58;&#x50A8;&#x5728;GameObject&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x89C4;&#x5B9A;&#x5361;&#x7247;&#x7684;&#x6570;&#x76EE;&#x5FC5;&#x987B;&#x4E3A;&#x5947;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x4F9D;&#x6B21;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x5361;&#x7247;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x6DF1;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x5361;&#x7247;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6392;&#x5217;&#x5566;&#x3002;&#x4E0B;&#x9762;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#xFF1A;</p>
<figure class="highlight abnf"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">//&#x521D;&#x59CB;&#x5316;&#x7CBE;&#x7075;&#x6570;&#x7EC4;</span><br><span class="line">int childCount = transform.childCount<span class="comment">;</span></span><br><span class="line">//&#x8BA1;&#x7B97;&#x4E24;&#x4FA7;&#x7CBE;&#x7075;&#x6570;&#x76EE;</span><br><span class="line"><span class="attribute">halfSize</span> = (childCount-<span class="number">1</span>)/<span class="number">2</span><span class="comment">;</span></span><br><span class="line">//&#x521D;&#x59CB;&#x5316;&#x7CBE;&#x7075;</span><br><span class="line"><span class="attribute">sprites</span> = new GameObject[childCount]<span class="comment">;</span></span><br><span class="line">for(int i=<span class="number">0</span><span class="comment">;i&lt;childCount;i++)</span></span><br><span class="line">{</span><br><span class="line">   sprites[i] = transform.GetChild(i).gameObject<span class="comment">;</span></span><br><span class="line">   SetPosition(i)<span class="comment">;</span></span><br><span class="line">   SetDeepin(i)<span class="comment">;</span></span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x8FD9;&#x91CC;sprites&#x663E;&#x7136;&#x662F;&#x4E00;&#x4E2A;GameObject[],&#x56E0;&#x4E3A;&#x5361;&#x7247;&#x7684;&#x6570;&#x76EE;&#x4E3A;&#x5947;&#x6570;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;halfSize&#x662F;&#x6307;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#x5361;&#x7247;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x8F85;&#x52A9;&#x65B9;&#x6CD5;&#xFF0C;SetPosition&#x548C;SetDeepin&#xFF0C;&#x4ECE;&#x540D;&#x5B57;&#x6211;&#x4EEC;&#x5C31;&#x77E5;&#x9053;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5206;&#x522B;&#x662F;&#x8BBE;&#x7F6E;&#x5361;&#x7247;&#x4F4D;&#x7F6E;&#x548C;&#x8BBE;&#x7F6E;&#x5361;&#x7247;&#x6DF1;&#x5EA6;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x597D;&#x591A;&#x4EBA;&#x4EE5;&#x4EE3;&#x7801;&#x81EA;&#x6CE8;&#x91CA;&#x4E3A;&#x7406;&#x89E3;&#x9003;&#x907F;&#x6CE8;&#x91CA;&#xFF0C;&#x5B70;&#x4E0D;&#x77E5;&#x8FD9;&#x5EFA;&#x7ACB;&#x5728;&#x547D;&#x540D;&#x89C4;&#x8303;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FDE;&#x8FD9;&#x70B9;&#x57FA;&#x672C;&#x7684;&#x8981;&#x6C42;&#x90FD;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x8FD8;&#x662F;&#x591A;&#x5199;&#x70B9;&#x6CE8;&#x91CA;&#x3001;&#x5C11;&#x5199;&#x70B9;&#x4EE3;&#x7801;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight axapta"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/// &lt;summary&gt;</span></span><br><span class="line"><span class="comment">/// &#x8BBE;&#x7F6E;&#x7CBE;&#x7075;&#x4F4D;&#x7F6E;</span></span><br><span class="line"><span class="comment">/// &lt;/summary&gt;</span></span><br><span class="line"><span class="keyword">private</span> <span class="keyword">void</span> SetPosition(<span class="keyword">int</span> <span class="keyword">index</span>)</span><br><span class="line">{</span><br><span class="line">   <span class="comment">//&#x8BA1;&#x7B97;&#x7B2C;index&#x4E2A;&#x7CBE;&#x7075;&#x7684;&#x89D2;&#x5EA6;</span></span><br><span class="line">   float angle = <span class="number">0.0</span>f;</span><br><span class="line">   <span class="keyword">if</span> (<span class="keyword">index</span> &lt; halfSize) {</span><br><span class="line">      angle = startAngle - (halfSize - <span class="keyword">index</span>) * DeltaAngle;</span><br><span class="line">   } <span class="keyword">else</span> <span class="keyword">if</span> (<span class="keyword">index</span> &gt; halfSize) {</span><br><span class="line">      angle = startAngle + (<span class="keyword">index</span> - halfSize) * DeltaAngle;</span><br><span class="line">   } <span class="keyword">else</span> {</span><br><span class="line">      angle = startAngle;</span><br><span class="line">   }</span><br><span class="line"></span><br><span class="line">   <span class="comment">//&#x8BA1;&#x7B97;&#x7B2C;index&#x4E2A;&#x7CBE;&#x7075;&#x7684;&#x5750;&#x6807;</span></span><br><span class="line">   float x = A* Mathf.Cos((angle/<span class="number">180</span>) * Mathf.PI) + Center.x;</span><br><span class="line">   float y = B* Mathf.Sin((angle/<span class="number">180</span>) * Mathf.PI) + Center.y;</span><br><span class="line">   Vector3 v3 = Camera.main.WorldToScreenPoint(<span class="keyword">new</span> Vector3(x,y,<span class="number">0</span>));</span><br><span class="line">   v3 = Camera.main.ScreenToWorldPoint(v3);</span><br><span class="line">   Vector2 v2 = <span class="keyword">new</span> Vector2(v3.x,v3.y);</span><br><span class="line">   sprites[<span class="keyword">index</span>].GetComponent&lt;RectTransform&gt;().anchoredPosition = v2;</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x7CBE;&#x7075;&#x7D22;&#x5F15;index&#x548C;&#x4E24;&#x4FA7;&#x7CBE;&#x7075;&#x6570;&#x76EE;halfSize&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6309;&#x7167;DeltaAngle&#x8FD9;&#x4E2A;&#x589E;&#x91CF;&#x6765;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x7CBE;&#x7075;&#x5B9E;&#x9645;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x7ED3;&#x5408;&#x692D;&#x5706;&#x7684;&#x53C2;&#x6570;&#x65B9;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5730;&#x8BA1;&#x7B97;&#x51FA;&#x6BCF;&#x4E2A;&#x7CBE;&#x7075;&#x5B9E;&#x9645;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x7CBE;&#x7075;&#x4E2D;&#x5FC3;&#x90FD;&#x5728;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x7CBE;&#x7075;&#x7684;&#x5C42;&#x7EA7;&#x5E94;&#x8BE5;&#x662F;&#x4ECE;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#x5411;&#x4E24;&#x8FB9;&#x4F9D;&#x6B21;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x7CBE;&#x7075;&#x7684;&#x5C42;&#x7EA7;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight axapta"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/// &lt;summary&gt;</span></span><br><span class="line"><span class="comment">/// &#x8BBE;&#x7F6E;&#x7CBE;&#x7075;&#x6DF1;&#x5EA6;</span></span><br><span class="line"><span class="comment">/// &lt;/summary&gt;</span></span><br><span class="line"><span class="keyword">private</span> <span class="keyword">void</span> SetDeepin(<span class="keyword">int</span> <span class="keyword">index</span>)</span><br><span class="line">{</span><br><span class="line">   <span class="comment">//&#x8BA1;&#x7B97;&#x7CBE;&#x7075;&#x6DF1;&#x5EA6;</span></span><br><span class="line">   <span class="keyword">int</span> deepin = <span class="number">0</span>;</span><br><span class="line">   <span class="keyword">if</span>(<span class="keyword">index</span>&lt;halfSize){</span><br><span class="line">      deepin = <span class="keyword">index</span>;</span><br><span class="line">   }<span class="keyword">else</span> <span class="keyword">if</span>(<span class="keyword">index</span>&gt;halfSize){</span><br><span class="line">      deepin = sprites.Length-(<span class="number">1</span>+<span class="keyword">index</span>);</span><br><span class="line">   }<span class="keyword">else</span>{</span><br><span class="line">      deepin = halfSize;</span><br><span class="line">   }</span><br><span class="line">   sprites[<span class="keyword">index</span>].GetComponent&lt;RectTransform&gt;().SetSiblingIndex(deepin);</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x6E05;&#x695A;SetSiblingIndex&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x771F;&#x6B63;&#x4F5C;&#x7528;:)&#xFF0C;&#x53EF;&#x662F;&#x5B83;&#x7684;&#x786E;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6709;&#x65F6;&#x5019;&#x5728;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x53E4;&#x8001;&#x7684;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x4F1A;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x770B;&#x5230;&#x5404;&#x79CD;&#x6709;&#x8DA3;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x4E2D;&#x6709;&#x76F8;&#x5F53;&#x4E00;&#x4E9B;&#x90FD;&#x5145;&#x6EE1;&#x4E86;&#x4E00;&#x79CD;&#x201C;&#x5F62;&#x800C;&#x4E0A;&#x5B66;&#x201D;&#x7684;&#x5473;&#x9053;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x53EF;&#x662F;&#x770B;&#x8D77;&#x6765;&#x5B83;&#x4EEC;&#x90FD;&#x8FD0;&#x884C;&#x5730;&#x975E;&#x5E38;&#x826F;&#x597D;&#x3002;&#x6216;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x5947;&#x5999;&#x4E4B;&#x5904;&#xFF0C;&#x65E0;&#x8BBA;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x60F3;&#x8981;&#x5C1D;&#x8BD5;&#x6253;&#x7834;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x603B;&#x662F;&#x6709;&#x4E9B;&#x6211;&#x4EEC;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#x5B58;&#x5728;&#xFF0C;&#x53EF;&#x662F;&#x5B58;&#x5728;&#x5373;&#x5408;&#x7406;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x7406;&#x6027;&#x601D;&#x7EF4;&#x7684;&#x7F3A;&#x9677;&#x5728;&#x4E8E;&#x60F3;&#x8981;&#x4E3A;&#x4E00;&#x5207;&#x95EE;&#x9898;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7B54;&#x6848;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6B21;&#x82CF;&#x683C;&#x62C9;&#x6CA1;&#x6709;&#x5E95;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x611F;&#x6027;&#x4E00;&#x6B21;&#x53C8;&#x4F55;&#x59A8;&#x5462;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x8BA9;&#x5B83;&#x6CA1;&#x6709;&#x7B54;&#x6848;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x73B0;&#x5728;&#xFF0C;&#x663E;&#x7136;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x50CF;&#x4E0A;&#x5E1D;&#x5728;&#x6211;&#x4EEC;&#x5173;&#x4E0A;&#x4E00;&#x6247;&#x95E8;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4F1A;&#x4E3A;&#x6211;&#x4EEC;&#x5F00;&#x542F;&#x4E00;&#x6247;&#x7A97;&#x53E3;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x5C42;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x800C;&#x5F15;&#x5165;&#x4E2D;&#x95F4;&#x5C42;&#x7684;&#x540C;&#x65F6;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x5730;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x8BA9;&#x6240;&#x6709;&#x7CBE;&#x7075;&#x6309;&#x7167;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x8FDB;&#x884C;&#x6392;&#x5E03;&#x4EE5;&#x53CA;&#x7CBE;&#x7075;&#x7684;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x8FC7;&#x7A0B;&#x554A;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x8BA9;&#x5B83;&#x80FD;&#x591F;&#x6EDA;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x7CBE;&#x7075;&#x7684;&#x8FD9;&#x79CD;&#x201C;&#x6EDA;&#x52A8;&#x201D;&#x6548;&#x679C;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5C06;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;sprites[0]&#x6216;&#x8005;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;sprites[sprites.Length-1]&#xFF0C;&#x4F9D;&#x6B21;&#x548C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x7B2C;i&#x4E2A;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#x3002;&#x6BD4;&#x5982;&#x7CBE;&#x7075;&#x6574;&#x4F53;&#x5411;&#x53F3;&#x4FA7;&#x201C;&#x6EDA;&#x52A8;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5F00;&#x59CB;&#x4F9D;&#x6B21;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#x5C31;&#x53EF;&#x4EE5;&#x5566;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x7684;&#x5B9E;&#x73B0;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#xFF1A;</p>
<figure class="highlight glsl"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/// &lt;summary&gt;</span></span><br><span class="line"><span class="comment">/// &#x5411;&#x540E;&#x7FFB;&#x9875;</span></span><br><span class="line"><span class="comment">/// &lt;/summary&gt;</span></span><br><span class="line">public <span class="type">void</span> OnNext()</span><br><span class="line">{</span><br><span class="line">   <span class="type">int</span> <span class="built_in">length</span> = sprites.Length;</span><br><span class="line">   <span class="keyword">for</span>(<span class="type">int</span> i=<span class="number">0</span>;i&lt;<span class="built_in">length</span>;i++)</span><br><span class="line">   {</span><br><span class="line">      GameObject temp = sprites[i];</span><br><span class="line">      sprites[i] = sprites[<span class="built_in">length</span><span class="number">-1</span>];</span><br><span class="line">      sprites[<span class="built_in">length</span><span class="number">-1</span>] = temp;</span><br><span class="line">   }</span><br><span class="line"></span><br><span class="line">   <span class="keyword">for</span>(<span class="type">int</span> i=<span class="number">0</span>;i&lt;<span class="built_in">length</span>;i++)</span><br><span class="line">   {</span><br><span class="line">      SetPosition(i);</span><br><span class="line">      SetDeepin(i);</span><br><span class="line">   }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x6211;&#x4EEC;&#x5728;&#x5BF9;&#x6570;&#x7EC4;&#x5185;&#x7684;&#x5143;&#x7D20;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x7CBE;&#x7075;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x6DF1;&#x5EA6;&#x3002;&#x6211;&#x8FD9;&#x91CC;&#x5728;&#x601D;&#x8003;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x7CBE;&#x7075;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x6DF1;&#x5EA6;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x5B83;&#x4EEC;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#x201C;&#x590D;&#x7528;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x6BCF;&#x6B21;&#x7684;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x4F18;&#x5316;&#x548C;&#x91CD;&#x6784;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x6765;&#x915D;&#x917F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x591F;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x610F;&#x8BC6;&#x5230;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x7455;&#x75B5;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x773C;&#x5149;&#x901A;&#x5E38;&#x9700;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x57F9;&#x517B;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x63D0;&#x5021;&#x4E0D;&#x8981;&#x8FC7;&#x65E9;&#x4F18;&#x5316;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x5730;&#x627E;&#x5230;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4F18;&#x5316;&#x70B9;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x91C7;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5411;&#x524D;&#x7FFB;&#x9875;&#x7684;&#x903B;&#x8F91;&#x5566;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x600E;&#x6837;&#x7684;&#x529F;&#x80FD;&#x5427;&#xFF01;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzix8dwz8rg20l90gpb29.jpg" alt="&#x6548;&#x679C;&#x5C55;&#x793A;" title>
                </div>
                <div class="image-caption">&#x6548;&#x679C;&#x5C55;&#x793A;</div>
            </figure>
<p>&#x5176;&#x5B9E;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6211;&#x8FD8;&#x60F3;&#x7EE7;&#x7EED;&#x518D;&#x5F80;&#x4E0B;&#x5199;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x6BD4;&#x8F83;&#x61D2;&#x4E00;&#x76F4;&#x62D6;&#x7740;&#x4E0D;&#x5199;&#xFF0C;&#x4EE5;&#x53CA;&#x63A5;&#x4E0B;&#x6765;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x548C;&#x754C;&#x9762;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x6682;&#x65F6;&#x5199;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x76EE;&#x524D;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x201C;3D&#x201D;&#x6EDA;&#x52A8;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x8BA9;&#x6EDA;&#x52A8;&#x66F4;&#x52A0;&#x5E73;&#x6ED1;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x9F20;&#x6807;&#x6216;&#x8005;&#x89E6;&#x5C4F;&#x64CD;&#x4F5C;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x662F;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5728;&#x201C;&#x6EDA;&#x52A8;&#x201D;&#x7684;&#x65F6;&#x5019;&#x589E;&#x52A0;&#x63D2;&#x503C;&#x7279;&#x6027;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x5B83;&#x66F4;&#x52A0;&#x5177;&#x6709;&#x201C;3D&#x201D;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8BBE;&#x7F6E;&#x7CBE;&#x7075;&#x5C42;&#x7EA7;&#x7684;&#x65F6;&#x5019;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x7CBE;&#x7075;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x66F4;&#x52A0;&#x7B26;&#x5408;&#x7F8E;&#x672F;&#x4E2D;&#x7684;&#x900F;&#x89C6;&#x5173;&#x7CFB;&#xFF0C;&#x6548;&#x679C;&#x5E94;&#x8BE5;&#x4F1A;&#x66F4;&#x597D;&#x5427;&#xFF01;&#x6211;&#x8BA4;&#x8BC6;&#x7684;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x4F7F;&#x7528;uGUI&#x4E2D;&#x539F;&#x751F;&#x63A7;&#x4EF6;ScrollRect&#x5B9E;&#x73B0;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x611F;&#x89C9;&#x5979;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x5389;&#x5BB3;&#x7684;&#x554A;&#xFF0C;&#x679C;&#x7136;&#x6211;&#x4E0D;&#x518D;&#x4ECE;&#x4E8B;Unity&#x5F00;&#x53D1;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x5757;&#x7684;&#x6280;&#x672F;&#x5B8C;&#x5168;&#x8DDF;&#x4E0D;&#x4E0A;&#x6574;&#x4E2A;&#x6280;&#x672F;&#x5708;&#x7684;&#x8282;&#x594F;&#x554A;&#x3002;</p>
<p>#&#x5C0F;&#x7ED3;<br>&#x2003;&#x2003;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x66F2;&#x7EBF;&#x65B9;&#x7A0B;&#x6765;&#x6784;&#x5EFA;&#x4F2A;3D&#x6548;&#x679C;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x4E3B;&#x8981;&#x501F;&#x52A9;&#x692D;&#x5706;&#x7684;&#x53C2;&#x6570;&#x65B9;&#x7A0B;&#x6765;&#x8BA1;&#x7B97;&#x7CBE;&#x7075;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F7F;&#x5176;&#x5B9E;&#x73B0;&#x6309;&#x7167;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x8FDB;&#x884C;&#x6392;&#x5E03;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x914D;&#x5408;&#x5C42;&#x7EA7;&#x8C03;&#x6574;&#x3001;&#x63D2;&#x503C;&#x3001;&#x7F29;&#x653E;&#x7B49;&#x6280;&#x5DE7;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;2D&#x5E73;&#x9762;&#x5185;&#x7684;&#x4F2A;3D&#x65CB;&#x8F6C;&#x6548;&#x679C;&#x3002;&#x56E0;&#x4E3A;&#x535A;&#x4E3B;&#x8EAB;&#x60A3;&#x62D6;&#x5EF6;&#x75C7;&#x665A;&#x671F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5728;&#x62D6;&#x5EF6;&#x4E86;&#x5F88;&#x4E45;&#x4EE5;&#x540E;&#xFF0C;&#x7EC8;&#x4E8E;&#x6210;&#x529F;&#x7684;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x586B;&#x5B8C;&#x7684;&#x5751;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x76F8;&#x4FE1;&#x638C;&#x63E1;&#x539F;&#x7406;&#x6BD4;&#x83B7;&#x53D6;&#x4EE3;&#x7801;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x7ED9;&#x5927;&#x5BB6;&#x63D0;&#x4F9B;&#x76F8;&#x5173;&#x601D;&#x8DEF;&#xFF0C;&#x535A;&#x4E3B;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5404;&#x4F4D;&#x8BFB;&#x8005;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x81EA;&#x884C;&#x5B9E;&#x73B0;&#xFF0C;&#x5199;&#x5B8C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8868;&#x793A;&#x5FC3;&#x597D;&#x7D2F;&#xFF0C;&#x597D;&#x4E86;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x5427;,&#x5404;&#x4F4D;&#x665A;&#x5B89;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3120185261/">EasyAR尝鲜系列教程之Hello EasyAR</a></li><li><a href="https://qinyuanpei.github.io/posts/1156673678/">EasyAR尝鲜系列教程之自定义Marker的实现</a></li><li><a href="https://qinyuanpei.github.io/posts/4088452183/">Unity3D游戏开发之MMD For Unity插件研究</a></li><li><a href="https://blog.yuanpei.me/posts/3120185261/">EasyAR尝鲜系列教程之Hello EasyAR</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1150143610/" rel="external">在Unity3D中使用uGUI实现3D旋转特效</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1150143610/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1150143610/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/uGUI/">uGUI</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/游戏开发/">游戏开发</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1150143610/&title=《在Unity3D中使用uGUI实现3D旋转特效》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1150143610/&title=《在Unity3D中使用uGUI实现3D旋转特效》 — PayneQinのBlog&source=&emsp;&emsp;各位朋友大家好，欢迎大家关注我的博客，我是Payne，我的博客地址是http://qinyuanpei.com。最近一位朋友问我，..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1150143610/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《在Unity3D中使用uGUI实现3D旋转特效》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1150143610/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1150143610/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/569337285/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">浅析WPF中MVVM模式下命令与委托的关系</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1190622881/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Unity3D游戏开发之在uGUI中使用不规则精灵制作按钮</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1150143610/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1150143610/&title=《在Unity3D中使用uGUI实现3D旋转特效》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1150143610/&title=《在Unity3D中使用uGUI实现3D旋转特效》 — PayneQinのBlog&source=&emsp;&emsp;各位朋友大家好，欢迎大家关注我的博客，我是Payne，我的博客地址是http://qinyuanpei.com。最近一位朋友问我，..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1150143610/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《在Unity3D中使用uGUI实现3D旋转特效》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1150143610/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1150143610/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1150143610/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
