<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        基于Python实现的微信好友数据分析 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x5FAE;&amp;#x4FE1;&amp;#x8FCE;&amp;#x6765;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x66F4;&amp;#x65B0;&amp;#xFF0C;&amp;#x5141;&amp;#x8BB8;&amp;#x7528;&amp;#x6237;&amp;#x5BF9;&amp;#x201D;&amp;#x53D1;&amp;#x73B0;">
<meta name="keywords" content="Python,Wechat,matplotlib">
<meta property="og:type" content="article">
<meta property="og:title" content="基于Python实现的微信好友数据分析">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2805694118/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x5FAE;&amp;#x4FE1;&amp;#x8FCE;&amp;#x6765;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x66F4;&amp;#x65B0;&amp;#xFF0C;&amp;#x5141;&amp;#x8BB8;&amp;#x7528;&amp;#x6237;&amp;#x5BF9;&amp;#x201D;&amp;#x53D1;&amp;#x73B0;">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziyue7akej217904zabg.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziyb6mxjqj20hs0b40ss.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy7pojhzj20zk0hb0ta.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy4ztxq6j20zk0hbgnv.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixyiqv1lj20zk0hbgpc.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixbgepihj20hs0dcjrn.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix8lyfsuj20m80jw74u.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="基于Python实现的微信好友数据分析">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x5FAE;&amp;#x4FE1;&amp;#x8FCE;&amp;#x6765;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x66F4;&amp;#x65B0;&amp;#xFF0C;&amp;#x5141;&amp;#x8BB8;&amp;#x7528;&amp;#x6237;&amp;#x5BF9;&amp;#x201D;&amp;#x53D1;&amp;#x73B0;">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziyue7akej217904zabg.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">基于Python实现的微信好友数据分析</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">基于Python实现的微信好友数据分析</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-02-24T12:50:52.000Z" itemprop="datePublished" class="page-time">
  2018-02-24
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据分析/">数据分析</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#引言"><span class="post-toc-number">1.</span> <span class="post-toc-text">引言</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#数据分析"><span class="post-toc-number">2.</span> <span class="post-toc-text">数据分析</span></a><ol class="post-toc-child"><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#好友性别"><span class="post-toc-number">2.1.</span> <span class="post-toc-text">好友性别</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#好友头像"><span class="post-toc-number">2.2.</span> <span class="post-toc-text">好友头像</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#好友签名"><span class="post-toc-number">2.3.</span> <span class="post-toc-text">好友签名</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#好友位置"><span class="post-toc-number">2.4.</span> <span class="post-toc-text">好友位置</span></a></li></ol></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#本文小结"><span class="post-toc-number">3.</span> <span class="post-toc-text">本文小结</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">4.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-基于Python实现的微信好友数据分析" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">基于Python实现的微信好友数据分析</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-02-24 12:50:52" datetime="2018-02-24T12:50:52.000Z" itemprop="datePublished">2018-02-24</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据分析/">数据分析</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        40 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x5FAE;&#x4FE1;&#x8FCE;&#x6765;&#x4E86;&#x4E00;&#x6B21;&#x91CD;&#x8981;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5BF9;&#x201D;&#x53D1;&#x73B0;&#x201D;&#x9875;&#x9762;&#x8FDB;&#x884C;&#x5B9A;&#x5236;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#xFF0C;&#x5FAE;&#x4FE1;&#x670B;&#x53CB;&#x5708;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x5F53;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EBA;&#x9009;&#x62E9;&#x201D;&#x4EC5;&#x5C55;&#x793A;&#x6700;&#x8FD1;&#x4E09;&#x5929;&#x7684;&#x670B;&#x53CB;&#x5708;&#x201D;&#xFF0C;&#x5927;&#x6982;&#x8FDE;&#x5FAE;&#x4FE1;&#x5B98;&#x65B9;&#x90FD;&#x662F;&#x4E00;&#x8138;&#x7684;&#x65E0;&#x53EF;&#x5948;&#x4F55;&#x3002;&#x9010;&#x6B65;&#x6CDB;&#x5316;&#x7684;&#x597D;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x8BA9;&#x5FAE;&#x4FE1;&#x4ECE;&#x719F;&#x4EBA;&#x793E;&#x4EA4;&#x9010;&#x6E10;&#x8FC7;&#x6E21;&#x5230;&#x964C;&#x751F;&#x4EBA;&#x793E;&#x4EA4;&#xFF0C;&#x800C;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x4EA6;&#x771F;&#x4EA6;&#x5E7B;&#x7684;&#x72B6;&#x6001;&#x66F4;&#x65B0;&#xFF0C;&#x4EFF;&#x4F5B;&#x5728;&#x52AA;&#x529B;&#x8BC1;&#x660E;&#x6BCF;&#x4E00;&#x4E2A;&#x4E2A;&#x4F53;&#x7684;&#x201D;&#x6709;&#x8DA3;&#x201D;&#x3002;&#x6709;&#x4EBA;&#x9009;&#x62E9;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x8BB0;&#x5F55;&#x751F;&#x6D3B;&#x7684;&#x70B9;&#x6EF4;&#xFF0C;&#x6709;&#x4EBA;&#x9009;&#x62E9;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x5C55;&#x793A;&#x89C2;&#x70B9;&#x7684;&#x5F02;&#x540C;&#xFF0C;&#x53EF;&#x5F52;&#x6839;&#x5230;&#x5E95;&#xFF0C;&#x4EBA;&#x4EEC;&#x65E0;&#x65F6;&#x65E0;&#x523B;&#x4E0D;&#x5728;&#x7AA5;&#x63A2;&#x7740;&#x522B;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x552F;&#x72EC;&#x6015;&#x522B;&#x4EBA;&#x8FC7;&#x591A;&#x5730;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x4EBA;&#x6027;&#x4E2D;&#x4EA4;&#x7EC7;&#x7740;&#x7684;&#x5149;&#x660E;&#x4E0E;&#x9ED1;&#x6697;&#xFF0C;&#x50CF;&#x4E00;&#x53EA;&#x6D51;&#x8EAB;&#x957F;&#x6EE1;&#x523A;&#x7684;&#x523A;&#x732C;&#xFF0C;&#x79BB;&#x5F97;&#x592A;&#x8FDC;&#x4F1A;&#x611F;&#x89C9;&#x5230;&#x5BD2;&#x51B7;&#xFF0C;&#x800C;&#x9760;&#x5F97;&#x592A;&#x8FD1;&#x5219;&#x5BB3;&#x6015;&#x88AB;&#x523A;&#x624E;&#x5230;&#x3002;&#x670B;&#x53CB;&#x5708;&#x5C31;&#x50CF;&#x8FC7;&#x5E74;&#x8D70;&#x4EB2;&#x621A;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x5FC3;&#x4E2D;&#x6709;&#x4E00;&#x4E07;&#x4E2A;&#x4E0D;&#x75DB;&#x5FEB;&#xFF0C;&#x603B;&#x662F;&#x4E0D;&#x613F;&#x610F;&#x6495;&#x7834;&#x8138;&#xFF0C;&#x6216;&#x5C4F;&#x853D;&#x5BF9;&#x65B9;&#xFF0C;&#x6216;&#x4E0D;&#x7ED9;&#x5BF9;&#x65B9;&#x770B;&#xFF0C;&#x6216;&#x4EC5;&#x5C55;&#x793A;&#x6700;&#x540E;&#x4E09;&#x5929;&#xFF0C;&#x4E8E;&#x662F;&#x901A;&#x8BAF;&#x5F55;&#x91CC;&#x7684;&#x8054;&#x7CFB;&#x4EBA;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x670B;&#x53CB;&#x5708;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x53EF;&#x518D;&#x4E0D;&#x4F1A;&#x6709;&#x80FD;&#x771F;&#x6B63;&#x89E6;&#x52A8;&#x4F60;&#x5185;&#x5FC3;&#x7684;&#x201D;&#x5C0F;&#x7EA2;&#x70B9;&#x201D;&#x51FA;&#x73B0;&#xFF0C;&#x4EBA;&#x7C7B;&#x8BA9;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x5B83;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x4EBA;&#x7C7B;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x5927;&#x6982;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x59CB;&#x6599;&#x4E0D;&#x53CA;&#x7684;&#x5427;&#xFF01;</p>
<h1 id="&#x5F15;&#x8A00;"><a href="#&#x5F15;&#x8A00;" class="headerlink" title="&#x5F15;&#x8A00;"></a>&#x5F15;&#x8A00;</h1><p>&#x2003;&#x2003;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x4EBA;&#x6027;&#x8FDC;&#x6BD4;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x662F;&#x4EBA;&#x7C7B;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6700;&#x4F1F;&#x5927;&#x7684;&#x53D1;&#x660E;&#x2014;&#x2014;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5728;&#x9762;&#x5BF9;&#x4EBA;&#x7C7B;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x65F6;&#x540C;&#x6837;&#x4F1A;&#x5F20;&#x60F6;&#x5931;&#x63AA; &#x3002;&#x4EBA;&#x7C7B;&#x6709;&#x591A;&#x5C11;&#x8BED;&#x8A00;&#x5B58;&#x5728;&#x7740;&#x6A21;&#x68F1;&#x4E24;&#x53EF;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8BED;&#x8A00;&#x662F;&#x4EBA;&#x7C7B;&#x6700;&#x5927;&#x7684;&#x8BEF;&#x89E3;&#xFF0C;&#x4EBA;&#x7C7B;&#x65F6;&#x5E38;&#x559C;&#x6B22;&#x63E3;&#x6D4B;&#x8BED;&#x8A00;&#x80CC;&#x540E;&#x9690;&#x85CF;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x597D;&#x50CF;&#x5728;&#x6C9F;&#x901A;&#x65F6;&#x8868;&#x8FBE;&#x6E05;&#x6670;&#x7684;&#x542B;&#x4E49;&#x4F1A;&#x8BA9;&#x4EBA;&#x7C7B;&#x6CA1;&#x6709;&#x9762;&#x5B50;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x7F51;&#x7EDC;&#x4E0A;&#x6D41;&#x884C;&#x7684;&#x731C;&#x6D4B;&#x5973;&#x670B;&#x53CB;&#x771F;&#x5B9E;&#x610F;&#x56FE;&#x7684;&#x6848;&#x4F8B;&#x3002;&#x91D1;&#x5EB8;&#x5148;&#x751F;&#x7684;&#x6B66;&#x4FA0;&#x5C0F;&#x8BF4;&#x300A;&#x5C04;&#x96D5;&#x82F1;&#x96C4;&#x4F20;&#x300B;&#x91CC;&#xFF0C;&#x5728;&#x4FE1;&#x606F;&#x95ED;&#x585E;&#x7684;&#x5357;&#x5B8B;&#x65F6;&#x671F;&#xFF0C;&#x6C5F;&#x6E56;&#x4E0A;&#x88D8;&#x5343;&#x4E08;&#x7684;&#x4E00;&#x53E5;&#x9B3C;&#x8BDD;&#xFF0C;&#x5C31;&#x6405;&#x5F97;&#x6574;&#x4E2A;&#x6B66;&#x6797;&#x5929;&#x7FFB;&#x5730;&#x8986;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4E00;&#x4E24;&#x53E5;&#x8BDD;&#x8BF4;&#x6E05;&#x695A;&#x4E0D;&#x597D;&#x5417;&#xFF1F;&#x9EC4;&#x836F;&#x5E08;&#x3001;&#x5168;&#x771F;&#x4E03;&#x5B50;&#x3001;&#x6C5F;&#x5357;&#x516D;&#x602A;&#x95F4;&#x7684;&#x79CD;&#x79CD;&#x7EA0;&#x845B;&#xFF0C;&#x54EA;&#x4E00;&#x573A;&#x4E0D;&#x662F;&#x8BEF;&#x4F1A;&#xFF1F;&#x4E00;&#x4F17;&#x513F;&#x6B66;&#x529F;&#x9707;&#x53E4;&#x70C1;&#x4ECA;&#x7684;&#x6B66;&#x6797;&#x9AD8;&#x624B;&#xFF0C;&#x600E;&#x4E48;&#x6CA1;&#x6709;&#x4E1D;&#x6BEB;&#x7684;&#x53BB;&#x4F2A;&#x5B58;&#x771F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8BED;&#x8A00;&#x9020;&#x6210;&#x4E86;&#x591A;&#x5C11;&#x8BEF;&#x4F1A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53EF;&#x5373;&#x4FBF;&#x4EBA;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x590D;&#x6742;&#x5F97;&#x50CF;&#x4E00;&#x672C;&#x65E0;&#x5B57;&#x5929;&#x4E66;&#xFF0C;&#x53EF;&#x4EBA;&#x7C7B;&#x8FD8;&#x662F;&#x4ECE;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#x5BFB;&#x89C5;&#x5230;&#x86DB;&#x4E1D;&#x9A6C;&#x8FF9;&#x3002;&#x53E4;&#x4EBA;&#x6709;&#x6587;&#x738B;&#x201D;&#x62D8;&#x800C;&#x6F14;&#x5468;&#x6613;&#x201D;&#x3001;&#x4E1C;&#x65B9;&#x6714;&#x6D4B;&#x5B57;&#x535C;&#x5366;&#xFF0C;&#x8FD9;&#x79CD;&#x5E26;&#x6709;&#x201D;&#x8FF7;&#x4FE1;&#x201D;&#x8272;&#x5F69;&#x7684;&#x539F;&#x59CB;&#x5D07;&#x62DC;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4ECA;&#x5929;&#x4EBA;&#x4EEC;&#x8FF7;&#x4FE1;&#x661F;&#x5EA7;&#x8FD0;&#x52BF;&#x4E00;&#x822C;&#xFF0C;&#x90FD;&#x662F;&#x4EBA;&#x7C7B;&#x5728;&#x4E0A;&#x5343;&#x5E74;&#x7684;&#x6F14;&#x53D8;&#x4E2D;&#x4E0D;&#x65AD;&#x5BF9;&#x7ECF;&#x9A8C;&#x8FDB;&#x884C;&#x603B;&#x7ED3;&#x548C;&#x8BAD;&#x7EC3;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x6B64;&#x8BF4;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x672A;&#x5C1D;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x79D1;&#x5B66;&#x5316;&#x7684;&#x201D;&#x8FF7;&#x4FE1;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x548C;&#x7B97;&#x6CD5;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x771F;&#x5B9E;&#x5730;&#x3002;&#x751F;&#x6D3B;&#x5728;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x7684;&#x6211;&#x4EEC;&#xFF0C;&#x65E0;&#x7591;&#x662F;&#x60B2;&#x54C0;&#x7684;&#xFF0C;&#x4E00;&#x9762;&#x52AA;&#x529B;&#x5730;&#x5728;&#x522B;&#x4EBA;&#x9762;&#x524D;&#x9690;&#x85CF;&#x771F;&#x5B9E;&#x5730;&#x81EA;&#x5DF1;&#xFF0C;&#x4E00;&#x9762;&#x4E0D;&#x65E0;&#x9057;&#x61BE;&#x5730;&#x611F;&#x6168;&#x81EA;&#x5DF1;&#x65E0;&#x5904;&#x9041;&#x9003;&#xFF0C;&#x6BCF;&#x4E00;&#x6839;&#x6570;&#x5B57;&#x795E;&#x7ECF;&#x90FD;&#x7D27;&#x7D27;&#x5730;&#x8054;&#x7CFB;&#x7740;&#x4F60;&#x548C;&#x6211;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x6E34;&#x671B;&#x4EFB;&#x4F55;&#x4E00;&#x90E8;&#x6570;&#x5B57;&#x8BBE;&#x5907;&#x5177;&#x5907;&#x771F;&#x6B63;&#x7684;&#x667A;&#x80FD;&#xFF0C;&#x53EF;&#x4F60;&#x751F;&#x547D;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x77AC;&#x95F4;&#xFF0C;&#x90FD;&#x5728;&#x6084;&#x7136;&#x95F4;&#x88AB;&#x6570;&#x636E;&#x5730;&#x6298;&#x5C04;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECA;&#x5929;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4F1A;&#x57FA;&#x4E8E; Python &#x5BF9;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x91CC;&#x9009;&#x62E9;&#x7684;&#x7EF4;&#x5EA6;&#x4E3B;&#x8981;&#x6709;&#xFF1A;&#x6027;&#x522B;&#x3001;&#x5934;&#x50CF;&#x3001;&#x7B7E;&#x540D;&#x3001;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E3B;&#x8981;&#x91C7;&#x7528;&#x56FE;&#x8868;&#x548C;&#x8BCD;&#x4E91;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x6765;&#x5448;&#x73B0;&#x7ED3;&#x679C;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;&#x5BF9;&#x6587;&#x672C;&#x7C7B;&#x4FE1;&#x606F;&#x4F1A;&#x91C7;&#x7528;&#x8BCD;&#x9891;&#x5206;&#x6790;&#x548C;&#x60C5;&#x611F;&#x5206;&#x6790;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5E38;&#x8A00;&#x9053;&#xFF1A;&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#xFF0C;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#x4E5F;&#x3002;&#x5728;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x524D;&#xFF0C;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E0B;&#x672C;&#x6587;&#x4E2D;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6A21;&#x5757;&#xFF1A;</p>
<ul>
<li><a href="https://github.com/littlecodersh/itchat" target="_blank" rel="noopener">itchat</a>&#xFF1A;&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x7248;&#x63A5;&#x53E3;&#x5C01;&#x88C5;Python&#x7248;&#x672C;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x83B7;&#x53D6;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4FE1;&#x606F;&#x3002;</li>
<li><a href="https://github.com/fxsjy/jieba" target="_blank" rel="noopener">jieba</a>&#xFF1A;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x7684; Python &#x7248;&#x672C;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x5BF9;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x5206;&#x8BCD;&#x5904;&#x7406;&#x3002;</li>
<li><a href="https://matplotlib.org/" target="_blank" rel="noopener">matplotlib</a>&#xFF1A; Python &#x4E2D;&#x56FE;&#x8868;&#x7ED8;&#x5236;&#x6A21;&#x5757;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x7ED8;&#x5236;&#x67F1;&#x5F62;&#x56FE;&#x548C;&#x997C;&#x56FE;</li>
<li><a href="https://github.com/isnowfy/snownlp" target="_blank" rel="noopener">snownlp</a>&#xFF1A;&#x4E00;&#x4E2A; Python &#x4E2D;&#x7684;&#x4E2D;&#x6587;&#x5206;&#x8BCD;&#x6A21;&#x5757;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x5BF9;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x60C5;&#x611F;&#x5224;&#x65AD;&#x3002;</li>
<li><a href="http://www.pythonware.com/products/pil/" target="_blank" rel="noopener">PIL</a>&#xFF1A; Python &#x4E2D;&#x7684;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x6A21;&#x5757;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x5BF9;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</li>
<li><a href="http://www.numpy.org/" target="_blank" rel="noopener">numpy</a>&#xFF1A; Python&#x4E2D; &#x7684;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#x6A21;&#x5757;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x914D;&#x5408; <a href="https://amueller.github.io/word_cloud/" target="_blank" rel="noopener">wordcloud</a> &#x6A21;&#x5757;&#x4F7F;&#x7528;&#x3002;</li>
<li><a href="https://amueller.github.io/word_cloud/" target="_blank" rel="noopener">wordcloud</a>&#xFF1A; Python &#x4E2D;&#x7684;&#x8BCD;&#x4E91;&#x6A21;&#x5757;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x7ED8;&#x5236;&#x8BCD;&#x4E91;&#x56FE;&#x7247;&#x3002;</li>
<li><a href="https://github.com/Tencent-YouTu/Python_sdk" target="_blank" rel="noopener">TencentYoutuyun</a>&#xFF1A;&#x817E;&#x8BAF;&#x4F18;&#x56FE;&#x63D0;&#x4F9B;&#x7684; Python &#x7248;&#x672C; SDK &#xFF0C;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x7528;&#x4EE5;&#x8BC6;&#x522B;&#x4EBA;&#x8138;&#x53CA;&#x63D0;&#x53D6;&#x56FE;&#x7247;&#x6807;&#x7B7E;&#x4FE1;&#x606F;&#x3002;<br>&#x4EE5;&#x4E0A;&#x6A21;&#x5757;&#x5747;&#x53EF;&#x901A;&#x8FC7; pip &#x5B89;&#x88C5;&#xFF0C;&#x5173;&#x4E8E;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x4F7F;&#x7528;&#x7684;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x81EA;&#x884C;&#x67E5;&#x9605;&#x5404;&#x81EA;&#x6587;&#x6863;&#x3002;</li>
</ul>
<h1 id="&#x6570;&#x636E;&#x5206;&#x6790;"><a href="#&#x6570;&#x636E;&#x5206;&#x6790;" class="headerlink" title="&#x6570;&#x636E;&#x5206;&#x6790;"></a>&#x6570;&#x636E;&#x5206;&#x6790;</h1><p>&#x2003;&#x2003;&#x5206;&#x6790;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x6570;&#x636E;&#x7684;&#x524D;&#x63D0;&#x662F;&#x83B7;&#x5F97;&#x597D;&#x53CB;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528; itchat &#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">itchat.auto_login(hotReload = <span class="keyword">True</span>)</span><br><span class="line">friends = itchat.get_friends(update = <span class="keyword">True</span>)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x540C;&#x5E73;&#x65F6;&#x767B;&#x5F55;&#x7F51;&#x9875;&#x7248;&#x5FAE;&#x4FE1;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x624B;&#x673A;&#x626B;&#x63CF;&#x4E8C;&#x7EF4;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x767B;&#x5F55;&#xFF0C;&#x8FD9;&#x91CC;&#x8FD4;&#x56DE;&#x7684;friends&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x5F53;&#x524D;&#x7528;&#x6237;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x6D41;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x59CB;&#x7EC8;&#x53D6;friends[1:]&#x4F5C;&#x4E3A;&#x539F;&#x59CB;&#x8F93;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x5178;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x6211;&#x672C;&#x4EBA;&#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x91CC;&#x6709;Sex&#x3001;City&#x3001;Province&#x3001;HeadImgUrl&#x3001;Signature&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x9762;&#x7684;&#x5206;&#x6790;&#x5C31;&#x4ECE;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#x6BB5;&#x5165;&#x624B;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziyue7akej217904zabg.jpg" alt="&#x597D;&#x53CB;&#x4FE1;&#x606F;&#x7ED3;&#x6784;&#x5C55;&#x793A;" title>
                </div>
                <div class="image-caption">&#x597D;&#x53CB;&#x4FE1;&#x606F;&#x7ED3;&#x6784;&#x5C55;&#x793A;</div>
            </figure>
<h2 id="&#x597D;&#x53CB;&#x6027;&#x522B;"><a href="#&#x597D;&#x53CB;&#x6027;&#x522B;" class="headerlink" title="&#x597D;&#x53CB;&#x6027;&#x522B;"></a>&#x597D;&#x53CB;&#x6027;&#x522B;</h2><p>&#x2003;&#x2003;&#x5206;&#x6790;&#x597D;&#x53CB;&#x6027;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x83B7;&#x5F97;&#x6240;&#x6709;&#x597D;&#x53CB;&#x7684;&#x6027;&#x522B;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x597D;&#x53CB;&#x4FE1;&#x606F;&#x7684;Sex&#x5B57;&#x6BB5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x7EDF;&#x8BA1;&#x51FA;Male&#x3001;Female&#x548C;Unkonw&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E09;&#x4E2A;&#x6570;&#x503C;&#x7EC4;&#x88C5;&#x5230;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x5373;&#x53EF;&#x4F7F;&#x7528;matplotlib&#x6A21;&#x5757;&#x7ED8;&#x5236;&#x51FA;&#x997C;&#x56FE;&#x6765;&#xFF0C;&#x5176;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">analyseSex</span><span class="params">(firends)</span>:</span></span><br><span class="line">    sexs = list(map(<span class="keyword">lambda</span> x:x[<span class="string">&apos;Sex&apos;</span>],friends[<span class="number">1</span>:]))</span><br><span class="line">    counts = list(map(<span class="keyword">lambda</span> x:x[<span class="number">1</span>],Counter(sexs).items()))</span><br><span class="line">    labels = [<span class="string">&apos;Unknow&apos;</span>,<span class="string">&apos;Male&apos;</span>,<span class="string">&apos;Female&apos;</span>]</span><br><span class="line">    colors = [<span class="string">&apos;red&apos;</span>,<span class="string">&apos;yellowgreen&apos;</span>,<span class="string">&apos;lightskyblue&apos;</span>]</span><br><span class="line">    plt.figure(figsize=(<span class="number">8</span>,<span class="number">5</span>), dpi=<span class="number">80</span>)</span><br><span class="line">    plt.axes(aspect=<span class="number">1</span>) </span><br><span class="line">    plt.pie(counts, <span class="comment">#&#x6027;&#x522B;&#x7EDF;&#x8BA1;&#x7ED3;&#x679C;</span></span><br><span class="line">            labels=labels, <span class="comment">#&#x6027;&#x522B;&#x5C55;&#x793A;&#x6807;&#x7B7E;</span></span><br><span class="line">            colors=colors, <span class="comment">#&#x997C;&#x56FE;&#x533A;&#x57DF;&#x914D;&#x8272;</span></span><br><span class="line">            labeldistance = <span class="number">1.1</span>, <span class="comment">#&#x6807;&#x7B7E;&#x8DDD;&#x79BB;&#x5706;&#x70B9;&#x8DDD;&#x79BB;</span></span><br><span class="line">            autopct = <span class="string">&apos;%3.1f%%&apos;</span>, <span class="comment">#&#x997C;&#x56FE;&#x533A;&#x57DF;&#x6587;&#x672C;&#x683C;&#x5F0F;</span></span><br><span class="line">            shadow = <span class="keyword">False</span>, <span class="comment">#&#x997C;&#x56FE;&#x662F;&#x5426;&#x663E;&#x793A;&#x9634;&#x5F71;</span></span><br><span class="line">            startangle = <span class="number">90</span>, <span class="comment">#&#x997C;&#x56FE;&#x8D77;&#x59CB;&#x89D2;&#x5EA6;</span></span><br><span class="line">            pctdistance = <span class="number">0.6</span> <span class="comment">#&#x997C;&#x56FE;&#x533A;&#x57DF;&#x6587;&#x672C;&#x8DDD;&#x79BB;&#x5706;&#x70B9;&#x8DDD;&#x79BB;</span></span><br><span class="line">    )</span><br><span class="line">    plt.legend(loc=<span class="string">&apos;upper right&apos;</span>,)</span><br><span class="line">    plt.title(<span class="string">u&apos;%s&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x6027;&#x522B;&#x7EC4;&#x6210;&apos;</span> % friends[<span class="number">0</span>][<span class="string">&apos;NickName&apos;</span>])</span><br><span class="line">    plt.show()</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x89E3;&#x91CA;&#x4E0B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5FAE;&#x4FE1;&#x4E2D;&#x6027;&#x522B;&#x5B57;&#x6BB5;&#x7684;&#x53D6;&#x503C;&#x6709;Unkonw&#x3001;Male&#x548C;Female&#x4E09;&#x79CD;&#xFF0C;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x503C;&#x5206;&#x522B;&#x4E3A;0&#x3001;1&#x3001;2&#x3002;&#x901A;&#x8FC7;Collection&#x6A21;&#x5757;&#x4E2D;&#x7684;Counter()&#x5BF9;&#x8FD9;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x53D6;&#x503C;&#x8FDB;&#x884C;&#x7EDF;&#x8BA1;&#xFF0C;&#x5176;items()&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8BE5;&#x5143;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x7EF4;&#x5143;&#x7D20;&#x8868;&#x793A;&#x952E;&#xFF0C;&#x5373;0&#x3001;1&#x3001;2&#xFF0C;&#x8BE5;&#x5143;&#x7EC4;&#x7684;&#x7B2C;&#x4E8C;&#x7EF4;&#x5143;&#x7D20;&#x8868;&#x793A;&#x6570;&#x76EE;&#xFF0C;&#x4E14;&#x8BE5;&#x5143;&#x7EC4;&#x7684;&#x96C6;&#x5408;&#x662F;&#x6392;&#x5E8F;&#x8FC7;&#x7684;&#xFF0C;&#x5373;&#x5176;&#x952E;&#x6309;&#x7167;0&#x3001;1&#x3001;2 &#x7684;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;map()&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8FD9;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x53D6;&#x503C;&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;matplotlib&#x7ED8;&#x5236;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x53D6;&#x503C;&#x5404;&#x81EA;&#x6240;&#x5360;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x7531;matplotlib&#x8BA1;&#x7B97;&#x5F97;&#x51FA;&#x3002;&#x4E0B;&#x56FE;&#x662F;matplotlib&#x7ED8;&#x5236;&#x7684;&#x597D;&#x53CB;&#x6027;&#x522B;&#x5206;&#x5E03;&#x56FE;&#xFF1A;<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziyb6mxjqj20hs0b40ss.jpg" alt="&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x6027;&#x522B;&#x5206;&#x6790;" title>
                </div>
                <div class="image-caption">&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x6027;&#x522B;&#x5206;&#x6790;</div>
            </figure><p></p>
<p>&#x2003;&#x2003;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x89C9;&#x5F97;&#x610F;&#x5916;&#xFF0C;&#x7537;&#x5973;&#x6BD4;&#x4F8B;&#x4E25;&#x91CD;&#x5931;&#x8861;&#xFF0C;&#x8FD9;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x6211;&#x5355;&#x8EAB;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x53EF;&#x6211;&#x4E0D;&#x89C9;&#x5F97;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x7537;&#x5973;&#x6BD4;&#x4F8B;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x597D;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x5355;&#x8EAB;&#x662F;&#x56E0;&#x4E3A;&#x793E;&#x4EA4;&#x5708;&#x5B50;&#x72ED;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x4E0D;&#x662F;&#x6269;&#x5C55;&#x4E86;&#x793E;&#x4EA4;&#x5708;&#x5B50;&#x5C31;&#x80FD;&#x6446;&#x8131;&#x5355;&#x8EAB;&#x5462;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x6216;&#x8BB8;&#x8FD9;&#x6837;&#x4F1A;&#x589E;&#x52A0;&#x8131;&#x5355;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x53EF;&#x5E78;&#x8FD0;&#x4E4B;&#x795E;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x7737;&#x987E;&#x6211;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x597D;&#x8FD0;&#x6C14;&#x65E9;&#x5728;&#x6211;24&#x5C81;&#x4EE5;&#x524D;&#x5C31;&#x6D88;&#x8017;&#x5B8C;&#x5566;&#x3002;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x70ED;&#x95E8;&#x7684;&#x8BDD;&#x9898;&#xFF1A;<a href="https://www.zhihu.com/question/55744630" target="_blank" rel="noopener">&#x73B0;&#x5728;&#x7684;&#x7537;&#x6027;&#x662F;&#x5426;&#x666E;&#x904D;&#x4E0D;&#x518D;&#x5BF9;&#x5973;&#x6027;&#x5C55;&#x5F00;&#x8FFD;&#x6C42;&#x4E86;&#xFF1F;</a>&#xFF0C;&#x5176;&#x5B9E;&#x54EA;&#x91CC;&#x4F1A;&#x6709;&#x4EBA;&#x559C;&#x6B22;&#x5B64;&#x72EC;&#x5462;&#xFF1F;&#x65E0;&#x975E;&#x662F;&#x6015;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x7684;&#x5931;&#x671B;&#x7F62;&#x4E86;&#x3002;&#x6709;&#x7684;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x82B1;&#x513F;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x6070;&#x597D;&#x9014;&#x5F84;&#x4E86;&#x5979;&#x7684;&#x7EFD;&#x653E;&#x3002;&#x66FE;&#x7ECF;&#x6709;&#x4EBA;&#x8BF4;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x60C5;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x5979;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x505A;&#x51FA;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x51B3;&#x5B9A;&#x90FD;&#x70BD;&#x70ED;&#x800C;&#x60B2;&#x58EE;&#x3002;&#x6240;&#x8C13;&#x201D;&#x6167;&#x6781;&#x5FC5;&#x4F24;&#xFF0C;&#x60C5;&#x6DF1;&#x4E0D;&#x5BFF;&#xFF1B;&#x8C26;&#x8C26;&#x541B;&#x5B50;&#xFF0C;&#x6E29;&#x6DA6;&#x5982;&#x7389;&#x201D;&#xFF0C;&#x4E16;&#x4EBA;&#x82E6;&#x4E94;&#x6BD2;&#x8005;&#x5927;&#x62B5;&#x5982;&#x6B64;&#x3002;</p>
<h2 id="&#x597D;&#x53CB;&#x5934;&#x50CF;"><a href="#&#x597D;&#x53CB;&#x5934;&#x50CF;" class="headerlink" title="&#x597D;&#x53CB;&#x5934;&#x50CF;"></a>&#x597D;&#x53CB;&#x5934;&#x50CF;</h2><p>&#x2003;&#x2003;&#x5206;&#x6790;&#x597D;&#x53CB;&#x5934;&#x50CF;&#xFF0C;&#x4ECE;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x5206;&#x6790;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x597D;&#x53CB;&#x5934;&#x50CF;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#x7684;&#x597D;&#x53CB;&#x6BD4;&#x91CD;&#x6709;&#x591A;&#x5927;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E9B;&#x597D;&#x53CB;&#x5934;&#x50CF;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x51FA;&#x54EA;&#x4E9B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5173;&#x952E;&#x5B57;&#x3002;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6839;&#x636E;HeadImgUrl&#x5B57;&#x6BB5;&#x4E0B;&#x8F7D;&#x5934;&#x50CF;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;<a href="http://youtu.qq.com/#/home" target="_blank" rel="noopener">&#x817E;&#x8BAF;&#x4F18;&#x56FE;</a>&#x63D0;&#x4F9B;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x76F8;&#x5173;&#x7684;API&#x63A5;&#x53E3;&#xFF0C;&#x68C0;&#x6D4B;&#x5934;&#x50CF;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x5426;&#x5B58;&#x5728;&#x4EBA;&#x8138;&#x4EE5;&#x53CA;&#x63D0;&#x53D6;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x5206;&#x7C7B;&#x6C47;&#x603B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x997C;&#x56FE;&#x6765;&#x5448;&#x73B0;&#x7ED3;&#x679C;&#xFF1B;&#x540E;&#x8005;&#x662F;&#x5BF9;&#x6587;&#x672C;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8BCD;&#x4E91;&#x6765;&#x5448;&#x73B0;&#x7ED3;&#x679C;&#x3002;&#x5173;&#x952E;&#x4EE3;&#x7801;&#x5982;&#x4E0B; &#x6240;&#x793A;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">analyseHeadImage</span><span class="params">(frineds)</span>:</span></span><br><span class="line">    <span class="comment"># Init Path</span></span><br><span class="line">    basePath = os.path.abspath(<span class="string">&apos;.&apos;</span>)</span><br><span class="line">    baseFolder = basePath + <span class="string">&apos;\\HeadImages\\&apos;</span></span><br><span class="line">    <span class="keyword">if</span>(os.path.exists(baseFolder) == <span class="keyword">False</span>):</span><br><span class="line">        os.makedirs(baseFolder)</span><br><span class="line"></span><br><span class="line">    <span class="comment"># Analyse Images</span></span><br><span class="line">    faceApi = FaceAPI()</span><br><span class="line">    use_face = <span class="number">0</span></span><br><span class="line">    not_use_face = <span class="number">0</span></span><br><span class="line">    image_tags = <span class="string">&apos;&apos;</span></span><br><span class="line">    <span class="keyword">for</span> index <span class="keyword">in</span> range(<span class="number">1</span>,len(friends)):</span><br><span class="line">        friend = friends[index]</span><br><span class="line">        <span class="comment"># Save HeadImages</span></span><br><span class="line">        imgFile = baseFolder + <span class="string">&apos;\\Image%s.jpg&apos;</span> % str(index)</span><br><span class="line">        imgData = itchat.get_head_img(userName = friend[<span class="string">&apos;UserName&apos;</span>])</span><br><span class="line">        <span class="keyword">if</span>(os.path.exists(imgFile) == <span class="keyword">False</span>):</span><br><span class="line">            <span class="keyword">with</span> open(imgFile,<span class="string">&apos;wb&apos;</span>) <span class="keyword">as</span> file:</span><br><span class="line">                file.write(imgData)</span><br><span class="line"></span><br><span class="line">        <span class="comment"># Detect Faces</span></span><br><span class="line">        time.sleep(<span class="number">1</span>)</span><br><span class="line">        result = faceApi.detectFace(imgFile)</span><br><span class="line">        <span class="keyword">if</span> result == <span class="keyword">True</span>:</span><br><span class="line">            use_face += <span class="number">1</span></span><br><span class="line">        <span class="keyword">else</span>:</span><br><span class="line">            not_use_face += <span class="number">1</span> </span><br><span class="line"></span><br><span class="line">        <span class="comment"># Extract Tags</span></span><br><span class="line">        result = faceApi.extractTags(imgFile)</span><br><span class="line">        image_tags += <span class="string">&apos;,&apos;</span>.join(list(map(<span class="keyword">lambda</span> x:x[<span class="string">&apos;tag_name&apos;</span>],result)))</span><br><span class="line">    </span><br><span class="line">    labels = [<span class="string">u&apos;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&apos;</span>,<span class="string">u&apos;&#x4E0D;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&apos;</span>]</span><br><span class="line">    counts = [use_face,not_use_face]</span><br><span class="line">    colors = [<span class="string">&apos;red&apos;</span>,<span class="string">&apos;yellowgreen&apos;</span>,<span class="string">&apos;lightskyblue&apos;</span>]</span><br><span class="line">    plt.figure(figsize=(<span class="number">8</span>,<span class="number">5</span>), dpi=<span class="number">80</span>)</span><br><span class="line">    plt.axes(aspect=<span class="number">1</span>) </span><br><span class="line">    plt.pie(counts, <span class="comment">#&#x6027;&#x522B;&#x7EDF;&#x8BA1;&#x7ED3;&#x679C;</span></span><br><span class="line">            labels=labels, <span class="comment">#&#x6027;&#x522B;&#x5C55;&#x793A;&#x6807;&#x7B7E;</span></span><br><span class="line">            colors=colors, <span class="comment">#&#x997C;&#x56FE;&#x533A;&#x57DF;&#x914D;&#x8272;</span></span><br><span class="line">            labeldistance = <span class="number">1.1</span>, <span class="comment">#&#x6807;&#x7B7E;&#x8DDD;&#x79BB;&#x5706;&#x70B9;&#x8DDD;&#x79BB;</span></span><br><span class="line">            autopct = <span class="string">&apos;%3.1f%%&apos;</span>, <span class="comment">#&#x997C;&#x56FE;&#x533A;&#x57DF;&#x6587;&#x672C;&#x683C;&#x5F0F;</span></span><br><span class="line">            shadow = <span class="keyword">False</span>, <span class="comment">#&#x997C;&#x56FE;&#x662F;&#x5426;&#x663E;&#x793A;&#x9634;&#x5F71;</span></span><br><span class="line">            startangle = <span class="number">90</span>, <span class="comment">#&#x997C;&#x56FE;&#x8D77;&#x59CB;&#x89D2;&#x5EA6;</span></span><br><span class="line">            pctdistance = <span class="number">0.6</span> <span class="comment">#&#x997C;&#x56FE;&#x533A;&#x57DF;&#x6587;&#x672C;&#x8DDD;&#x79BB;&#x5706;&#x70B9;&#x8DDD;&#x79BB;</span></span><br><span class="line">    )</span><br><span class="line">    plt.legend(loc=<span class="string">&apos;upper right&apos;</span>,)</span><br><span class="line">    plt.title(<span class="string">u&apos;%s&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#x60C5;&#x51B5;&apos;</span> % friends[<span class="number">0</span>][<span class="string">&apos;NickName&apos;</span>])</span><br><span class="line">    plt.show() </span><br><span class="line"></span><br><span class="line">    image_tags = image_tags.encode(<span class="string">&apos;iso8859-1&apos;</span>).decode(<span class="string">&apos;utf-8&apos;</span>)</span><br><span class="line">    back_coloring = np.array(Image.open(<span class="string">&apos;face.jpg&apos;</span>))</span><br><span class="line">    wordcloud = WordCloud(</span><br><span class="line">        font_path=<span class="string">&apos;simfang.ttf&apos;</span>,</span><br><span class="line">        background_color=<span class="string">&quot;white&quot;</span>,</span><br><span class="line">        max_words=<span class="number">1200</span>,</span><br><span class="line">        mask=back_coloring, </span><br><span class="line">        max_font_size=<span class="number">75</span>,</span><br><span class="line">        random_state=<span class="number">45</span>,</span><br><span class="line">        width=<span class="number">800</span>, </span><br><span class="line">        height=<span class="number">480</span>, </span><br><span class="line">        margin=<span class="number">15</span></span><br><span class="line">    )</span><br><span class="line"></span><br><span class="line">    wordcloud.generate(image_tags)</span><br><span class="line">    plt.imshow(wordcloud)</span><br><span class="line">    plt.axis(<span class="string">&quot;off&quot;</span>)</span><br><span class="line">    plt.show()</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;HeadImages&#x76EE;&#x5F55;&#xFF0C;&#x7528;&#x4EE5;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x597D;&#x53CB;&#x7684;&#x5934;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4F1A;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;FaceApi&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x7531;&#x817E;&#x8BAF;&#x4F18;&#x56FE;&#x7684;SDK&#x5C01;&#x88C5;&#x800C;&#x6765;&#xFF0C;&#x8FD9;&#x91CC;&#x5206;&#x522B;&#x8C03;&#x7528;&#x4E86;<a href="http://youtu.qq.com/#/develop/api-face-analysis-detect" target="_blank" rel="noopener">&#x4EBA;&#x8138;&#x68C0;&#x6D4B;</a>&#x548C;<a href="http://youtu.qq.com/#/develop/api-image-tag" target="_blank" rel="noopener">&#x56FE;&#x50CF;&#x6807;&#x7B7E;&#x8BC6;&#x522B;</a>&#x4E24;&#x4E2A;API&#x63A5;&#x53E3;&#xFF0C;&#x524D;&#x8005;&#x4F1A;&#x7EDF;&#x8BA1;&#x201D;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#x201D;&#x548C;&#x201D;&#x4E0D;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#x201D;&#x7684;&#x597D;&#x53CB;&#x5404;&#x81EA;&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x540E;&#x8005;&#x4F1A;&#x7D2F;&#x52A0;&#x6BCF;&#x4E2A;&#x5934;&#x50CF;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x5176;&#x5206;&#x6790;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy7pojhzj20zk0hb0ta.jpg" alt title>
                </div>
                <div class="image-caption"></div>
            </figure><p></p>
<p>&#x2003;&#x2003;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4E2D;&#xFF0C;&#x7EA6;&#x6709;&#x63A5;&#x8FD1;1/4&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4F7F;&#x7528;&#x4E86;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#xFF0C; &#x800C;&#x6709;&#x63A5;&#x8FD1;3/4&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x6CA1;&#x6709;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x5728;&#x6240;&#x6709;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4E2D;&#x5BF9;&#x201D;&#x989C;&#x503C; &#x201C;&#x6709;&#x81EA;&#x4FE1;&#x7684;&#x4EBA;&#xFF0C;&#x4EC5;&#x4EC5;&#x5360;&#x5230;&#x597D;&#x53CB;&#x603B;&#x6570;&#x7684;25%&#xFF0C;&#x6216;&#x8005;&#x8BF4;75%&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x884C;&#x4E8B;&#x98CE;&#x683C;&#x504F;&#x4F4E;&#x8C03;&#x4E3A;&#x4E3B;&#xFF0C;&#x4E0D;&#x559C;&#x6B22;&#x7528;&#x4EBA;&#x8138;&#x5934;&#x50CF;&#x505A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x3002;&#x8FD9;&#x662F;&#x5426;&#x8BF4;&#x660E;&#x201D;&#x597D;&#x770B;&#x7684;&#x76AE;&#x56CA;&#x201D;&#x5E76;&#x975E;&#x662F;&#x5343;&#x7BC7;&#x4E00;&#x5F8B;&#xFF0C;&#x957F;&#x5F97;&#x597D;&#x770B;&#x7684;&#x4EBA;&#x5B9E;&#x5728;&#x662F;&#x5C11;&#x6570;&#x4E2D;&#x7684;&#x5C11;&#x6570;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x5973;&#x751F;&#x7684;&#x5986;&#x5BB9;&#x8D8A;&#x6765;&#x8D8A;&#x5411;&#x7740;&#x201D;&#x97E9;&#x5F0F;&#x534A;&#x6C38;&#x4E45;&#x7C97;&#x5E73;&#x7709;&#x201D;&#x3001;&#x201D;&#x74DC;&#x5B50;&#x8138;&#x201D;&#x548C;&#x201D;&#x5927;&#x7EA2;&#x5507;&#x201D;&#x9760;&#x62E2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x7537;&#x751F;&#x7684;&#x670D;&#x9970;&#x8D8A;&#x6765;&#x8D8A;&#x5411;&#x7740;&#x201D;&#x5927;&#x80CC;&#x5934;&#x201D;&#x3001;&#x201D;&#x9AD8;&#x9886;&#x6BDB;&#x8863;&#x201D;&#x548C;&#x201D;&#x957F;&#x6B3E;&#x5927;&#x8863;&#x201D;&#x9760;&#x62E2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x5F97;&#x4E2A;&#x6027;&#x4E00;&#x6B21;&#x3002;&#x751F;&#x547D;&#x4E2D;&#x6709;&#x592A;&#x591A;&#x88AB;&#x4E16;&#x4FD7;&#x7ED1;&#x67B6;&#x7740;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x65E2;&#x8981;&#x548C;&#x522B;&#x4EBA;&#x4E0D;&#x4E00;&#x6837; &#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x548C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x4EBA;&#x751F;&#x5728;&#x4E16;&#x7684;&#x65E0;&#x53EF;&#x5948;&#x4F55;&#x3002;&#x8003;&#x8651;&#x5230;&#x817E;&#x8BAF;&#x4F18;&#x56FE;&#x5E76;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x5F97;&#x8BC6;&#x522B;&#x201D;&#x4EBA;&#x8138;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5BF9;&#x597D;&#x53CB;&#x5934;&#x50CF;&#x4E2D;&#x7684;&#x6807;&#x7B7E;&#x518D;&#x6B21;&#x8FDB;&#x884C;&#x63D0;&#x53D6;&#xFF0C;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7684;&#x5934;&#x50CF;&#x4E2D;&#x6709;&#x54EA;&#x4E9B; &#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x5176;&#x5206;&#x6790;&#x7ED3;&#x679C;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF1A;<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy4ztxq6j20zk0hbgnv.jpg" alt="&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x5934;&#x50CF;&#x6807;&#x7B7E;&#x8BCD;&#x4E91;&#x5C55;&#x793A;" title>
                </div>
                <div class="image-caption">&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x5934;&#x50CF;&#x6807;&#x7B7E;&#x8BCD;&#x4E91;&#x5C55;&#x793A;</div>
            </figure><p></p>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x8BCD;&#x4E91;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF1A;&#x5728;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#x8BCD;&#x4E91;&#x4E2D;&#xFF0C;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6709;&#xFF1A;&#x5973;&#x5B69;&#x3001;&#x6811;&#x6728;&#x3001;&#x623F;&#x5C4B;&#x3001;&#x6587;&#x672C;&#x3001;&#x622A;&#x56FE;&#x3001;&#x5361;&#x901A;&#x3001;&#x5408;&#x5F71;&#x3001;&#x5929;&#x7A7A;&#x3001;&#x5927;&#x6D77;&#x3002;&#x8FD9;&#x8BF4;&#x660E;&#x5728;&#x6211;&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4E2D;&#xFF0C;&#x597D;&#x53CB;&#x9009;&#x62E9;&#x7684;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x4E3B;&#x8981;&#x6709;&#x65E5;&#x5E38;&#x3001;&#x65C5;&#x6E38;&#x3001;&#x98CE;&#x666F;&#x3001;&#x622A;&#x56FE;&#x56DB;&#x4E2A;&#x6765;&#x6E90;&#xFF0C;&#x597D;&#x53CB;&#x9009;&#x62E9;&#x7684;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x4E2D;&#x98CE;&#x683C;&#x4EE5;&#x5361;&#x901A;&#x4E3A;&#x4E3B;&#xFF0C;&#x597D;&#x53CB;&#x9009;&#x62E9;&#x7684;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x8981;&#x7D20;&#x6709;&#x5929;&#x7A7A;&#x3001;&#x5927;&#x6D77;&#x3001;&#x623F;&#x5C4B;&#x3001;&#x6811;&#x6728;&#x3002;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x6240;&#x6709;&#x597D;&#x53CB;&#x5934;&#x50CF;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x5728;&#x6211;&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4E2A;&#x4EBA;&#x7167;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;15&#x4EBA;&#xFF0C;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;53&#x4EBA;&#xFF0C;&#x4F7F;&#x7528;&#x52A8;&#x6F2B;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;25&#x4EBA;&#xFF0C;&#x4F7F;&#x7528;&#x5408;&#x7167;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;3&#x4EBA;&#xFF0C;&#x4F7F;&#x7528;&#x5B69;&#x7AE5;&#x7167;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;5&#x4EBA;&#xFF0C;&#x4F7F;&#x7528;&#x98CE;&#x666F;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;13&#x4EBA;&#xFF0C;&#x4F7F;&#x7528;&#x5973;&#x5B69;&#x7167;&#x7247;&#x4F5C;&#x4E3A;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x7684;&#x6709;18&#x4EBA;&#xFF0C;&#x57FA;&#x672C;&#x7B26;&#x5408;&#x56FE;&#x50CF;&#x6807;&#x7B7E;&#x63D0;&#x53D6;&#x7684;&#x5206;&#x6790;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x597D;&#x53CB;&#x7B7E;&#x540D;"><a href="#&#x597D;&#x53CB;&#x7B7E;&#x540D;" class="headerlink" title="&#x597D;&#x53CB;&#x7B7E;&#x540D;"></a>&#x597D;&#x53CB;&#x7B7E;&#x540D;</h2><p>&#x2003;&#x2003;&#x5206;&#x6790;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#xFF0C;&#x7B7E;&#x540D;&#x662F;&#x597D;&#x53CB;&#x4FE1;&#x606F;&#x4E2D;&#x6700;&#x4E3A;&#x4E30;&#x5BCC;&#x7684;&#x6587;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x6309;&#x7167;&#x4EBA;&#x7C7B;&#x60EF;&#x7528;&#x7684;&#x201D;&#x8D34;&#x6807;&#x7B7E;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x7B7E;&#x540D;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x51FA;&#x67D0;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x67D0;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#x72B6;&#x6001;&#xFF0C;&#x5C31;&#x50CF;&#x4EBA;&#x5F00;&#x5FC3;&#x4E86;&#x4F1A;&#x7B11;&#x3001;&#x54C0;&#x4F24;&#x4E86;&#x4F1A;&#x54ED;&#xFF0C;&#x54ED;&#x548C;&#x7B11;&#x4E24;&#x79CD;&#x6807;&#x7B7E;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x660E;&#x4E86;&#x4EBA;&#x5F00;&#x5FC3;&#x548C;&#x54C0;&#x4F24;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5BF9;&#x7B7E;&#x540D;&#x505A;&#x4E24;&#x79CD;&#x5904;&#x7406;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x4F7F;&#x7528;&#x7528;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x8FDB;&#x884C;&#x5206;&#x8BCD;&#x540E;&#x751F;&#x6210;&#x8BCD;&#x4E91;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E86;&#x89E3;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x54EA;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#xFF1B;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x4F7F;&#x7528;SnowNLP&#x5206;&#x6790;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4E2D;&#x7684;&#x611F;&#x60C5;&#x503E;&#x5411;&#xFF0C;&#x5373;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x6574;&#x4F53;&#x4E0A;&#x662F;&#x8868;&#x73B0;&#x4E3A;&#x6B63;&#x9762;&#x7684;&#x3001;&#x8D1F;&#x9762;&#x7684;&#x8FD8;&#x662F;&#x4E2D;&#x7ACB;&#x7684;&#xFF0C;&#x5404;&#x81EA;&#x7684;&#x6BD4;&#x91CD;&#x662F;&#x591A;&#x5C11;&#x3002;&#x8FD9;&#x91CC;&#x63D0;&#x53D6;Signature&#x5B57;&#x6BB5;&#x5373;&#x53EF;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">analyseSignature</span><span class="params">(friends)</span>:</span></span><br><span class="line">    signatures = <span class="string">&apos;&apos;</span></span><br><span class="line">    emotions = []</span><br><span class="line">    pattern = re.compile(<span class="string">&quot;1f\d.+&quot;</span>)</span><br><span class="line">    <span class="keyword">for</span> friend <span class="keyword">in</span> friends:</span><br><span class="line">        signature = friend[<span class="string">&apos;Signature&apos;</span>]</span><br><span class="line">        <span class="keyword">if</span>(signature != <span class="keyword">None</span>):</span><br><span class="line">            signature = signature.strip().replace(<span class="string">&apos;span&apos;</span>, <span class="string">&apos;&apos;</span>).replace(<span class="string">&apos;class&apos;</span>, <span class="string">&apos;&apos;</span>).replace(<span class="string">&apos;emoji&apos;</span>, <span class="string">&apos;&apos;</span>)</span><br><span class="line">            signature = re.sub(<span class="string">r&apos;1f(\d.+)&apos;</span>,<span class="string">&apos;&apos;</span>,signature)</span><br><span class="line">            <span class="keyword">if</span>(len(signature)&gt;<span class="number">0</span>):</span><br><span class="line">                nlp = SnowNLP(signature)</span><br><span class="line">                emotions.append(nlp.sentiments)</span><br><span class="line">                signatures += <span class="string">&apos; &apos;</span>.join(jieba.analyse.extract_tags(signature,<span class="number">5</span>))</span><br><span class="line">    <span class="keyword">with</span> open(<span class="string">&apos;signatures.txt&apos;</span>,<span class="string">&apos;wt&apos;</span>,encoding=<span class="string">&apos;utf-8&apos;</span>) <span class="keyword">as</span> file:</span><br><span class="line">         file.write(signatures)</span><br><span class="line"></span><br><span class="line">    <span class="comment"># Sinature WordCloud</span></span><br><span class="line">    back_coloring = np.array(Image.open(<span class="string">&apos;flower.jpg&apos;</span>))</span><br><span class="line">    wordcloud = WordCloud(</span><br><span class="line">        font_path=<span class="string">&apos;simfang.ttf&apos;</span>,</span><br><span class="line">        background_color=<span class="string">&quot;white&quot;</span>,</span><br><span class="line">        max_words=<span class="number">1200</span>,</span><br><span class="line">        mask=back_coloring, </span><br><span class="line">        max_font_size=<span class="number">75</span>,</span><br><span class="line">        random_state=<span class="number">45</span>,</span><br><span class="line">        width=<span class="number">960</span>, </span><br><span class="line">        height=<span class="number">720</span>, </span><br><span class="line">        margin=<span class="number">15</span></span><br><span class="line">    )</span><br><span class="line"></span><br><span class="line">    wordcloud.generate(signatures)</span><br><span class="line">    plt.imshow(wordcloud)</span><br><span class="line">    plt.axis(<span class="string">&quot;off&quot;</span>)</span><br><span class="line">    plt.show()</span><br><span class="line">    wordcloud.to_file(<span class="string">&apos;signatures.jpg&apos;</span>)</span><br><span class="line">    </span><br><span class="line">    <span class="comment"># Signature Emotional Judgment</span></span><br><span class="line">    count_good = len(list(filter(<span class="keyword">lambda</span> x:x&gt;<span class="number">0.66</span>,emotions)))</span><br><span class="line">    count_normal = len(list(filter(<span class="keyword">lambda</span> x:x&gt;=<span class="number">0.33</span> <span class="keyword">and</span> x&lt;=<span class="number">0.66</span>,emotions)))</span><br><span class="line">    count_bad = len(list(filter(<span class="keyword">lambda</span> x:x&lt;<span class="number">0.33</span>,emotions)))</span><br><span class="line">    labels = [<span class="string">u&apos;&#x8D1F;&#x9762;&#x6D88;&#x6781;&apos;</span>,<span class="string">u&apos;&#x4E2D;&#x6027;&apos;</span>,<span class="string">u&apos;&#x6B63;&#x9762;&#x79EF;&#x6781;&apos;</span>]</span><br><span class="line">    values = (count_bad,count_normal,count_good)</span><br><span class="line">    plt.rcParams[<span class="string">&apos;font.sans-serif&apos;</span>] = [<span class="string">&apos;simHei&apos;</span>] </span><br><span class="line">    plt.rcParams[<span class="string">&apos;axes.unicode_minus&apos;</span>] = <span class="keyword">False</span></span><br><span class="line">    plt.xlabel(<span class="string">u&apos;&#x60C5;&#x611F;&#x5224;&#x65AD;&apos;</span>)</span><br><span class="line">    plt.ylabel(<span class="string">u&apos;&#x9891;&#x6570;&apos;</span>)</span><br><span class="line">    plt.xticks(range(<span class="number">3</span>),labels)</span><br><span class="line">    plt.legend(loc=<span class="string">&apos;upper right&apos;</span>,)</span><br><span class="line">    plt.bar(range(<span class="number">3</span>), values, color = <span class="string">&apos;rgb&apos;</span>)</span><br><span class="line">    plt.title(<span class="string">u&apos;%s&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x60C5;&#x611F;&#x5206;&#x6790;&apos;</span> % friends[<span class="number">0</span>][<span class="string">&apos;NickName&apos;</span>])</span><br><span class="line">    plt.show()</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x8BCD;&#x4E91;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF1A;&#x5728;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E2D;&#xFF0C;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x6709;&#xFF1A;&#x52AA;&#x529B;&#x3001;&#x957F;&#x5927;&#x3001;&#x7F8E;&#x597D;&#x3001;&#x5FEB;&#x4E50;&#x3001;&#x751F;&#x6D3B;&#x3001;&#x5E78;&#x798F;&#x3001;&#x4EBA;&#x751F;&#x3001;&#x8FDC;&#x65B9;&#x3001;&#x65F6;&#x5149;&#x3001;&#x6563;&#x6B65;&#x3002;&#x679C;&#x7136;&#x6211;&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x90FD;&#x662F;&#x6E29;&#x6696;&#x3001;&#x6B63;&#x76F4;&#x7684;&#x597D;&#x9752;&#x5E74;&#x554A;&#xFF01; <span class="github-emoji" style="color: transparent;background:no-repeat url(https://assets-cdn.github.com/images/icons/emoji/unicode/1f604.png?v8) center/contain" data-src="https://assets-cdn.github.com/images/icons/emoji/unicode/1f604.png?v8">&#x1F604;</span>&#x5176;&#x5B9E;&#xFF0C;&#x7B7E;&#x540D;&#x8FD9;&#x4E2A;&#x8BBE;&#x5B9A;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x5728;&#x53CD;&#x6620;&#x4EBA;&#x7684;&#x4E00;&#x79CD;&#x5FC3;&#x6001;&#xFF0C;&#x4EBA;&#x5728;&#x5E74;&#x8F7B;&#x65F6;&#x4E0D;&#x514D;&#x201D;&#x4E3A;&#x8D4B;&#x65B0;&#x8BCD;&#x5F3A;&#x8BF4;&#x6101;&#x201D;&#xFF0C;&#x7B49;&#x5230;&#x4F60;&#x771F;&#x6B63;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x7CBE;&#x795E;&#x5883;&#x754C;&#xFF0C;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x5E74;&#x8F7B;&#x65F6;&#x56FE;&#x6837;&#x56FE;&#x68EE;&#x7834;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x610F;&#x8BA9;&#x522B;&#x4EBA;&#x4E86;&#x89E3;&#x8FC7;&#x53BB;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x4F34;&#x968F;&#x7740;&#x4EBA;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x67D0;&#x4E00;&#x79CD;&#x77AC;&#x95F4;&#x7684;&#x72B6;&#x6001;&#x7B80;&#x76F4;&#x4E0D;&#x5FCD;&#x76F4;&#x89C6;&#xFF0C;QQ&#x7A7A;&#x95F4;&#x966A;&#x4F34;&#x4E86;&#x6211;&#x4EEC;&#x8FD9;&#x4EE3;&#x4EBA;&#x7684;&#x6574;&#x4E2A;&#x9752;&#x6625;&#xFF0C;&#x4EE4;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x201D;&#x90A3;&#x5E74;&#x4ECA;&#x65E5;&#x201D;&#x529F;&#x80FD;&#xFF0C;&#x6709;&#x65F6;&#x8BA9;&#x6211;&#x4EEC;&#x611F;&#x5230;&#x56DE;&#x5FC6;&#x7684;&#x6E29;&#x6696;&#xFF0C;&#x6709;&#x65F6;&#x8BA9;&#x6211;&#x4EEC;&#x611F;&#x5230;&#x5C81;&#x6708;&#x7684;&#x8427;&#x6740;&#xFF0C;&#x201D;&#x5F53;&#x65F6;&#x53EA;&#x9053;&#x662F;&#x5BFB;&#x5E38;&#x201D;&#x7684;&#x7269;&#x662F;&#x4EBA;&#x975E;&#xFF0C;&#x201D;&#x56DE;&#x9996;&#x5411;&#x6765;&#x8427;&#x745F;&#x5904;&#x201D;&#x7684;&#x6DE1;&#x5B9A;&#x4ECE;&#x5BB9;&#xFF0C;&#x201D;&#x4ECA;&#x5915;&#x590D;&#x4F55;&#x5915;&#x201D;&#x7684;&#x5931;&#x843D;&#x60C6;&#x6005;&#x2026;&#x2026;&#x90FD;&#x5728;&#x8FD9;&#x4E00;&#x884C;&#x884C;&#x7B7E;&#x540D;&#x91CC;&#x7559;&#x4E0B;&#x6DF1;&#x6DF1;&#x6D45;&#x6D45;&#x7684;&#x5370;&#x8BB0;&#x3002;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x6709;&#x5173;&#x4E8E;<a href="https://www.zhihu.com/topic/19665970/hot" target="_blank" rel="noopener">&#x7B7E;&#x540D;</a>&#x7684;&#x8BDD;&#x9898;&#x8BA8;&#x8BBA;&#xFF0C;&#x5BF9;&#x6B64;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x4E0D;&#x59A8;&#x627E;&#x65F6;&#x95F4;&#x770B;&#x770B;&#x3002;:smile:</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixyiqv1lj20zk0hbgpc.jpg" alt="&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x8BCD;&#x4E91;&#x5C55;&#x793A;" title>
                </div>
                <div class="image-caption">&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x8BCD;&#x4E91;&#x5C55;&#x793A;</div>
            </figure>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x67F1;&#x72B6;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF1A;&#x5728;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E2D;&#xFF0C;&#x6B63;&#x9762;&#x79EF;&#x6781;&#x7684;&#x60C5;&#x611F;&#x5224;&#x65AD;&#x7EA6;&#x5360;&#x5230;55.56%&#xFF0C;&#x4E2D;&#x7ACB;&#x7684;&#x60C5;&#x611F;&#x5224;&#x65AD;&#x7EA6;&#x5360;&#x5230;32.10%&#xFF0C;&#x8D1F;&#x9762;&#x6D88;&#x6781;&#x7684;&#x60C5;&#x611F;&#x5224;&#x65AD;&#x7EA6;&#x5360;&#x5230;12.35%&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x548C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8BCD;&#x4E91;&#x5C55;&#x793A;&#x7684;&#x7ED3;&#x679C;&#x57FA;&#x672C;&#x543B;&#x5408;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x5728;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E2D;&#xFF0C;&#x7EA6;&#x6709;87.66%&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#xFF0C;&#x4F20;&#x8FBE;&#x51FA;&#x6765;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x79EF;&#x6781;&#x5411;&#x4E0A;&#x7684;&#x6001;&#x5EA6;&#x3002;&#x670B;&#x53CB;&#x5708;&#x4E2D;&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x4E24;&#x7C7B;&#x7528;&#x6237;&#xFF0C;&#x7B2C;&#x4E00;&#x7C7B;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x670B;&#x53CB;&#x5708;&#x8BB0;&#x5F55;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x7B2C;&#x4E8C;&#x7C7B;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x670B;&#x53CB;&#x5708;&#x8F93;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x7C7B;&#x7528;&#x6237;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x4ECB;&#x610F;&#x522B;&#x4EBA;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x8FC7;&#x53BB;&#xFF0C;&#x5B83;&#x66F4;&#x5728;&#x4E4E;&#x5B83;&#x4ECE;&#x59CB;&#x81F3;&#x7EC8;&#x8F93;&#x51FA;&#x7684;&#x89C2;&#x70B9;&#x662F;&#x5426;&#x4E00;&#x81F4;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x7BA1;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x522B;&#x4EBA;&#x5728;&#x6216;&#x6652;&#x7F8E;&#x98DF;&#x3001;&#x6216;&#x6652;&#x65C5;&#x6E38;&#x3001;&#x6216;&#x79C0;&#x6069;&#x7231;&#x3001;&#x6216;&#x6652;&#x5B9D;&#x5B9D;&#x3001;&#x6216;&#x7172;&#x9E21;&#x6C64;&#x7B49;&#x7B49;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#x8FD9;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#xFF0C;&#x7CBE;&#x795E;&#x5C42;&#x6B21;&#x548C;&#x7269;&#x8D28;&#x5C42;&#x6B21;&#x6BD4;&#x4F60;&#x9AD8;&#x7684;&#x4EBA;&#x7FA4;&#xFF0C;&#x89C9;&#x5F97;&#x4F60;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x201D;&#x65E0;&#x8DA3;&#x201D;&#xFF0C;&#x8FD9;&#x662F;&#x7B26;&#x5408;&#x4EBA;&#x7C7B;&#x4E00;&#x8D2F;&#x7684;&#x8BA4;&#x77E5;&#x65B9;&#x5F0F;&#x7684;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53CD;&#x800C;&#x662F;&#x90A3;&#x4E9B;&#x548C;&#x4F60;&#x5C42;&#x6B21;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x4EBA;&#x7FA4;&#xFF0C;&#x5BF9;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x4EBA;&#x6216;&#x8005;&#x4E8B;&#x7269;&#x5984;&#x52A0;&#x5224;&#x65AD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8BF7;&#x76F4;&#x63A5;&#x5C4F;&#x853D;&#x6211;&#x5C31;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x505A;&#x670B;&#x53CB;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x56E0;&#x4E3A;&#x559C;&#x6B22;A&#x800C;&#x5728;&#x6211;&#x8FD9;&#x91CC;&#x548C;&#x6211;&#x8BF4;B&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x5C31;&#x771F;&#x7684;&#x662F;&#x4E09;&#x89C2;&#x4E0D;&#x5408;&#x5566;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5174;&#x8DA3;&#x5339;&#x914D;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x7537;&#x5973;&#x670B;&#x53CB;&#x6216;&#x8005;&#x60C5;&#x4FA3;&#x4E4B;&#x95F4;&#xFF0C;&#x603B;&#x4E4B;&#x4EBA;&#x4E0E;&#x4EBA;&#x76F8;&#x5904;&#x561B;&#xFF0C;&#x771F;&#x8BDA;&#x548C;&#x4E92;&#x76F8;&#x5C0A;&#x91CD;&#x662F;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixbgepihj20hs0dcjrn.jpg" alt="&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x60C5;&#x611F;&#x5206;&#x6790;&#x5C55;&#x793A;" title>
                </div>
                <div class="image-caption">&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x60C5;&#x611F;&#x5206;&#x6790;&#x5C55;&#x793A;</div>
            </figure>
<h2 id="&#x597D;&#x53CB;&#x4F4D;&#x7F6E;"><a href="#&#x597D;&#x53CB;&#x4F4D;&#x7F6E;" class="headerlink" title="&#x597D;&#x53CB;&#x4F4D;&#x7F6E;"></a>&#x597D;&#x53CB;&#x4F4D;&#x7F6E;</h2><p>&#x2003;&#x2003;&#x5206;&#x6790;&#x597D;&#x53CB;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x63D0;&#x53D6;Province&#x548C;City&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#x3002;Python&#x4E2D;&#x7684;&#x5730;&#x56FE;&#x53EF;&#x89C6;&#x5316;&#x4E3B;&#x8981;&#x901A;&#x8FC7;Basemap&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x9700;&#x8981;&#x4ECE;&#x56FD;&#x5916;&#x7F51;&#x7AD9;&#x4E0B;&#x8F7D;&#x5730;&#x56FE;&#x4FE1;&#x606F;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7684;&#x4E0D;&#x4FBF;&#x3002;&#x767E;&#x5EA6;&#x7684;<a href="http://echarts.baidu.com/" target="_blank" rel="noopener">ECharts</a>&#x5728;&#x524D;&#x7AEF;&#x4F7F;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x867D;&#x7136;&#x793E;&#x533A;&#x91CC;&#x63D0;&#x4F9B;&#x4E86;<a href="http://pyecharts.org/" target="_blank" rel="noopener">pyecharts</a>&#x9879;&#x76EE;&#xFF0C;&#x53EF;&#x6211;&#x6CE8;&#x610F;&#x5230;&#x56E0;&#x4E3A;&#x653F;&#x7B56;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x76EE;&#x524D;Echarts&#x4E0D;&#x518D;&#x652F;&#x6301;&#x5BFC;&#x51FA;&#x5730;&#x56FE;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x5730;&#x56FE;&#x7684;&#x5B9A;&#x5236;&#x65B9;&#x9762;&#x76EE;&#x524D;&#x4F9D;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x6D41;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#x662F;&#x914D;&#x7F6E;&#x5168;&#x56FD;&#x5404;&#x7701;&#x5E02;&#x7684;JSON&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x91CC;&#x535A;&#x4E3B;&#x4F7F;&#x7528;&#x7684;&#x662F;<a href="https://me.bdp.cn/home.html" target="_blank" rel="noopener">BDP&#x4E2A;&#x4EBA;&#x7248;</a>&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x96F6;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;Python&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;CSV&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x4E0A;&#x4F20;&#x5230;BDP&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x62D6;&#x62FD;&#x5C31;&#x53EF;&#x4EE5;&#x5236;&#x4F5C;&#x53EF;&#x89C6;&#x5316;&#x5730;&#x56FE;&#xFF0C;&#x7B80;&#x76F4;&#x4E0D;&#x80FD;&#x518D;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x5C55;&#x793A;&#x751F;&#x6210;CSV&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">analyseLocation</span><span class="params">(friends)</span>:</span></span><br><span class="line">    headers = [<span class="string">&apos;NickName&apos;</span>,<span class="string">&apos;Province&apos;</span>,<span class="string">&apos;City&apos;</span>]</span><br><span class="line">    <span class="keyword">with</span> open(<span class="string">&apos;location.csv&apos;</span>,<span class="string">&apos;w&apos;</span>,encoding=<span class="string">&apos;utf-8&apos;</span>,newline=<span class="string">&apos;&apos;</span>,) <span class="keyword">as</span> csvFile:</span><br><span class="line">        writer = csv.DictWriter(csvFile, headers)</span><br><span class="line">        writer.writeheader()</span><br><span class="line">        <span class="keyword">for</span> friend <span class="keyword">in</span> friends[<span class="number">1</span>:]:</span><br><span class="line">           row = {}</span><br><span class="line">           row[<span class="string">&apos;NickName&apos;</span>] = friend[<span class="string">&apos;NickName&apos;</span>]</span><br><span class="line">           row[<span class="string">&apos;Province&apos;</span>] = friend[<span class="string">&apos;Province&apos;</span>]</span><br><span class="line">           row[<span class="string">&apos;City&apos;</span>] = friend[<span class="string">&apos;City&apos;</span>]</span><br><span class="line">           writer.writerow(row)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x4E0B;&#x56FE;&#x662F;BDP&#x4E2D;&#x751F;&#x6210;&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x5730;&#x7406;&#x5206;&#x5E03;&#x56FE;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF1A;&#x6211;&#x7684;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;&#x5B81;&#x590F;&#x548C;&#x9655;&#x897F;&#x4E24;&#x4E2A;&#x7701;&#x4EFD;&#x3002;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x7684;&#x795E;&#x7ECF;&#x7275;&#x52A8;&#x7740;&#x6BCF;&#x4E00;&#x4E2A;&#x793E;&#x4EA4;&#x5173;&#x7CFB;&#x94FE;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7AED;&#x529B;&#x53BB;&#x4FDD;&#x62A4;&#x7684;&#x90A3;&#x70B9;&#x9690;&#x79C1;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4E2D;&#x4E00;&#x70B9;&#x70B9;&#x5730;&#x6298;&#x5C04;&#x51FA;&#x6765;&#x3002;&#x4EBA;&#x7C7B;&#x6216;&#x8BB8;&#x53EF;&#x4EE5;&#x4E0D;&#x65AD;&#x5730;&#x4F2A;&#x88C5;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x8FD9;&#x4E9B;&#x4ECE;&#x6570;&#x636E;&#x80CC;&#x540E;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#x7684;&#x89C4;&#x5F8B;&#x548C;&#x8054;&#x7CFB;&#x4E0D;&#x4F1A;&#x6B3A;&#x9A97;&#x4EBA;&#x7C7B;&#x3002;&#x6570;&#x5B66;&#x66FE;&#x7ECF;&#x88AB;&#x4EBA;&#x79F0;&#x4E3A;&#x6700;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x5B66;&#x79D1;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x6D3B;&#x4E2D;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x795E;&#x5723;&#x800C;&#x7EAF;&#x7CB9;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5B66;&#x79D1;&#x77E5;&#x8BC6;&#x91CC;&#xFF0C;&#x7ECF;&#x9A8C;&#x516C;&#x5F0F;&#x6C38;&#x8FDC;&#x6BD4;&#x7406;&#x8BBA;&#x516C;&#x5F0F;&#x66F4;&#x4E3A;&#x5E38;&#x7528;&#x3002;&#x53EF;&#x662F;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#xFF0C;&#x4F60;&#x770B;&#xFF0C;&#x8FD9;&#x4E16;&#x754C;&#x5C31;&#x50CF;&#x4E00;&#x53EA;&#x6EF4;&#x6EF4;&#x7B54;&#x7B54;&#x8F6C;&#x52A8;&#x7740;&#x7684;&#x65F6;&#x949F;&#xFF0C;&#x6BCF;&#x4E00;&#x5206;&#x6BCF;&#x4E00;&#x79D2;&#x90FD;&#x662F;&#x4E25;&#x4E1D;&#x5408;&#x7F1D;&#x7684;&#x3002;<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzix8lyfsuj20m80jw74u.jpg" alt="&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x5730;&#x7406;&#x5206;&#x5E03;&#x56FE;" title>
                </div>
                <div class="image-caption">&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x5730;&#x7406;&#x5206;&#x5E03;&#x56FE;</div>
            </figure><p></p>
<h1 id="&#x672C;&#x6587;&#x5C0F;&#x7ED3;"><a href="#&#x672C;&#x6587;&#x5C0F;&#x7ED3;" class="headerlink" title="&#x672C;&#x6587;&#x5C0F;&#x7ED3;"></a>&#x672C;&#x6587;&#x5C0F;&#x7ED3;</h1><p>&#x2003;&#x2003;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x5982;&#x4F55;&#x4E0B;&#x7B14;&#xFF0C;&#x56E0;&#x4E3A;&#x5FAE;&#x4FE1;&#x662F;&#x4E00;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x56FD;&#x6C11;&#x7EA7;&#x522B;&#x7684;&#x5168;&#x6C11;APP&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5FAE;&#x4FE1;&#x7684;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x4ECE;&#x6700;&#x521D;&#x5E95;&#x90E8;Tab&#x7684;&#x6570;&#x76EE;&#x3001;&#x6BCF;&#x4E2A;Tab&#x7684;&#x540D;&#x79F0;&#x3001;&#x201D;&#x53D1;&#x73B0;&#x201D;&#x9875;&#x9762;&#x7684;&#x5B9A;&#x5236;&#x3001;&#x5C0F;&#x7A0B;&#x5E8F;&#x5165;&#x53E3;&#x3001;&#x670B;&#x53CB;&#x5708;&#x5165;&#x53E3;&#x5230;&#x670B;&#x53CB;&#x5708;&#x8BC4;&#x8BBA;&#x7B49;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8BBE;&#x8BA1;&#x7EC6;&#x8282;&#xFF0C;&#x90FD;&#x662F;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x900F;&#x8FC7;&#x4EBA;&#x6027;&#x548C;&#x5FC3;&#x7406;&#x53BB;&#x7814;&#x7A76;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x88AB;&#x4EBA;&#x4EEC;&#x5C01;&#x795E;&#x7684;&#x201D;&#x5F20;&#x5C0F;&#x9F99;&#x201D;&#xFF0C;&#x5728;&#x9762;&#x5BF9;&#x7ED3;&#x6784;&#x6700;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x4E2D;&#x56FD;&#x7528;&#x6237;&#x7FA4;&#x4F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x7684;&#x6F47;&#x6D12;&#x4E2D;&#x4F9D;&#x65E7;&#x4E0D;&#x514D;&#x5145;&#x6EE1;&#x65E0;&#x5948;&#xFF0C;&#x4ECE;&#x5BF9;&#x670B;&#x53CB;&#x5708;&#x7684;&#x7F6E;&#x4E4B;&#x4E0D;&#x7406;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x600E;&#x4E48;&#x505A;&#x90FD;&#x4E0D;&#x4F1A;&#x8BA9;&#x4EBA;&#x6EE1;&#x610F;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x751F;&#x6001;&#x5728;&#x9762;&#x5BF9;&#x5DE8;&#x5927;&#x7684;&#x7528;&#x6237;&#x7FA4;&#x4F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x529F;&#x80FD;&#x7684;&#x589E;&#x51CF;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x6240;&#x8C13;&#x201D;&#x6797;&#x5B50;&#x5927;&#x4E86;&#x4EC0;&#x4E48;&#x9E1F;&#x90FD;&#x6709;&#x201D;&#xFF0C;&#x77E5;&#x4E4E;&#x9762;&#x5BF9;&#x7684;&#x662F;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8425;&#x9500;&#x7C7B;&#x516C;&#x4F17;&#x53F7;&#x5728;&#x4E0D;&#x65AD;&#x6D88;&#x8D39;&#x793E;&#x4F1A;&#x8BDD;&#x9898;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5F15;&#x5BFC;&#x7740;&#x4E00;&#x6279;&#x53C8;&#x4E00;&#x6279;&#x7C89;&#x4E1D;&#x7684;&#x4EF7;&#x503C;&#x53D6;&#x5411;&#xFF0C;&#x4EBA;&#x7C7B;&#x603B;&#x6E34;&#x671B;&#x7740;&#x522B;&#x4EBA;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x4EBA;&#x7C7B;&#x771F;&#x7684;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x5417;&#xFF1F;&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x662F;&#x6211;&#x5BF9;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x53C8;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#xFF0C;&#x4E3B;&#x8981;&#x4ECE;&#x6027;&#x522B;&#x3001;&#x5934;&#x50CF;&#x3001;&#x7B7E;&#x540D;&#x3001;&#x4F4D;&#x7F6E;&#x56DB;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x5BF9;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x4E3B;&#x8981;&#x91C7;&#x7528;&#x56FE;&#x8868;&#x548C;&#x8BCD;&#x4E91;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x6765;&#x5448;&#x73B0;&#x7ED3;&#x679C;&#x3002;&#x603B;&#x800C;&#x8A00;&#x4E4B;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201D;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x662F;&#x624B;&#x6BB5;&#x800C;&#x5E76;&#x975E;&#x76EE;&#x7684;&#x201D;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x505A;&#x4E86;&#x8FD9;&#x4E9B;&#x56FE;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x8FD9;&#x4E9B;&#x56FE;&#x91CC;&#x53CD;&#x6620;&#x51FA;&#x6765;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#x672C;&#x8D28;&#x4E0A;&#x7684;&#x542F;&#x793A;&#xFF0C;&#x6211;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x4EC0;&#x4E48;&#x90FD;&#x60F3;&#x6293;&#x53D6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x554A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x61C2;&#x4EBA;&#x7C7B;&#x554A;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/1329254441/">使用Python生成博客目录并自动更新README</a></li><li><a href="https://qinyuanpei.github.io/posts/3444626340/">博客图片迁移折腾记</a></li><li><a href="https://qinyuanpei.github.io/posts/2822230423/">基于Python实现Windows下壁纸切换功能</a></li><li><a href="http://www.huweihuang.com/article/python/basics/python-advanced-features/">[Python] Python系列（三）之高级特性</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2805694118/" rel="external">基于Python实现的微信好友数据分析</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2805694118/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2805694118/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Python/">Python</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Wechat/">Wechat</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/matplotlib/">matplotlib</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2805694118/&title=《基于Python实现的微信好友数据分析》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2805694118/&title=《基于Python实现的微信好友数据分析》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2805694118/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《基于Python实现的微信好友数据分析》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2805694118/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2805694118/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1113828794/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">基于Travis CI实现 Hexo 在 Github 和 Coding 的同步部署</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1329254441/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">使用Python生成博客目录并自动更新README</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2805694118/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2805694118/&title=《基于Python实现的微信好友数据分析》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2805694118/&title=《基于Python实现的微信好友数据分析》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2805694118/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《基于Python实现的微信好友数据分析》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2805694118/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2805694118/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2805694118/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
