<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        时间如灰烬般遥远 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;春天，常常是万物复苏的日子，是以这段时间喜欢去各种地方赏花阅景。相比起三月中旬里裹挟着清冷的青龙寺，此刻到处人山人海的景象，仿佛洋溢着某种热闹的气息。从前读朱自清的《荷塘月色》，一直不明白“热闹是他们的，我什么都没有”这句话该做何解。当你面对梨花胜雪、桃花人面的景致的时候，心中却是如灰烬一般孤独的时候，大概终于明白，为何在熙熙攘攘的人群中会感到一丝清冷，因为唯有行走在人群里">
<meta name="keywords" content="心情,孤独,别离">
<meta property="og:type" content="article">
<meta property="og:title" content="时间如灰烬般遥远">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1357715684/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;春天，常常是万物复苏的日子，是以这段时间喜欢去各种地方赏花阅景。相比起三月中旬里裹挟着清冷的青龙寺，此刻到处人山人海的景象，仿佛洋溢着某种热闹的气息。从前读朱自清的《荷塘月色》，一直不明白“热闹是他们的，我什么都没有”这句话该做何解。当你面对梨花胜雪、桃花人面的景致的时候，心中却是如灰烬一般孤独的时候，大概终于明白，为何在熙熙攘攘的人群中会感到一丝清冷，因为唯有行走在人群里">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="时间如灰烬般遥远">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;春天，常常是万物复苏的日子，是以这段时间喜欢去各种地方赏花阅景。相比起三月中旬里裹挟着清冷的青龙寺，此刻到处人山人海的景象，仿佛洋溢着某种热闹的气息。从前读朱自清的《荷塘月色》，一直不明白“热闹是他们的，我什么都没有”这句话该做何解。当你面对梨花胜雪、桃花人面的景致的时候，心中却是如灰烬一般孤独的时候，大概终于明白，为何在熙熙攘攘的人群中会感到一丝清冷，因为唯有行走在人群里">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">时间如灰烬般遥远</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">时间如灰烬般遥远</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-04-03T00:25:21.000Z" itemprop="datePublished" class="page-time">
  2017-04-03
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-时间如灰烬般遥远" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">时间如灰烬般遥远</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-04-03 00:25:21" datetime="2017-04-03T00:25:21.000Z" itemprop="datePublished">2017-04-03</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        11 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6625;&#x5929;&#xFF0C;&#x5E38;&#x5E38;&#x662F;&#x4E07;&#x7269;&#x590D;&#x82CF;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x662F;&#x4EE5;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x559C;&#x6B22;&#x53BB;&#x5404;&#x79CD;&#x5730;&#x65B9;&#x8D4F;&#x82B1;&#x9605;&#x666F;&#x3002;&#x76F8;&#x6BD4;&#x8D77;&#x4E09;&#x6708;&#x4E2D;&#x65EC;&#x91CC;&#x88F9;&#x631F;&#x7740;&#x6E05;&#x51B7;&#x7684;&#x9752;&#x9F99;&#x5BFA;&#xFF0C;&#x6B64;&#x523B;&#x5230;&#x5904;&#x4EBA;&#x5C71;&#x4EBA;&#x6D77;&#x7684;&#x666F;&#x8C61;&#xFF0C;&#x4EFF;&#x4F5B;&#x6D0B;&#x6EA2;&#x7740;&#x67D0;&#x79CD;&#x70ED;&#x95F9;&#x7684;&#x6C14;&#x606F;&#x3002;&#x4ECE;&#x524D;&#x8BFB;&#x6731;&#x81EA;&#x6E05;&#x7684;&#x300A;&#x8377;&#x5858;&#x6708;&#x8272;&#x300B;&#xFF0C;&#x4E00;&#x76F4;&#x4E0D;&#x660E;&#x767D;&#x201C;&#x70ED;&#x95F9;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#xFF0C;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x201D;&#x8FD9;&#x53E5;&#x8BDD;&#x8BE5;&#x505A;&#x4F55;&#x89E3;&#x3002;&#x5F53;&#x4F60;&#x9762;&#x5BF9;&#x68A8;&#x82B1;&#x80DC;&#x96EA;&#x3001;&#x6843;&#x82B1;&#x4EBA;&#x9762;&#x7684;&#x666F;&#x81F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x4E2D;&#x5374;&#x662F;&#x5982;&#x7070;&#x70EC;&#x4E00;&#x822C;&#x5B64;&#x72EC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x6982;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#xFF0C;&#x4E3A;&#x4F55;&#x5728;&#x7199;&#x7199;&#x6518;&#x6518;&#x7684;&#x4EBA;&#x7FA4;&#x4E2D;&#x4F1A;&#x611F;&#x5230;&#x4E00;&#x4E1D;&#x6E05;&#x51B7;&#xFF0C;&#x56E0;&#x4E3A;&#x552F;&#x6709;&#x884C;&#x8D70;&#x5728;&#x4EBA;&#x7FA4;&#x91CC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x4F60;&#x4E00;&#x4E2A;&#x4EBA;&#x8D70;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x3002;&#x5929;&#x5730;&#x95F4;&#x4E07;&#x4E8B;&#x4E07;&#x7269;&#x66F4;&#x8FED;&#x4EA4;&#x66FF;&#xFF0C;&#x672C;&#x6765;&#x662F;&#x81EA;&#x7136;&#x754C;&#x4E2D;&#x6700;&#x666E;&#x901A;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x662F;&#x5982;&#x679C;&#x6BCF;&#x5E74;&#x7684;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x770B;&#x8FD9;&#x5C71;&#x5C71;&#x6C34;&#x6C34;&#xFF0C;&#x76F8;&#x6BD4;&#x65F6;&#x7A7A;&#x4E0A;&#x7684;&#x5B64;&#x5BC2;&#x611F;&#xFF0C;&#x4EBA;&#x7684;&#x5B64;&#x5BC2;&#x611F;&#x4F1A;&#x66F4;&#x4E3A;&#x5F3A;&#x70C8;&#xFF0C;&#x201C;&#x826F;&#x8FB0;&#x7F8E;&#x666F;&#x5948;&#x4F55;&#x5929;&#xFF0C;&#x8D4F;&#x5FC3;&#x4E50;&#x4E8B;&#x8C01;&#x5BB6;&#x9662;&#x201D;&#xFF0C;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#x518D;&#x7EB7;&#x7E41;&#x591A;&#x53D8;&#xFF0C;&#x5BF9;&#x4F60;&#x800C;&#x8A00;&#x4E0D;&#x8FC7;&#x662F;&#x6D3B;&#x7740;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x6211;&#x5E38;&#x5E38;&#x50CF;&#x4E00;&#x4E2A;&#x6DE1;&#x6F20;&#x4E16;&#x60C5;&#x7684;&#x8DEF;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x90FD;&#x548C;&#x6211;&#x65E0;&#x5173;&#xFF0C;&#x8DEF;&#x4EBA;&#x7EB7;&#x7EB7;&#x6210;&#x53CC;&#x5165;&#x5BF9;&#xFF0C;&#x800C;&#x6211;&#x4F9D;&#x7136;&#x5B51;&#x7136;&#x4E00;&#x8EAB;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x6BCF;&#x5929;&#x4F60;&#x4F1A;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#xFF0C;&#x53EF;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5728;&#x5FD9;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x548C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x606F;&#x606F;&#x76F8;&#x5173;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x548C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6BEB;&#x65E0;&#x5173;&#x8054;&#x3002;&#x6211;&#x8BB0;&#x5F97;&#x5468;&#x4E94;&#x6211;&#x5E2E;Kent&#x529E;&#x7406;&#x79BB;&#x804C;&#x624B;&#x7EED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x4ECE;&#x4E03;&#x697C;&#x5230;&#x5341;&#x4E09;&#x697C;&#x518D;&#x5230;&#x5341;&#x516D;&#x697C;&#xFF0C;&#x53CD;&#x590D;&#x5730;&#x5954;&#x6CE2;&#x7740;&#x3002;&#x540C;&#x4E8B;&#x8BA9;&#x4ED6;&#x5E2E;&#x5FD9;&#x5411;&#x516C;&#x53F8;&#x5F52;&#x8FD8;&#x4E00;&#x53F0;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x53F0;&#x7B14;&#x8BB0;&#x672C;&#x8BA9;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x90FD;&#x5145;&#x6EE1;&#x4E86;&#x843D;&#x5BDE;&#x611F;&#x3002;&#x90E8;&#x95E8;&#x4E0E;&#x90E8;&#x95E8;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x63A8;&#x8131;&#xFF0C;&#x540C;&#x4E8B;&#x4E0E;&#x540C;&#x4E8B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x63A8;&#x8BFF;&#xFF0C;&#x8BA9;&#x6211;&#x611F;&#x5230;&#x4ECE;&#x672A;&#x6709;&#x8FC7;&#x7684;&#x7A92;&#x606F;&#x611F;&#xFF1A;&#x6709;&#x4E00;&#x7FA4;&#x4EBA;&#x6BCF;&#x5929;&#x90FD;&#x5750;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x770B;&#x8D77;&#x6765;&#x5728;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x4F60;&#x771F;&#x6B63;&#x9700;&#x8981;&#x5E2E;&#x52A9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6307;&#x671B;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x6216;&#x8BB8;&#x8FD9;&#x548C;&#x6211;&#x5916;&#x51B7;&#x5185;&#x70ED;&#x7684;&#x6027;&#x683C;&#x6709;&#x5173;&#xFF0C;&#x53EF;&#x662F;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x597D;&#x60F3;&#x79BB;&#x5F00;&#x90A3;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7EC4;&#x91CC;&#x7684;&#x4EBA;&#x90FD;&#x8D70;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x5566;&#xFF0C;&#x73B0;&#x4E0B;&#x7EC8;&#x4E8E;&#x5269;&#x4E0B;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x81EA;&#x6B64;&#x9879;&#x76EE;&#x4E0A;&#x5168;&#x51ED;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E3B;&#xFF0C;&#x53EF;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x5374;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x6B22;&#x559C;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x559C;&#x6B22;&#x548C;&#x5927;&#x5BB6;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x65F6;&#x5E38;&#x8BA9;&#x4ED6;&#x4EEC;&#x751F;&#x6C14;&#xFF0C;&#x50CF;&#x4E2A;&#x5B69;&#x5B50;&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4F60;&#x77E5;&#x9053;&#x6211;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x65E0;&#x7406;&#x53D6;&#x95F9;&#x7684;&#x3002;&#x300E;&#x5C04;&#x96D5;&#x82F1;&#x96C4;&#x4F20;&#x300F;&#x6211;&#x770B;&#x4E86;&#x4E0D;&#x4E0B;&#x5341;&#x904D;&#xFF0C;&#x4E16;&#x4EBA;&#x90FD;&#x9053;&#x4E1C;&#x90AA;&#x9EC4;&#x836F;&#x5E08;&#x884C;&#x4E8B;&#x4E56;&#x5F20;&#x3001;&#x72C2;&#x50B2;&#x4E0D;&#x7F81;&#xFF0C;&#x53EF;&#x4ED6;&#x5BF9;&#x59BB;&#x5B50;&#x51AF;&#x8605;&#x7684;&#x6DF1;&#x60C5;&#x4E16;&#x95F4;&#x8C01;&#x4EBA;&#x80FD;&#x53CA;&#xFF0C;&#x591C;&#x591C;&#x7B19;&#x7BAB;&#x76F8;&#x4F34;&#x5893;&#x524D;&#xFF0C;&#x6253;&#x9020;&#x82B1;&#x8239;&#x8D74;&#x6B7B;&#x6CA7;&#x6F9C;&#xFF0C;&#x53CA;&#x95FB;&#x7231;&#x5973;&#x846C;&#x8EAB;&#x5927;&#x6D77;&#xFF0C;&#x60B2;&#x75DB;&#x4E4B;&#x9645;&#x4EE5;&#x7389;&#x7BAB;&#x6263;&#x8237;&#x800C;&#x6B4C;&#xFF0C;&#x5176;&#x6DF1;&#x60C5;&#x4EA6;&#x5982;&#x6B64;&#x3002;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x50CF;&#x4E2A;&#x5B69;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x957F;&#x5927;&#x3002;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x770B;&#x97E9;&#x5BD2;&#x7684;&#x7535;&#x5F71;&#x300A;&#x4E58;&#x98CE;&#x7834;&#x6D6A;&#x300B;&#xFF0C;&#x7535;&#x5F71;&#x7684;&#x4E3B;&#x9898;&#x66F2;&#x4ECE;&#x53D1;&#x5E03;&#x5C31;&#x88AB;&#x4EBA;&#x5410;&#x69FD;&#x76F4;&#x7537;&#x764C;&#xFF0C;&#x5176;&#x5B9E;&#x90A3;&#x4EC5;&#x4EC5;&#x662F;&#x4E08;&#x592B;&#x5728;&#x59BB;&#x5B50;&#x9762;&#x524D;&#x201C;&#x6492;&#x5A07;&#x201D;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x6709;&#x53E5;&#x8BDD;&#x8BF4;&#x300E;&#x5728;&#x4F60;&#x8EAB;&#x8FB9;&#x6211;&#x662F;&#x4E2A;&#x5B69;&#x5B50;&#xFF0C;&#x53EF;&#x4F60;&#x9700;&#x8981;&#x4E86;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x65E0;&#x575A;&#x4E0D;&#x6467;&#x7684;&#x52C7;&#x58EB;&#x300F;&#xFF0C;&#x4EBA;&#x4EBA;&#x90FD;&#x5728;&#x8BF4;&#x60C5;&#x5546;&#x5982;&#x4F55;&#x5982;&#x4F55;&#x91CD;&#x8981;&#xFF0C;&#x53EF;&#x5728;&#x771F;&#x6027;&#x60C5;&#x9762;&#x524D;&#x5B83;&#x7684;&#x786E;&#x6709;&#x70B9;&#x865A;&#x4F2A;&#x3002;</p>
<p>&#x2003;&#x2003;Kent&#x662F;&#x5750;&#x5468;&#x4E94;&#x665A;&#x4E0A;&#x7684;&#x706B;&#x8F66;&#x79BB;&#x5F00;&#xFF0C;&#x665A;&#x4E0A;&#x4E24;&#x4E2A;&#x4EBA;&#x4E00;&#x5757;&#x513F;&#x5403;&#x996D;&#xFF0C;&#x804A;&#x5230;&#x4E86;&#x5BB6;&#x91CC;&#x7684;&#x7410;&#x4E8B;&#xFF0C;&#x804A;&#x5230;&#x4E86;&#x5DE5;&#x4F5C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x552F;&#x72EC;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x79BB;&#x522B;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x6211;&#x4E0D;&#x613F;&#x610F;&#x8BF4;&#x8D77;&#x3002;&#x7ED3;&#x8D26;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x62A2;&#x7740;&#x4ED8;&#x94B1;&#xFF0C;&#x8001;&#x677F;&#x5A18;&#x7B11;&#x7740;&#x8BF4;&#x4E24;&#x4E2A;&#x4EBA;&#x8C01;&#x4ED8;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x53CD;&#x6B63;&#x4EE5;&#x540E;&#x8FD8;&#x6709;&#x7684;&#x662F;&#x673A;&#x4F1A;&#x3002;&#x53EF;&#x662F;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#x6709;&#x8C01;&#x80FD;&#x591F;&#x8BF4;&#x5F97;&#x51C6;&#x5462;&#xFF1F;&#x6216;&#x8BB8;&#x671F;&#x671B;&#x8D8A;&#x9AD8;&#xFF0C;&#x5931;&#x671B;&#x5C31;&#x8D8A;&#x5927;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x7B54;&#x5E94;&#x4E86;&#x5979;&#x8BB8;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x5E38;&#x5E38;&#x5728;&#x8111;&#x6D77;&#x91CC;&#x60F3;&#x8D77;&#xFF0C;&#x5979;&#x73B0;&#x5728;&#x90FD;&#x4E0D;&#x4F1A;&#x5728;&#x4E4E;&#x4E86;&#x5427;&#x3002;&#x53EF;&#x6211;&#x603B;&#x662F;&#x5F88;&#x6000;&#x5FF5;&#x90A3;&#x4E9B;&#x65E5;&#x5B50;&#xFF0C;&#x5728;&#x8FD9;&#x4E16;&#x4E0A;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x7ED8;&#x753B;&#x3001;&#x821E;&#x8E48;&#x3001;&#x8BD7;&#x6587;&#x3001;&#x4E66;&#x6CD5;&#x65E0;&#x6240;&#x4E0D;&#x901A;&#xFF0C;&#x6211;&#x5982;&#x679C;&#x80FD;&#x5B66;&#x4F1A;&#x5439;&#x594F;&#x6D1E;&#x7BAB;&#xFF0C;&#x4E3A;&#x5979;&#x8DF3;&#x821E;&#x65F6;&#x4F34;&#x594F;&#x4E00;&#x66F2;&#x53EF;&#x597D;&#xFF1F;&#x4EBA;&#x751F;&#x76F8;&#x8BC6;&#x4E0D;&#x6613;&#xFF0C;&#x6216;&#x8BB8;&#x4E0D;&#x662F;&#x6211;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x8BA4;&#x8BC6;&#x522B;&#x4EBA;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x77E5;&#x9053;&#x77E5;&#x97F3;&#x96BE;&#x89C5;&#x3001;&#x77E5;&#x5DF1;&#x96BE;&#x6C42;&#xFF0C;&#x5F97;&#x4E0D;&#x5230;&#x7684;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;&#x5BF9;Kent&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x6709;&#x6839;&#x53EF;&#x5BFB;&#xFF0C;&#x56DE;&#x53BB;&#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x800C;&#x6211;&#x5219;&#x662F;&#x65E0;&#x6839;&#x67AF;&#x84EC;&#xFF0C;&#x98CE;&#x5439;&#x5230;&#x54EA;&#x91CC;&#x5C31;&#x5728;&#x54EA;&#x91CC;&#x3002;&#x6211;&#x77E5;&#x9053;&#x6211;&#x518D;&#x96BE;&#x9047;&#x89C1;&#x90A3;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4EBA;&#x751F;&#x4E0E;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x79BB;&#x522B;&#x603B;&#x662F;&#x5E38;&#x6001;&#xFF0C;&#x5B64;&#x72EC;&#x662F;&#x79CD;&#x7EDD;&#x75C7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;Kent&#x8BF4;&#x5F97;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x771F;&#x6B63;&#x770B;&#x91CD;&#x6280;&#x672F;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x666E;&#x901A;&#x5982;&#x4F60;&#x6211;&#x7684;&#x4EBA;&#xFF0C;&#x65E0;&#x4E00;&#x4E0D;&#x5728;&#x505A;&#x7740;&#x666E;&#x901A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5BFB;&#x627E;&#x4E00;&#x5BB6;&#x65B0;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x5BF9;&#x76EE;&#x524D;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x4EF6;&#x6781;&#x5177;&#x6311;&#x6218;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x867D;&#x7136;&#x90B9;&#x8001;&#x5E08;&#x6700;&#x540E;&#x5E2E;&#x6211;&#x63A8;&#x8350;&#x4E86;&#x7B80;&#x5386;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x5E76;&#x6CA1;&#x6709;&#x9002;&#x5408;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x79CD;&#x5904;&#x5883;&#x65E2;&#x5371;&#x9669;&#x800C;&#x56F0;&#x7A98;&#xFF0C;&#x6211;&#x4E0D;&#x80FD;&#x518D;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8BA9;&#x81EA;&#x5DF1;&#x62E5;&#x6709;&#x81EA;&#x4FE1;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x7231;&#x81EA;&#x5DF1;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x80FD;&#x591F;&#x505A;&#x5230;&#x7231;&#x522B;&#x4EBA;&#x5462;&#xFF1F;&#x53EF;&#x5979;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x518D;&#x51FA;&#x73B0;&#x4E86;&#xFF0C;&#x770B;&#x5230;&#x8DEF;&#x4EBA;&#x6210;&#x53CC;&#x5165;&#x5BF9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6216;&#x8BB8;&#x7231;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x662F;&#x4EF6;&#x592A;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F5B;&#x95E8;&#x6709;&#x201C;&#x8D2A;&#x55D4;&#x75F4;&#x201D;&#x4E09;&#x6212;&#xFF0C;&#x6C42;&#x800C;&#x4E0D;&#x5F97;&#x662F;&#x4E3A;&#x6267;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5B64;&#x96F6;&#x96F6;&#x5730;&#x5728;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x91CC;&#xFF0C;&#x4ECE;&#x660E;&#x5929;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4F1A;&#x7ECF;&#x5386;&#x66F4;&#x591A;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5403;&#x996D;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x6E38;&#x66F3;&#x2026;&#x2026;&#x957F;&#x591C;&#x542C;&#x96E8;&#xFF0C;&#x81EA;&#x4ECA;&#x65E5;&#x59CB;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x4EBA;&#x6570;&#x6885;&#x82B1;&#x8BE5;&#x662F;&#x4F55;&#x7B49;&#x7684;&#x5BC2;&#x5BDE;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x4EBA;&#x542C;&#x96E8;&#x6EF4;&#x4E0B;&#x8BE5;&#x662F;&#x4F55;&#x7B49;&#x7684;&#x5B64;&#x72EC;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x662F;&#x6CA1;&#x6709;&#x533A;&#x522B;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x5728;B&#x7AD9;&#x4E0A;&#x770B;&#x4EE5;&#x524D;&#x7684;&#x5F71;&#x89C6;&#x5267;&#xFF0C;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x4E00;&#x5207;&#x90FD;&#x5DF2;&#x7136;&#x8FC7;&#x53BB;&#x90A3;&#x4E48;&#x4E45;&#x3002;&#x53EF;&#x5F53;&#x65F6;&#x7684;&#x5FC3;&#x6027;&#x5374;&#x4E0D;&#x518D;&#x56DE;&#x590D;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x65E0;&#x9650;&#x7684;&#x56DE;&#x60F3;&#xFF0C;&#x4EBA;&#x751F;&#x603B;&#x662F;&#x5982;&#x6B64;&#x5306;&#x5FD9;&#x7684;&#x522B;&#x79BB;&#xFF0C;&#x4F60;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x8BA4;&#x8BC6;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x9519;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x5149;&#x5F71;&#x604D;&#x60DA;&#x95F4;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4EFF;&#x4F5B;&#x662F;&#x65F6;&#x95F4;&#x7684;&#x7070;&#x70EC;&#x722C;&#x4E0A;&#x4E86;&#x955C;&#x5B50;&#xFF0C;&#x8FD9;&#x50CF;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6216;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x4E16;&#x4E8B;&#x65E0;&#x5E38;&#xFF0C;&#x5982;&#x767D;&#x4E91;&#x82CD;&#x72D7;&#xFF1B;&#x6216;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x4EBA;&#x751F;&#x4E0D;&#x89C1;&#xFF0C;&#x52A8;&#x5982;&#x53C2;&#x5546;&#x2026;&#x2026;&#x65F6;&#x95F4;&#x554A;&#xFF0C;&#x50CF;&#x6781;&#x4E86;&#x722C;&#x6EE1;&#x7A97;&#x53F0;&#x7684;&#x7070;&#x70EC;&#xFF0C;&#x6211;&#x5374;&#x8FD8;&#x60E6;&#x5FF5;&#x7740;&#x7A97;&#x53F0;&#x5916;&#x7684;&#x722C;&#x5C71;&#x864E;&#x2026;&#x2026;</p>
<p>Payne, &#x4E8E;4&#x6708;3&#x65E5;&#x591C;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://leburger.gitlab.io/blog/posts/2418c5e7/">關於部落格這檔事</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1357715684/" rel="external">时间如灰烬般遥远</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1357715684/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1357715684/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/别离/">别离</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/孤独/">孤独</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/心情/">心情</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1357715684/&title=《时间如灰烬般遥远》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1357715684/&title=《时间如灰烬般遥远》 — PayneQinのBlog&source=&emsp;&emsp;春天，常常是万物复苏的日子，是以这段时间喜欢去各种地方赏花阅景。相比起三月中旬里裹挟着清冷的青龙寺，此刻到处人山人海的景象，仿佛洋..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1357715684/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《时间如灰烬般遥远》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1357715684/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1357715684/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/335366821/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">Redis缓存技术学习系列之事务处理</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3032366281/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Redis缓存技术学习系列之邂逅Redis</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1357715684/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1357715684/&title=《时间如灰烬般遥远》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1357715684/&title=《时间如灰烬般遥远》 — PayneQinのBlog&source=&emsp;&emsp;春天，常常是万物复苏的日子，是以这段时间喜欢去各种地方赏花阅景。相比起三月中旬里裹挟着清冷的青龙寺，此刻到处人山人海的景象，仿佛洋..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1357715684/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《时间如灰烬般遥远》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1357715684/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1357715684/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1357715684/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
