<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        你了解爱的艺术吗？ - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;或许我不是一个懂得如何去爱人的人，我时常陷入一种自我否定的焦虑当中，当我发觉自己喜欢上一个人的时候，从某种意义上它会让我身上的缺点被无情地放大，我并不畏惧在喜欢的人面前暴露这些缺点，因为这就是真实的我，因此我从来不喜欢去塑造别人，让别人成为我心目中期待的样子，可是我会忍不住去塑造我自己，尤其是在和别人相处的过程中，发现我身上的缺点或者问题的时候，我习惯了对自我严格，虽然我知">
<meta name="keywords" content="爱情,读书,Kindle">
<meta property="og:type" content="article">
<meta property="og:title" content="你了解爱的艺术吗？">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2275646954/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;或许我不是一个懂得如何去爱人的人，我时常陷入一种自我否定的焦虑当中，当我发觉自己喜欢上一个人的时候，从某种意义上它会让我身上的缺点被无情地放大，我并不畏惧在喜欢的人面前暴露这些缺点，因为这就是真实的我，因此我从来不喜欢去塑造别人，让别人成为我心目中期待的样子，可是我会忍不住去塑造我自己，尤其是在和别人相处的过程中，发现我身上的缺点或者问题的时候，我习惯了对自我严格，虽然我知">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="你了解爱的艺术吗？">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;或许我不是一个懂得如何去爱人的人，我时常陷入一种自我否定的焦虑当中，当我发觉自己喜欢上一个人的时候，从某种意义上它会让我身上的缺点被无情地放大，我并不畏惧在喜欢的人面前暴露这些缺点，因为这就是真实的我，因此我从来不喜欢去塑造别人，让别人成为我心目中期待的样子，可是我会忍不住去塑造我自己，尤其是在和别人相处的过程中，发现我身上的缺点或者问题的时候，我习惯了对自我严格，虽然我知">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">你了解爱的艺术吗？</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">你了解爱的艺术吗？</h1>
        <h5 class="subtitle">
            
                <time datetime="2016-09-24T22:42:44.000Z" itemprop="datePublished" class="page-time">
  2016-09-24
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-你了解爱的艺术吗？" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">你了解爱的艺术吗？</h1>
        <div class="post-meta">
            <time class="post-time" title="2016-09-24 22:42:44" datetime="2016-09-24T22:42:44.000Z" itemprop="datePublished">2016-09-24</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        18 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x6211;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x53BB;&#x7231;&#x4EBA;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x65F6;&#x5E38;&#x9677;&#x5165;&#x4E00;&#x79CD;&#x81EA;&#x6211;&#x5426;&#x5B9A;&#x7684;&#x7126;&#x8651;&#x5F53;&#x4E2D;&#xFF0C;&#x5F53;&#x6211;&#x53D1;&#x89C9;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x4E0A;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x5B83;&#x4F1A;&#x8BA9;&#x6211;&#x8EAB;&#x4E0A;&#x7684;&#x7F3A;&#x70B9;&#x88AB;&#x65E0;&#x60C5;&#x5730;&#x653E;&#x5927;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x754F;&#x60E7;&#x5728;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x9762;&#x524D;&#x66B4;&#x9732;&#x8FD9;&#x4E9B;&#x7F3A;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5C31;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x6211;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x559C;&#x6B22;&#x53BB;&#x5851;&#x9020;&#x522B;&#x4EBA;&#xFF0C;&#x8BA9;&#x522B;&#x4EBA;&#x6210;&#x4E3A;&#x6211;&#x5FC3;&#x76EE;&#x4E2D;&#x671F;&#x5F85;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4F1A;&#x5FCD;&#x4E0D;&#x4F4F;&#x53BB;&#x5851;&#x9020;&#x6211;&#x81EA;&#x5DF1;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x548C;&#x522B;&#x4EBA;&#x76F8;&#x5904;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53D1;&#x73B0;&#x6211;&#x8EAB;&#x4E0A;&#x7684;&#x7F3A;&#x70B9;&#x6216;&#x8005;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E60;&#x60EF;&#x4E86;&#x5BF9;&#x81EA;&#x6211;&#x4E25;&#x683C;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6CE8;&#x5B9A;&#x75DB;&#x82E6;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x80FD;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x7231;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x7231;&#x4E0D;&#x8DB3;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x6539;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x7A76;&#x7ADF;&#x662F;&#x4E00;&#x4E2A;&#x600E;&#x6837;&#x7684;&#x81EA;&#x5DF1;&#x3001;&#x600E;&#x6837;&#x7684;&#x522B;&#x4EBA;&#xFF1F;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x5F17;&#x6D1B;&#x59C6;&#x8FD9;&#x672C;&#x300A;&#x7231;&#x7684;&#x827A;&#x672F;&#x300B;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x4E3A;&#x81EA;&#x5DF1;&#x6311;&#x9009;&#x7684;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x5728;&#x6211;&#x4E70;&#x4E86;Kindle&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x6211;&#x7684;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x5728;&#x770B;&#x4E66;&#x548C;&#x5B66;&#x4E60;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x786E;&#x5F88;&#x559C;&#x6B22;&#x8BFB;&#x4E66;&#xFF0C;&#x800C;&#x6211;&#x8FD9;&#x79CD;&#x7406;&#x6027;&#x7684;&#x6027;&#x683C;&#x6709;&#x65F6;&#x5019;&#x96BE;&#x514D;&#x8BA9;&#x4EBA;&#x8BA8;&#x538C;&#xFF0C;&#x6240;&#x4EE5;&#x8BFB;&#x4E66;&#x7279;&#x522B;&#x662F;&#x9009;&#x62E9;&#x53BB;&#x8BFB;&#x4EBA;&#x6587;&#x7C7B;&#x4E66;&#x7C4D;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#x6211;&#x5728;&#x523B;&#x610F;&#x5730;&#x7A00;&#x91CA;&#x8FD9;&#x79CD;&#x7406;&#x6027;&#x601D;&#x7EF4;&#x9020;&#x6210;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x300A;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x300B;&#x91CC;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x806A;&#x660E;&#x4EBA;&#x4E0D;&#x88AB;&#x5468;&#x56F4;&#x4EBA;&#x559C;&#x6B22;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6BD4;&#x5468;&#x56F4;&#x4EBA;&#x806A;&#x660E;&#xFF0C;&#x5F53;&#x8C08;&#x604B;&#x7231;&#x8D8A;&#x53D1;&#x5730;&#x88AB;&#x4EBA;&#x4EEC;&#x6539;&#x9020;&#x6210;&#x4E00;&#x79CD;&#x5957;&#x8DEF;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x7231;&#x7684;&#x5B9A;&#x4E49;&#x6216;&#x8BB8;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x6A21;&#x7CCA;&#xFF0C;&#x53EF;&#x662F;&#x7231;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5927;&#x81EA;&#x7136;&#x95F4;&#x666E;&#x904D;&#x5B58;&#x5728;&#x7684;&#x60C5;&#x611F;&#xFF0C;&#x6211;&#x575A;&#x4FE1;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x539F;&#x59CB;&#x800C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F17;&#x6D1B;&#x59C6;&#x8BA4;&#x4E3A;&#xFF0C;&#x7231;&#x60C5;&#x662F;&#x5BF9;&#x4EBA;&#x7C7B;&#x751F;&#x5B58;&#x95EE;&#x9898;&#x7684;&#x56DE;&#x7B54;&#xFF0C;&#x4EBA;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x9010;&#x6E10;&#x610F;&#x8BC6;&#x5230;&#x751F;&#x4E0D;&#x7531;&#x5DF1;&#x3001;&#x610F;&#x8BC6;&#x5230;&#x6B7B;&#x7684;&#x5FC5;&#x7136;&#x3001;&#x610F;&#x8BC6;&#x5230;&#x5B64;&#x72EC;&#x548C;&#x4E0E;&#x4E16;&#x9694;&#x7EDD;&#x3001;&#x610F;&#x8BC6;&#x5230;&#x9762;&#x5BF9;&#x793E;&#x4F1A;&#x548C;&#x81EA;&#x7136;&#x7684;&#x5A01;&#x529B;&#x65F6;&#x7684;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6240;&#x6709;&#x751F;&#x6D3B;&#x5728;&#x4E0D;&#x540C;&#x6587;&#x5316;&#x548C;&#x65F6;&#x4EE3;&#x91CC;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x9762;&#x4E34;&#x7740;&#x4E00;&#x4E2A;&#x540C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#xFF1A;&#x5982;&#x4F55;&#x514B;&#x670D;&#x8FD9;&#x79CD;&#x5B64;&#x72EC;&#x611F;&#x3002;&#x53E4;&#x4EBA;&#x8BF4;&#x201C;&#x53E4;&#x6765;&#x5723;&#x8D24;&#x7686;&#x5BC2;&#x5BDE;&#xFF0C;&#x552F;&#x6709;&#x996E;&#x8005;&#x7559;&#x5176;&#x540D;&#x201D;&#xFF0C;&#x5176;&#x5B9E;&#x4F55;&#x6B62;&#x662F;&#x53E4;&#x6765;&#x5723;&#x8D24;&#xFF0C;&#x6211;&#x4EEC;&#x751F;&#x6D3B;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x7403;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x4EBA;&#xFF0C;&#x4ECE;&#x51FA;&#x751F;&#x5230;&#x6B7B;&#x4EA1;&#x90FD;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x88AB;&#x4E00;&#x79CD;&#x5B64;&#x72EC;&#x611F;&#x5305;&#x56F4;&#x8005;&#xFF0C;&#x66FE;&#x7ECF;&#x548C;&#x522B;&#x4EBA; &#x8BA8;&#x8BBA;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x5BF9;&#x4EBA;&#x60C5;&#x9887;&#x4E3A;&#x6DE1;&#x6F20;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#x9664;&#x4E86;&#x80FD;&#x591F;&#x771F;&#x6B63;&#x5C06;&#x5F7C;&#x6B64;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x4F60;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x771F;&#x6B63;&#x80FD;&#x8BA9;&#x4F60;&#x7075;&#x9B42;&#x7688;&#x4F9D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5E76;&#x975E;&#x662F;&#x7531;&#x8840;&#x7F18;&#x6216;&#x8005;&#x91D1;&#x94B1;&#x8FD9;&#x6837;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x7EF4;&#x7CFB;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5B64;&#x72EC;&#x4E0E;&#x4E00;&#x7FA4;&#x4EBA;&#x7684;&#x5B64;&#x72EC;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x5B87;&#x5B99;&#x95F4;&#x770B;&#x8D77;&#x6765;&#xFF0C;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7231;&#x7684;&#x786E;&#x662F;&#x4E00;&#x95E8;&#x827A;&#x672F;&#xFF0C;&#x53EF;&#x5BF9;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x50CF;&#x662F;&#x67D0;&#x79CD;&#x7F25;&#x7F08;&#x751A;&#x81F3;&#x662F;&#x96BE;&#x4EE5;&#x63E3;&#x6D4B;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x7528;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7406;&#x6027;&#x7684;&#x773C;&#x5149;&#x6765;&#x5BA1;&#x89C6;&#x548C;&#x5B9A;&#x4E49;&#x5B83;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5F17;&#x6D1B;&#x59C6;&#x8BF4;&#xFF1A;&#x201C;&#x4E0D;&#x662F;&#x62E5;&#x6709;&#x8D22;&#x7269;&#x7684;&#x4EBA;&#x662F;&#x5BCC;&#x88D5;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x7ED9;&#x4E88;&#x4ED6;&#x4EBA;&#x4E1C;&#x897F;&#x7684;&#x4EBA;&#x624D;&#x662F;&#x5BCC;&#x88D5;&#x8005;&#x201D;&#xFF0C;&#x53EF;&#x73B0;&#x5B9E;&#x662F;&#x5E76;&#x975E;&#x4F60;&#x4E0D;&#x987E;&#x4E00;&#x5207;&#x5730;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x597D;&#xFF0C;&#x5C31;&#x80FD;&#x8D62;&#x5F97;&#x4E00;&#x4EFD;&#x8BA9;&#x4F60;&#x611F;&#x52A8;&#x7684;&#x7231;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7ECF;&#x5386;&#x8FC7;&#x632B;&#x6298;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4E0D;&#x518D;&#x8003;&#x8651;&#x4E00;&#x5473;&#x5730;&#x7D22;&#x53D6;&#x6216;&#x8005;&#x4ED8;&#x51FA;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x5C06;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EB;&#x505A;&#x5206;&#x4EAB;&#xFF0C;&#x4EBA;&#x4EEC;&#x5728;&#x5206;&#x4EAB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BA4;&#x8BC6;&#x5F7C;&#x6B64;&#x3001;&#x4E30;&#x5BCC;&#x5F7C;&#x6B64;&#x3001;&#x63D0;&#x9AD8;&#x5F7C;&#x6B64;&#x7684;&#x751F;&#x547D;&#x611F;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x7231;&#x60C5;&#x4E2D;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x53BB;&#x6316;&#x6398;&#x7684;&#x4E00;&#x79CD;&#x6F5C;&#x8D28;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x6CA1;&#x6709;&#x751F;&#x547D;&#x529B;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x521B;&#x9020;&#x7231;&#x60C5;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x7231;&#x4E00;&#x4E2A;&#x4EBA;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x5B66;&#x4F1A;&#x7231;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#xFF0C;&#x800C;&#x5F17;&#x6D1B;&#x4F0A;&#x5FB7;&#x5C06;&#x8FD9;&#x79CD;&#x4EBA;&#x7684;&#x81EA;&#x6211;&#x6B23;&#x8D4F;&#x53EB;&#x505A;&#x201C;&#x81EA;&#x604B;&#x201D;&#xFF0C;&#x9664;&#x4E86;&#x7231;&#x60C5;&#x81EA;&#x8EAB;&#x79EF;&#x6781;&#x6027;&#x7684;&#x56E0;&#x7D20;&#x4EE5;&#x5916;&#xFF0C;&#x7231;&#x60C5;&#x5177;&#x6709;&#x6240;&#x6709;&#x7231;&#x7684;&#x5F62;&#x5F0F;&#x6240;&#x5171;&#x6709;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x5982;&#xFF1A;&#x5173;&#x5FC3;&#x3001;&#x8D23;&#x4EFB;&#x5FC3;&#x3001;&#x5C0A;&#x91CD;&#x548C;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7231;&#x60C5;&#x4E0D;&#x662F;&#x81EA;&#x79C1;&#x5730;&#x5360;&#x6709;&#x5BF9;&#x65B9;&#x6216;&#x8005;&#x662F;&#x653E;&#x5F03;&#x9664;&#x5BF9;&#x65B9;&#x4EE5;&#x5916;&#x4EBA;&#x7684;&#x66F4;&#x4E3A;&#x5E7F;&#x6CDB;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x535A;&#x7231;&#xFF0C;&#x201C;&#x7231;&#x60C5;&#x662F;&#x81EA;&#x7531;&#x4E4B;&#x5B50;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x662F;&#x63A7;&#x5236;&#x7684;&#x4EA7;&#x7269;&#x201D;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x7A77;&#x6781;&#x4E00;&#x751F;&#x6765;&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#x3001;&#x8BA4;&#x8BC6;&#x522B;&#x4EBA;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4E0D;&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#x3001;&#x4E0D;&#x8BA4;&#x8BC6;&#x522B;&#x4EBA;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x963B;&#x6B62;&#x8FD9;&#x79CD;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4EBA;&#x7684;&#x7075;&#x9B42;&#x7684;&#x79D8;&#x5BC6;&#x3001;&#x4E86;&#x89E3;&#x4EBA;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x5373;&#x201C;&#x81EA;&#x6211;&#x201D;&#x7684;&#x613F;&#x671B;&#x5C06;&#x7EE7;&#x7EED;&#x5B58;&#x5728;&#x3002;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x5FB7;&#x5C14;&#x6590;&#x7684;&#x4EBA;&#x7BB4;&#x8A00;&#x201C;&#x8BA4;&#x8BC6;&#x4F60;&#x81EA;&#x5DF1;&#x201D;&#x8868;&#x8FBE;&#x4E86;&#x6211;&#x4EEC;&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#x548C;&#x4ED6;&#x4EBA;&#x7684;&#x613F;&#x671B;&#x3002;&#x767D;&#x663C;&#x548C;&#x9ED1;&#x591C;&#x8868;&#x9762;&#x770B;&#x8D77;&#x6765;&#x662F;&#x654C;&#x4EBA;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5374;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x76F8;&#x7231;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x5171;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x800C;&#x4ECE;&#x5E7F;&#x4E49;&#x7684;&#x7231;&#x7684;&#x5B9A;&#x4E49;&#x6765;&#x770B;&#xFF0C;&#x4E2D;&#x56FD;&#x53E4;&#x4EE3;&#x5148;&#x54F2;&#x5B5F;&#x5B50;&#x7684;&#x201C;&#x8001;&#x543E;&#x8001;&#x4EE5;&#x53CA;&#x4EBA;&#x4E4B;&#x8001;&#xFF0C;&#x5E7C;&#x543E;&#x5E7C;&#x4EE5;&#x53CA;&#x4EBA;&#x4E4B;&#x5E7C;&#x201D;&#x5C31;&#x5F88;&#x597D;&#x7684;&#x8868;&#x8FBE;&#x4E86;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#xFF0C;&#x5F17;&#x6D1B;&#x59C6;&#x8BF4;&#xFF1A;&#x201C;&#x4E00;&#x5207;&#x7231;&#x7684;&#x5F62;&#x5F0F;&#x90FD;&#x4EE5;&#x535A;&#x7231;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x6211;&#x6307;&#x7684;&#x535A;&#x7231;&#x5C31;&#x662F;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x4EBA;&#x90FD;&#x6709;&#x4E00;&#x79CD;&#x8D23;&#x4EFB;&#x611F;&#xFF0C;&#x5173;&#x5FC3;&#x3001;&#x5C0A;&#x91CD;&#x548C;&#x4E86;&#x89E3;&#x4ED6;&#x4EBA;&#xFF0C;&#x5373;&#x613F;&#x610F;&#x63D0;&#x9AD8;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x60C5;&#x8DA3;&#x201D;&#x3002;&#x4EE5;&#x524D;&#x4EE5;&#x4E3A;&#x7231;&#x662F;&#x81EA;&#x79C1;&#x5730;&#x5360;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x662F;&#x5BF9;&#x9664;&#x5BF9;&#x65B9;&#x4EE5;&#x5916;&#x7684;&#x4EBA;&#x8868;&#x73B0;&#x5F97;&#x6F20;&#x4E0D;&#x5173;&#x5FC3;&#xFF0C;&#x53EF;&#x540E;&#x6765;&#x9010;&#x6E10;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7231;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x522B;&#x4EBA;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x4E0D;&#x80FD;&#x53EB;&#x505A;&#x7231;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x66F4;&#x672C;&#x8D28;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8BA4;&#x8BC6;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x4EBA;&#xFF0C;&#x505A;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#x800C;&#x5DF2;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x8BD5;&#x56FE;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7559;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x5370;&#x8BB0;&#xFF0C;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x4E86;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x6652;&#x7F8E;&#x98DF;&#x3001;&#x6652;&#x65C5;&#x6E38;&#x3001;&#x6652;&#x81EA;&#x62CD;&#x7B49;&#x7B49;&#x7EA6;&#x5B9A;&#x4FD7;&#x6210;&#x7684;&#x5904;&#x4E8B;&#x65B9;&#x6CD5;&#xFF0C;&#x4EA6;&#x5982;&#x6211;&#x4EEC;&#x751F;&#x6765;&#x5C31;&#x6E34;&#x671B;&#x88AB;&#x4EBA;&#x7406;&#x89E3;&#x3001;&#x88AB;&#x4EBA;&#x559C;&#x6B22;&#x4E00;&#x6837;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x66F4;&#x672C;&#x8D28;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x79F0;&#x4E3A;&#x201C;&#x5237;&#x5B58;&#x5728;&#x611F;&#x201D;&#xFF0C;&#x6070;&#x6070;&#x8FCE;&#x5408;&#x4E86;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7559;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x5370;&#x8BB0;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E9B;&#x65B9;&#x5F0F;&#x65B9;&#x6CD5;&#x770B;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x521D;&#x559C;&#x6B22;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5F17;&#x6D1B;&#x59C6;&#x5C06;&#x5728;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#x7406;&#x89E3;&#x4E3A;&#x201C;&#x8D85;&#x8D8A;&#x81EA;&#x5DF1;&#x201D;&#x7684;&#x8FFD;&#x6C42;&#xFF0C;&#x8FD9;&#x4E00;&#x8FFD;&#x6C42;&#x5C5E;&#x4E8E;&#x4EBA;&#x7684;&#x6700;&#x57FA;&#x672C;&#x8981;&#x6C42;&#xFF0C;&#x5373;&#x201C;&#x4EBA;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7EAF;&#x751F;&#x7269;&#x4F5C;&#x7528;&#x4E0D;&#x6EE1;&#xFF0C;&#x4ED6;&#x4E0D;&#x80FD;&#x5FCD;&#x53D7;&#x81EA;&#x5DF1;&#x4EC5;&#x4EC5;&#x662F;&#x88AB;&#x6254;&#x8FDB;&#x8FD9;&#x4E00;&#x4E16;&#x754C;&#x7684;&#x5C0F;&#x5352;&#x3002;&#x4ED6;&#x4E00;&#x5B9A;&#x8981;&#x611F;&#x5230;&#x81EA;&#x5DF1;&#x662F;&#x521B;&#x9020;&#x8005;&#xFF0C;&#x662F;&#x80FD;&#x8D85;&#x8D8A;&#x5904;&#x4E8E;&#x88AB;&#x521B;&#x9020;&#x8005;&#x6D88;&#x6781;&#x5730;&#x4F4D;&#x7684;&#x751F;&#x547D;&#x3002;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E00;&#x8981;&#x6C42;&#x6709;&#x8BB8;&#x591A;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x6700;&#x81EA;&#x7136;&#x548C;&#x6700;&#x57FA;&#x672C;&#x7684;&#x9014;&#x5F84;&#x5C31;&#x662F;&#x6BCD;&#x4EB2;&#x5BF9;&#x81EA;&#x5DF1;&#x521B;&#x9020;&#x7269;&#x7684;&#x5173;&#x6000;&#x548C;&#x7231;&#x201D;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x6E34;&#x671B;&#x88AB;&#x4EBA;&#x559C;&#x6B22;&#x3001;&#x88AB;&#x4EBA;&#x7406;&#x89E3;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x751F;&#x6765;&#x72EC;&#x7279;&#x3001;&#x751F;&#x6765;&#x4E0D;&#x540C;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x6E90;&#x4E8E;&#x7236;&#x6BCD;&#x5BF9;&#x7231;&#x7684;&#x4E00;&#x79CD;&#x521B;&#x9020;&#x529B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x8868;&#x73B0;&#x51FA;&#xFF0C;&#x4E00;&#x79CD;&#x8BD5;&#x56FE;&#x8981;&#x8981;&#x8BC1;&#x660E;&#x6BD4;&#x522B;&#x4EBA;&#x8FC7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x4EFF;&#x4F5B;&#x5728;&#x670B;&#x53CB;&#x5708;&#x6216;&#x8005;&#x5FAE;&#x535A;&#x8FD9;&#x79CD;&#x793E;&#x4EA4;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x627E;&#x5230;&#x66F4;&#x591A;&#x7684;&#x81EA;&#x8C6A;&#x611F;&#xFF0C;&#x53EF;&#x6211;&#x540C;&#x6837;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5927;&#x7684;&#x793E;&#x4EA4;&#x7F51;&#x7AD9;Facebook&#xFF0C;&#x80CC;&#x540E;&#x5374;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x6709;&#x793E;&#x4EA4;&#x969C;&#x788D;&#x7684;&#x4EBA;&#x521B;&#x9020;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x6E34;&#x671B;&#x8BA9;&#x522B;&#x4EBA;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x3001;&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x4E0D;&#x540C;&#x4E8E;&#x793E;&#x4EA4;&#x573A;&#x5408;&#x91CC;&#x90A3;&#x79CD;&#x5BA2;&#x5957;&#x7684;&#x573A;&#x9762;&#x8BDD;&#xFF0C;&#x5BF9;&#x6B64;&#xFF0C;&#x5F17;&#x6D1B;&#x59C6;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BB2;&#x8FF0;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x6253;&#x7834;&#x4EBA;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x8FD9;&#x79CD;&#x5B64;&#x72EC;&#x611F;&#xFF0C;&#x201C;&#x8BB2;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x53D9;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x5E0C;&#x671B;&#x548C;&#x6050;&#x60E7;&#xFF0C;&#x8C08;&#x51FA;&#x81EA;&#x5DF1;&#x5E7C;&#x7A1A;&#x7684;&#x6216;&#x8005;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x4EE5;&#x53CA;&#x627E;&#x5230;&#x9762;&#x5BF9;&#x4E16;&#x754C;&#x7684;&#x5171;&#x540C;&#x5229;&#x76CA;&#x2014;&#x2014;&#x6240;&#x6709;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x514B;&#x670D;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x9694;&#x79BB;&#x7684;&#x9014;&#x5F84;&#xFF0C;&#x751A;&#x81F3;&#x8868;&#x9732;&#x81EA;&#x5DF1;&#x7684;&#x6124;&#x6012;&#x548C;&#x4EC7;&#x6068;&#xFF0C;&#x6BEB;&#x65E0;&#x987E;&#x5FCC;&#x5730;&#x4EA4;&#x5FC3;&#x4E5F;&#x90FD;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x4EB2;&#x5BC6;&#x7684;&#x8868;&#x73B0;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x7231;&#x7684;&#x7EC8;&#x6781;&#x7406;&#x89E3;&#x5176;&#x5B9E;&#x5E94;&#x8BE5;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x7231;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x8FDB;&#x800C;&#x7231;&#x5168;&#x4EBA;&#x7C7B;&#xFF0C;&#x7231;&#x4E00;&#x5207;&#x751F;&#x547D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x81EA;&#x6211;&#x7684;&#x751F;&#x547D;&#x7684;&#x672C;&#x8D28;&#x51FA;&#x53D1;&#x53BB;&#x7231;&#x5BF9;&#x65B9;&#xFF0C;&#x5E76;&#x4E14;&#x53BB;&#x4F53;&#x9A8C;&#x5BF9;&#x65B9;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x7231;&#x60C5;&#x662F;&#x610F;&#x5FD7;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x662F;&#x4EBA;&#x4F5C;&#x7684;&#x4E00;&#x9879;&#x628A;&#x5168;&#x90E8;&#x751F;&#x547D;&#x4EA4;&#x4ED8;&#x5BF9;&#x65B9;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5723;&#x7ECF;&#x4E2D;&#x201C;&#x7231;&#x4ED6;&#x4EBA;&#x5982;&#x540C;&#x7231;&#x5DF1;&#x201D;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x8BF4;&#x660E;&#x4E86;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x72EC;&#x7279;&#x6027;&#x7684;&#x5C0A;&#x91CD;&#xFF0C;&#x7231;&#x81EA;&#x5DF1;&#xFF0C;&#x7406;&#x89E3;&#x81EA;&#x5DF1;&#x540C;&#x5C0A;&#x91CD;&#x3001;&#x7231;&#x548C;&#x8C05;&#x89E3;&#x522B;&#x4EBA;&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#xFF0C;&#x7231;&#x6211;&#x540C;&#x7231;&#x4ED6;&#x4EBA;&#x662F;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#x7684;&#x3002;&#x4E2D;&#x4E16;&#x7EAA;&#x5FB7;&#x610F;&#x5FD7;&#x795E;&#x79D8;&#x4E3B;&#x4E49;&#x54F2;&#x5B66;&#x5BB6;&#x548C;&#x795E;&#x5B66;&#x5BB6;&#xFF0C;&#x7231;&#x514B;&#x54C8;&#x7279;&#x6709;&#x4E00;&#x53E5;&#x5173;&#x4E8E;&#x81EA;&#x7231;&#x7684;&#x683C;&#x8A00;&#xFF1A;&#x201C;&#x4F60;&#x82E5;&#x7231;&#x5DF1;&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x7231;&#x6240;&#x6709;&#x7684;&#x4EBA;&#x5982;&#x7231;&#x5DF1;&#x3002;&#x4F60;&#x82E5;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7231;&#x5C11;&#x4E8E;&#x7231;&#x5DF1;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x662F;&#x7231;&#x6240;&#x6709;&#x7684;&#x4EBA;&#x5982;&#x540C;&#x7231;&#x5DF1;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4EBA;&#x8EAB;&#x4E0A;&#x7231;&#x6240;&#x6709;&#x7684;&#x4EBA;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4EBA;&#x5C31;&#x662F;&#x4E0A;&#x5E1D;&#x548C;&#x4EBA;&#x3002;&#x4E00;&#x4E2A;&#x65E2;&#x7231;&#x81EA;&#x5DF1;&#x53C8;&#x7231;&#x4ED6;&#x4EBA;&#x5982;&#x540C;&#x7231;&#x5DF1;&#x7684;&#x4EBA;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x8FD9;&#x6837;&#x8BC4;&#x4EF7;&#x7684;&#x4EBA;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x4E16;&#x754C;&#x4E0A;&#x5B66;&#x4F1A;&#x4E0E;&#x4EBA;&#x76F8;&#x5904;&#x3001;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x53BB;&#x7231;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x5BFB;&#x627E;&#x4E00;&#x79CD;&#x63A2;&#x7D22;&#x751F;&#x6D3B;&#x6240;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x5B58;&#x6216;&#x8BB8;&#x4F1A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x53EF;&#x662F;&#x5B66;&#x4F1A;&#x751F;&#x6D3B;&#x6216;&#x8BB8;&#x4F1A;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x6211;&#x4EEC;&#x52AA;&#x529B;&#x63D0;&#x9AD8;&#x751F;&#x6D3B;&#x8D28;&#x91CF;&#xFF0C;&#x6E90;&#x4E8E;&#x6211;&#x4EEC;&#x5BF9;&#x81EA;&#x5DF1;&#x548C;&#x4F34;&#x4FA3;&#x7684;&#x4E00;&#x79CD;&#x7231;&#xFF0C;&#x5E0C;&#x671B;&#x8BA9;&#x5F7C;&#x6B64;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x5BF9;&#x5F17;&#x6D1B;&#x59C6;&#x672C;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x672C;&#x300A;&#x7231;&#x7684;&#x827A;&#x672F;&#x300B;&#x66F4;&#x50CF;&#x662F; &#x4ED6;&#x5BF9;&#x81EA;&#x6211;&#x7684;&#x4E00;&#x79CD;&#x5185;&#x7701;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x7231;&#x60C5;&#x57FA;&#x672C;&#x4E0A;&#x5728;&#x6301;&#x7EED;&#x5730;&#x906D;&#x9047;&#x7740;&#x5931;&#x8D25;&#xFF0C;&#x4ED6;&#x66FE;&#x7ECF;&#x548C;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5973;&#x4EBA;&#x7ED3;&#x8FC7;&#x5A5A;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x91CC;&#x63D0;&#x51FA;&#x7684;&#x5927;&#x91CF;&#x89C2;&#x70B9;&#x90FD;&#x6765;&#x6E90;&#x81EA;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x60C5;&#x7ECF;&#x5386;&#xFF0C;&#x4ED6;&#x65E9;&#x671F;&#x7814;&#x7A76;&#x8FC7;&#x5F17;&#x6D1B;&#x4F0A;&#x5FB7;&#x7684;&#x76F8;&#x5173;&#x7406;&#x8BBA;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x7231;&#x7684;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x8BA9;&#x4ED6;&#x771F;&#x6B63;&#x627E;&#x5230;&#x4E86;&#x7231;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#x603B;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x559C;&#x6B22;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x5374;&#x65E0;&#x6CD5;&#x7ED9;&#x5979;&#x60F3;&#x8981;&#x7684;&#x751F;&#x6D3B;&#x7684;&#x5973;&#x5B69;&#x5B50;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x7528;&#x4E00;&#x751F;&#x53BB;&#x9886;&#x609F;&#x7231;&#x7684;&#x771F;&#x6B63;&#x542B;&#x4E49;&#x5427;&#xFF0C;&#x5C31;&#x50CF;&#x5F17;&#x6D1B;&#x59C6;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x5C06;&#x7406;&#x8BBA;&#x548C;&#x5B9E;&#x8DF5;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#xFF0C;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x6211;&#x6B64;&#x523B;&#x5DF2;&#x7ECF;&#x8BFB;&#x61C2;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x53EF;&#x662F;&#x5B83;&#x5BF9;&#x6211;&#x7684;&#x786E;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x603B;&#x8981;&#x5B66;&#x7740;&#x53BB;&#x7231;&#x522B;&#x4EBA;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/21112647/">一见钟情，无疾而终</a></li><li><a href="https://qinyuanpei.github.io/posts/2171683728/">函数式编程常用术语</a></li><li><a href="https://qinyuanpei.github.io/posts/123663202/">剑指Offer读书笔记(1)</a></li><li><a href="https://blogs.kainy.cn/2010/08/'20100816'/">20100816</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2275646954/" rel="external">你了解爱的艺术吗？</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2275646954/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2275646954/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Kindle/">Kindle</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/爱情/">爱情</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/读书/">读书</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2275646954/&title=《你了解爱的艺术吗？》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2275646954/&title=《你了解爱的艺术吗？》 — PayneQinのBlog&source=&emsp;&emsp;或许我不是一个懂得如何去爱人的人，我时常陷入一种自我否定的焦虑当中，当我发觉自己喜欢上一个人的时候，从某种意义上它会让我身上的缺点..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2275646954/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《你了解爱的艺术吗？》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2275646954/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2275646954/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3653716295/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">像诗人一样睿智，像天才一样疯狂</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3247186509/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">一个关于概率的问题的思考</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2275646954/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2275646954/&title=《你了解爱的艺术吗？》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2275646954/&title=《你了解爱的艺术吗？》 — PayneQinのBlog&source=&emsp;&emsp;或许我不是一个懂得如何去爱人的人，我时常陷入一种自我否定的焦虑当中，当我发觉自己喜欢上一个人的时候，从某种意义上它会让我身上的缺点..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2275646954/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《你了解爱的艺术吗？》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2275646954/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2275646954/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2275646954/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
