<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        我是猫，一只特立独行的猫 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5728;&amp;#x9664;&amp;#x5915;&amp;#x591C;&amp;#x5230;&amp;#x6765;&amp;#x524D;&amp;#xFF0C;&amp;#x5728;Kindle&amp;#x4E0A;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;2017&amp;#x5E74;&amp;#x7684;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x672C;&amp;#x4E6">
<meta name="keywords" content="夏目漱石,日本文学,我是猫">
<meta property="og:type" content="article">
<meta property="og:title" content="我是猫，一只特立独行的猫">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/352037321/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5728;&amp;#x9664;&amp;#x5915;&amp;#x591C;&amp;#x5230;&amp;#x6765;&amp;#x524D;&amp;#xFF0C;&amp;#x5728;Kindle&amp;#x4E0A;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;2017&amp;#x5E74;&amp;#x7684;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x672C;&amp;#x4E6">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="我是猫，一只特立独行的猫">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5728;&amp;#x9664;&amp;#x5915;&amp;#x591C;&amp;#x5230;&amp;#x6765;&amp;#x524D;&amp;#xFF0C;&amp;#x5728;Kindle&amp;#x4E0A;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;2017&amp;#x5E74;&amp;#x7684;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x672C;&amp;#x4E6">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">我是猫，一只特立独行的猫</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">我是猫，一只特立独行的猫</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-03-06T08:57:48.000Z" itemprop="datePublished" class="page-time">
  2018-03-06
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-我是猫，一只特立独行的猫" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">我是猫，一只特立独行的猫</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-03-06 08:57:48" datetime="2018-03-06T08:57:48.000Z" itemprop="datePublished">2018-03-06</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        19 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x7EC8;&#x4E8E;&#x5728;&#x9664;&#x5915;&#x591C;&#x5230;&#x6765;&#x524D;&#xFF0C;&#x5728;Kindle&#x4E0A;&#x8BFB;&#x5B8C;&#x4E86;2017&#x5E74;&#x7684;&#x6700;&#x540E;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x6765;&#x81EA;&#x590F;&#x76EE;&#x6F31;&#x77F3;&#x5148;&#x751F;&#x7684;&#x300A;&#x6211;&#x662F;&#x732B;&#x300B;&#x3002;&#x8D77;&#x521D;&#x4E70;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x52A8;&#x673A;&#x8BF4;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x6ED1;&#x7A3D;&#xFF0C;&#x4E00;&#x6765;&#x4EE5;&#x4E3A;&#x8FD9;&#x4F1A;&#x662F;&#x4E00;&#x672C;&#x8BD9;&#x8C10;&#x5E7D;&#x9ED8;&#x7684;&#x4E66;&#xFF0C;&#x4E8C;&#x6765;&#x5BF9;&#x590F;&#x76EE;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x83AB;&#x540D;&#x5730;&#x5145;&#x6EE1;&#x597D;&#x611F;&#x3002;&#x6211;&#x8BFB;&#x7684;&#x662F;&#x66F9;&#x66FC;&#x7FFB;&#x8BD1;&#x7684;&#x4E2D;&#x6587;&#x8BD1;&#x672C;&#xFF0C;&#x8BFB;&#x65F6;&#x89C9;&#x5F97;&#x8FD9;&#x4F4D;&#x4F5C;&#x8005;&#x7684;&#x6587;&#x5B57;&#x6E05;&#x65B0;&#x7D20;&#x96C5;&#xFF0C;&#x5373;&#x4F7F;&#x5168;&#x4E66;&#x884C;&#x6587;&#x8282;&#x594F;&#x582A;&#x79F0;&#x7F13;&#x6162;&#x5230;&#x6781;&#x70B9;&#xFF0C;&#x60F3;&#x6765;&#x5E94;&#x8BE5;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x7684;&#x4EBA;&#x7269;&#x3002;&#x53CA;&#x81F3;&#x7FFB;&#x9605;&#x4F5C;&#x8005;&#x751F;&#x5E73;&#xFF0C;&#x59CB;&#x77E5;&#x8FD9;&#x4F4D;&#x88AB;&#x8A89;&#x4E3A;&#x201C;&#x56FD;&#x6C11;&#x5927;&#x4F5C;&#x5BB6;&#x201D;&#x7684;&#x65E5;&#x672C;&#x4F5C;&#x5BB6;&#xFF0C;&#x65E9;&#x5728;100&#x5E74;&#x524D;&#x5C31;&#x5728;&#x65E5;&#x672C;&#x6587;&#x5B66;&#x53F2;&#x4E0A;&#x4EAB;&#x6709;&#x76DB;&#x540D;&#x3002;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5982;&#x4F55;&#x53BB;&#x5F62;&#x5BB9;&#x5462;&#xFF1F;&#x5927;&#x6982;&#x5C31;&#x662F;&#x6768;&#x8FC7;&#x4ECE;&#x5251;&#x51A2;&#x77F3;&#x523B;&#x7684;&#x5BE5;&#x5BE5;&#x6570;&#x8BED;&#x4E2D;&#xFF0C;&#x9065;&#x60F3;&#x72EC;&#x5B64;&#x6C42;&#x8D25;&#x201D;&#x751F;&#x5E73;&#x6C42;&#x4E00;&#x654C;&#x624B;&#x800C;&#x4E0D;&#x53EF;&#x5F97;&#x201D;&#x7684;&#x5BC2;&#x5BE5;&#x96BE;&#x582A;&#x3002;&#x8FD9;&#x4F4D;&#x8001;&#x5148;&#x751F;&#x7684;&#x6587;&#x5B57;&#x53EF;&#x4EE5;&#x8BF4;&#x975E;&#x5E38;&#x201D;&#x6469;&#x767B;&#x201C;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;100&#x5E74;&#x540E;&#x7684;&#x4ECA;&#x5929;&#x518D;&#x6B21;&#x8BFB;&#x6765;&#xFF0C;&#x7ADF;&#x5B8C;&#x5168;&#x8BFB;&#x4E0D;&#x51FA;&#x8FDD;&#x548C;&#x611F;&#x6765;&#xFF0C;&#x6240;&#x8C13;&#x201D;&#x5B09;&#x7B11;&#x6012;&#x9A82;&#x7686;&#x6210;&#x6587;&#x7AE0;&#x201C;&#xFF0C;&#x8BBD;&#x523A;&#x4E0E;&#x5E7D;&#x9ED8;&#x6742;&#x7136;&#x76F8;&#x9648;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7406;&#x7531;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x300A;&#x6211;&#x662F;&#x732B;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6309;&#x7167;&#x4F5C;&#x8005;&#x7684;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x90E8;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x60C5;&#x8282;&#x7684;&#x5C0F;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5B8C;&#x5168;&#x662F;&#x4EE5;&#x4E00;&#x53EA;&#x732B;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x884C;&#x6587;&#xFF0C;&#x8FD9;&#x53EA;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x6559;&#x5E08;&#x5BB6;&#x5EAD;&#x91CC;&#x7684;&#x732B;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x6587;&#x4EBA;&#xFF0C;&#x8B6C;&#x5982;&#xFF1A;&#x4E0D;&#x98DF;&#x4EBA;&#x95F4;&#x70DF;&#x706B;&#xFF0C;&#x7A7A;&#x6709;&#x4E00;&#x756A;&#x7406;&#x8BBA;&#x800C;&#x4E0D;&#x53BB;&#x5B9E;&#x8DF5;&#x7684;&#x72EC;&#x4ED9;&#xFF1B;&#x6574;&#x5929;&#x78E8;&#x73BB;&#x7483;&#x7403;&#xFF0C;&#x505A;&#x4E8B;&#x4E00;&#x4E1D;&#x4E0D;&#x82DF;&#x751A;&#x81F3;&#x53E4;&#x677F;&#x6728;&#x5450;&#x7684;&#x5BD2;&#x6708;&#xFF1B;&#x8868;&#x9762;&#x4E0A;&#x6BCF;&#x5929;&#x90FD;&#x5F88;&#x4E50;&#x89C2;&#xFF0C;&#x5B9E;&#x5219;&#x552F;&#x6050;&#x5929;&#x4E0B;&#x4E0D;&#x4E71;&#x7684;&#x7C73;&#x4EAD;&#xFF1B;&#x505A;&#x4E8B;&#x4E09;&#x5206;&#x949F;&#x70ED;&#x60C5;&#xFF0C;&#x81EA;&#x547D;&#x6E05;&#x9AD8;&#x7684;&#x82E6;&#x6C99;&#x5F25;&#x2026;&#x2026;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x732B;&#x7684;&#x773C;&#x775B;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x6574;&#x5929;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x5FC3;&#x6000;&#x4E0D;&#x6EE1;&#xFF0C;&#x4E0D;&#x601D;&#x8FDB;&#x53D6;&#x5C31;&#x4F1A;&#x6028;&#x5929;&#x5C24;&#x4EBA;&#xFF0C;&#x751A;&#x81F3;&#x91D1;&#x7530;&#x53CA;&#x5176;&#x592B;&#x4EBA;&#x7684;&#x201D;&#x62DC;&#x91D1;&#x4E3B;&#x4E49;&#x201C;&#xFF0C;&#x4E3A;&#x91D1;&#x94B1;&#x800C;&#x9677;&#x5BB3;&#x82E6;&#x6C99;&#x5F25;&#x7684;&#x90BB;&#x5C45;&#xFF0C;&#x552F;&#x5229;&#x662F;&#x56FE;&#x3001;&#x865A;&#x4F2A;&#x5706;&#x6ED1;&#x7684;&#x94C3;&#x6728;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x5728;&#x732B;&#x7684;&#x773C;&#x775B;&#x91CC;&#x90FD;&#x662F;&#x4E11;&#x964B;&#x800C;&#x9ED1;&#x6697;&#x7684;&#x3002;&#x8FD9;&#x53EA;&#x732B;&#x5E73;&#x9759;&#x5730;&#x53D9;&#x8FF0;&#x7740;&#x5B83;&#x7684;&#x89C1;&#x95FB;&#xFF0C;&#x4EFF;&#x4F5B;&#x5B83;&#x65E9;&#x5DF2;&#x7ECF;&#x6574;&#x4E2A;&#x4EBA;&#x7C7B;&#x548C;&#x793E;&#x4F1A;&#x770B;&#x7A7F;&#x770B;&#x900F;&#xFF0C;&#x6216;&#x8BB8;&#x5E26;&#x7740;&#x4E9B;&#x5632;&#x8BBD;&#xFF0C;&#x6216;&#x8BB8;&#x5E26;&#x7740;&#x4E9B;&#x540C;&#x60C5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6BCF;&#x5E74;&#x7684;2&#x6708;22&#x65E5;&#x662F;&#x65E5;&#x672C;&#x7684;&#x732B;&#x8282;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5728;&#x8BFB;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#x4EE5;&#x540E;&#x77E5;&#x9053;&#x7684;&#x3002;&#x800C;&#x732B;&#x5728;&#x65E5;&#x672C;&#x7684;&#x6587;&#x5316;&#x5F62;&#x8C61;&#x4E2D;&#x662F;&#x975E;&#x5E38;&#x795E;&#x5723;&#x7684;&#xFF0C;&#x636E;&#x8BF4;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x732B;&#x6700;&#x65E9;&#x7531;&#x9063;&#x5510;&#x4F7F;&#x5E26;&#x6765;&#x65E5;&#x672C;&#xFF0C;&#x9996;&#x5148;&#x4F5C;&#x4E3A;&#x5BAB;&#x5EF7;&#x5BA0;&#x7269;&#x51FA;&#x73B0;&#xFF0C;&#x76F4;&#x81F3;&#x6C5F;&#x6237;&#x65F6;&#x4EE3;&#x8FDB;&#x5165;&#x201D;&#x5BFB;&#x5E38;&#x767E;&#x59D3;&#x5BB6;&#x201C;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x65E5;&#x672C;&#x4F5C;&#x4E3A;&#x91CD;&#x5EA6;&#x6E14;&#x4E1A;&#x56FD;&#x5EA6;&#xFF0C;&#x5BF9;&#x7A3B;&#x7C73;&#x7684;&#x73CD;&#x60DC;&#x4F7F;&#x5176;&#x5728;&#x6355;&#x9F20;&#x62A4;&#x7CAE;&#x65B9;&#x9762;&#x6781;&#x4E3A;&#x91CD;&#x89C6;&#xFF0C;&#x732B;&#x4F5C;&#x4E3A;&#x8001;&#x9F20;&#x7684;&#x5929;&#x654C;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x53D7;&#x5230;&#x559C;&#x7231;&#x3002;&#x76F8;&#x4F20;&#x62DB;&#x8D22;&#x732B;&#x8D77;&#x6E90;&#x4E8E;&#x4E1C;&#x4EAC;&#x4E16;&#x7530;&#x8C37;&#x7684;&#x8C6A;&#x5FB7;&#x5BFA;&#xFF0C;&#x56E0;&#x6B64;&#x732B;&#x5728;&#x65E5;&#x672C;&#x88AB;&#x4EBA;&#x4EEC;&#x5F53;&#x4F5C;&#x795E;&#x660E;&#x4F9B;&#x5949;&#x3002;&#x518D;&#x6BD4;&#x5982;&#x65E5;&#x672C;&#x52A8;&#x6F2B;&#x4E2D;&#x7684;&#x673A;&#x5668;&#x732B;&#x3001;&#x9F99;&#x732B;&#x548C;Hello Kitty&#x90FD;&#x662F;&#x732B;&#x5728;&#x65E5;&#x672C;&#x6587;&#x5316;&#x4E2D;&#x7684;&#x7ECF;&#x5178;&#x5F62;&#x8C61;&#xFF0C;&#x65E5;&#x672C;&#x7684;&#x6587;&#x5B66;&#x4F5C;&#x54C1;&#x6BD4;&#x5982;&#x300A;&#x8349;&#x6795;&#x5B50;&#x300B;&#x3001;&#x300A;&#x6E90;&#x6C0F;&#x7269;&#x8BED;&#x300B;&#x7B49;&#x91CC;&#x9762;&#x90FD;&#x6709;&#x5173;&#x4E8E;&#x732B;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;&#x4F9D;&#x7136;&#x6709;&#x5927;&#x91CF;&#x5FB7;&#x5DDD;&#x5BB6;&#x65CF;&#x4E0E;&#x732B;&#x7684;&#x6545;&#x4E8B;&#x6D41;&#x4F20;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x732B;&#x5728;&#x65E5;&#x672C;&#x4EBA;&#x773C;&#x4E2D;&#x6709;&#x4E00;&#x79CD;&#x6D53;&#x539A;&#x7684;&#x8D35;&#x65CF;&#x6C14;&#x606F;&#x3002;&#x9648;&#x51EF;&#x6B4C;&#x5BFC;&#x6F14;&#x7684;&#x300A;&#x5996;&#x732B;&#x4F20;&#x300B;&#xFF0C;&#x6539;&#x7F16;&#x81EA;&#x65E5;&#x672C;&#x4F5C;&#x5BB6;&#x68A6;&#x6795;&#x8C98;&#x7684;&#x5C0F;&#x8BF4;&#x300A;&#x6C99;&#x95E8;&#x7A7A;&#x6D77;&#x300B;&#xFF0C;&#x732B;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E0D;&#x8A00;&#x81EA;&#x660E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x201C;&#x732B;&#x773C;&#x770B;&#x4E16;&#x754C;&#x201D;&#x7684;&#x4E66;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x600E;&#x6837;&#x7684;&#x4E16;&#x754C;&#x5462;&#xFF1F;1871&#x5E74;&#xFF0C;&#x65E5;&#x672C;&#x5386;&#x53F2;&#x4E0A;&#x6700;&#x4E3A;&#x5927;&#x5200;&#x9614;&#x65A7;&#x7684;&#x4E00;&#x6B21;&#x6539;&#x9769;&#x2014;&#x2014;&#x660E;&#x6CBB;&#x7EF4;&#x65B0;&#xFF0C;&#x5F00;&#x59CB;&#x5728;&#x5168;&#x56FD;&#x8303;&#x56F4;&#x5185;&#x63A8;&#x884C;&#x3002;&#x6539;&#x9769;&#x5E26;&#x6765;&#x7ECF;&#x6D4E;&#x98DE;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x5404;&#x79CD;&#x77DB;&#x76FE;&#x65E5;&#x76CA;&#x7A81;&#x51FA;&#x7684;&#x793E;&#x4F1A;&#x95EE;&#x9898;&#x3002;36&#x5E74;&#x7684;1905&#x5E74;&#xFF0C;&#x65F6;&#x5E74;38&#x5C81;&#x7684;&#x590F;&#x76EE;&#x6F31;&#x77F3;&#xFF0C;&#x4EE5;&#x732B;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x5982;&#x521D;&#x5165;&#x4EBA;&#x7C7B;&#x793E;&#x4F1A;&#x4E00;&#x822C;&#xFF0C;&#x63A2;&#x8BA8;&#x5F53;&#x65F6;&#x77E5;&#x8BC6;&#x5206;&#x5B50;&#x7684;&#x5FC3;&#x7406;&#x72B6;&#x6001;&#x548C;&#x5BF9;&#x793E;&#x4F1A;&#x53D8;&#x8FC1;&#x7684;&#x611F;&#x6168;&#xFF0C;&#x5E76;&#x56E0;&#x6B64;&#x4E00;&#x4E3E;&#x6210;&#x540D;&#xFF0C;&#x83B7;&#x5F97;&#x793E;&#x4F1A;&#x5E7F;&#x6CDB;&#x5173;&#x6CE8;&#xFF0C;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x65E5;&#x672C;&#x6279;&#x5224;&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x6587;&#x5B66;&#x7684;&#x4E30;&#x7891;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x4EE3;&#x90FD;&#x6709;&#x5B83;&#x7684;&#x65E0;&#x5948;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#x8001;&#x5148;&#x751F;&#x5F53;&#x65F6;&#x7684;&#x5FC3;&#x5883;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ECE;&#x8FD9;&#x4E9B;&#x732B;&#x7684;&#x53E3;&#x543B;&#x91CC;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E9B;&#x8F9B;&#x8FA3;&#x7684;&#x8BBD;&#x523A;&#x548C;&#x620F;&#x8C11;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x80FD;&#x8BFB;&#x51FA;&#x4F5C;&#x8005;&#x5F53;&#x65F6;&#x5185;&#x5FC3;&#x7684;&#x82E6;&#x95F7;&#x3002;&#x732B;&#x773C;&#x91CC;&#x90A3;&#x4E9B;&#x8352;&#x8BDE;&#x4E0D;&#x7ECF;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6070;&#x6070;&#x5C31;&#x662F;&#x4F60;&#x6211;&#x6BCF;&#x5929;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x8BF4;&#x4EBA;&#x7C7B;&#x548C;&#x732B;&#x662F;&#x597D;&#x670B;&#x53CB;&#xFF0C;&#x53EF;&#x90A3;&#x4EC5;&#x4EC5;&#x662F;&#x6211;&#x4EEC;&#x4EE5;&#x4E3A;&#x7684;&#xFF0C;&#x5728;&#x732B;&#x7684;&#x773C;&#x775B;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x50CF;&#x4E00;&#x7FA4;&#x795E;&#x7ECF;&#x75C5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x732B;&#x662F;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x4EBA;&#x7C7B;&#x7684;&#x5462;&#xFF1F;&#x732B;&#x8BF4;&#xFF1A;&#x4E16;&#x95F4;&#x7684;&#x5962;&#x4F88;&#x5F80;&#x5F80;&#x662F;&#x65E0;&#x80FD;&#x7684;&#x8868;&#x73B0;&#x3002;&#x732B;&#x4E00;&#x5E74;&#x5230;&#x5934;&#x90FD;&#x7A7F;&#x7740;&#x540C;&#x4E00;&#x4EF6;&#x8863;&#x670D;&#xFF0C;&#x800C;&#x4EBA;&#x7C7B;&#x597D;&#x50CF;&#x4E0D;&#x628A;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x5F80;&#x8EAB;&#x4E0A;&#x7167;&#x987E;&#x5C31;&#x96BE;&#x53D7;&#xFF0C;&#x4EBA;&#x7C7B;&#x7ED9;&#x7F8A;&#x6DFB;&#x9EBB;&#x70E6;&#xFF0C;&#x53D7;&#x8695;&#x7167;&#x987E;&#xFF0C;&#x627F;&#x8499;&#x68C9;&#x82B1;&#x7684;&#x6069;&#x6CFD;&#xFF0C;&#x4F60;&#x770B;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6240;&#x4F5C;&#x6240;&#x4E3A;&#x8FDE;&#x53EA;&#x732B;&#x90FD;&#x770B;&#x4E0D;&#x4E0B;&#x53BB;&#x3002;&#x4EBA;&#x7C7B;&#x7FA1;&#x6155;&#x732B;&#x7684;&#x60A0;&#x95F2;&#xFF0C;&#x6545;&#x800C;&#x611F;&#x6168;&#x9053;&#xFF1A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x80FD;&#x50CF;&#x732B;&#x4E00;&#x6837;&#x8F7B;&#x677E;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x53EF;&#x660E;&#x660E;&#x662F;&#x4EBA;&#x7C7B;&#x81EA;&#x5DF1;&#x5236;&#x9020;&#x51FA;&#x4E00;&#x5806;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x4E8B;&#x60C5;&#x7ED9;&#x81EA;&#x5DF1;&#xFF0C;&#x5230;&#x5934;&#x6765;&#x8FD8;&#x62B1;&#x6028;&#x771F;&#x75DB;&#x82E6;&#x771F;&#x75DB;&#x82E6;&#xFF0C;&#x5C31;&#x50CF;&#x81EA;&#x5DF1;&#x751F;&#x8D77;&#x4E00;&#x5806;&#x706B;&#xFF0C;&#x5230;&#x5934;&#x6765;&#x56B7;&#x7740;&#x70ED;&#x6B7B;&#x4E86;&#x70ED;&#x6B7B;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x5207;&#x5728;&#x732B;&#x770B;&#x6765;&#x90FD;&#x662F;&#x5EB8;&#x5EB8;&#x788C;&#x788C;&#x7684;&#x3002;&#x732B;&#x751A;&#x81F3;&#x65AD;&#x8A00;&#x9053;&#xFF1A;&#x4EBA;&#x7C7B;&#x4E0D;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x7E41;&#x8363;&#x660C;&#x76DB;&#x4E0B;&#x53BB;&#x3002;&#x55EF;&#xFF0C;&#x6211;&#x613F;&#x9759;&#x5019;&#x5C5E;&#x4E8E;&#x732B;&#x65CF;&#x65F6;&#x4EE3;&#x7684;&#x5230;&#x6765;&#x3002;&#x4ECE;&#x524D;&#x662F;&#x201C;&#x4EBA;&#x7C7B;&#x4E00;&#x601D;&#x8003;&#xFF0C;&#x4E0A;&#x5E1D;&#x5C31;&#x53D1;&#x7B11;&#x201D;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x662F;&#x201C;&#x4EBA;&#x7C7B;&#x4E00;&#x601D;&#x8003;&#xFF0C;&#x732B;&#x541B;&#x5C31;&#x53D1;&#x7B11;&#x201D;&#x3002;&#x732B;&#x89C9;&#x5F97;&#x4EBA;&#x7C7B;&#x6A21;&#x4EFF;&#x5B83;&#x4EEC;&#x7684;&#x58F0;&#x97F3;&#x65F6;&#x662F;&#x611A;&#x8822;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x629A;&#x6478;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56E0;&#x4E3A;&#x6839;&#x672C;&#x4E0D;&#x5B58;&#x5728;&#x6492;&#x5A07;&#x58F0;&#xFF0C;&#x53EA;&#x6709;&#x88AB;&#x6492;&#x5A07;&#x58F0;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x7684;&#x662F;&#xFF0C;&#x732B;&#x5411;&#x6211;&#x4EEC;&#x6492;&#x5A07;&#xFF0C;&#x53EF;&#x96BE;&#x9053;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5411;&#x732B;&#x6492;&#x5A07;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x4E2A;&#x4F53;&#x7684;&#x8352;&#x8C2C;&#xFF0C;&#x5728;&#x4EBA;&#x7C7B;&#x7684;&#x4E2A;&#x6027;&#x9762;&#x524D;&#x6839;&#x672C;&#x4E0D;&#x503C;&#x4E00;&#x63D0;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4EBA;&#x7C7B;&#x7684;&#x4E2A;&#x6027;&#x5F97;&#x5230;&#x5B8C;&#x5168;&#x89E3;&#x653E;&#x4EE5;&#x540E;&#xFF0C;&#x6C38;&#x8FDC;&#x50CF;&#x4E00;&#x9505;&#x4F17;&#x53E3;&#x96BE;&#x8C03;&#x7684;&#x7FB9;&#x6C64;&#x3002;&#x5C0F;&#x8BF4;&#x4E2D;&#x82E6;&#x6C99;&#x5F25;&#x3001;&#x8FF7;&#x4EAD;&#x3001;&#x5BD2;&#x6708;&#x3001;&#x4E1C;&#x98CE;&#x548C;&#x72EC;&#x4ED9;&#x65F6;&#x5E38;&#x5728;&#x4E00;&#x8D77;&#x804A;&#x5929;&#xFF0C;&#x8BDD;&#x9898;&#x6D89;&#x53CA;&#x54F2;&#x5B66;&#x3001;&#x827A;&#x672F;&#xFF0C;&#x7231;&#x60C5;&#x3001;&#x751F;&#x6D3B;&#x7B49;&#x591A;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x53EA;&#x201C;&#x6BD2;&#x820C;&#x201D;&#x7684;&#x732B;&#xFF0C;&#x5C31;&#x5728;&#x65E0;&#x610F;&#x8BC6;&#x5730;&#x5F15;&#x5BFC;&#x548C;&#x653E;&#x5927;&#x8FD9;&#x4E9B;&#x89C2;&#x70B9;&#xFF0C;&#x201C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x6BD4;&#x7231;&#x548C;&#x7F8E;&#x66F4;&#x53D7;&#x4EBA;&#x5C0A;&#x91CD;&#x7684;&#x4E86;&#x201D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x672C;&#x4E66;&#x91CC;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x7684;&#x6D88;&#x6781;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x53EA;&#x732B;&#x5E73;&#x9759;&#x5730;&#x770B;&#x7740;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5B83;&#x5BF9;&#x4EBA;&#x7C7B;&#x6709;&#x8FC7;&#x5632;&#x8BBD;&#xFF0C;&#x6709;&#x8FC7;&#x540C;&#x60C5;&#xFF0C;&#x5B83;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5F53;&#x5B83;&#x5931;&#x8DB3;&#x6DF9;&#x6B7B;&#x5728;&#x6C34;&#x7F38;&#x91CC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x79CD;&#x60B2;&#x5929;&#x60AF;&#x4EBA;&#x5427;&#xFF01;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6709;&#x4E94;&#x79CD;&#x6BD2;&#x836F;&#xFF0C;&#x4F5B;&#x5BB6;&#x6240;&#x8C13;&#x7684;&#x201C;&#x8D2A;&#x55D4;&#x75F4;&#x6162;&#x7591;&#x201D;&#xFF0C;&#x4F5C;&#x8005;&#x63D0;&#x5230;&#x201C;&#x53EF;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x80FD;&#x591F;&#x5168;&#x7136;&#x629B;&#x5F00;&#x81EA;&#x5DF1;&#x53BB;&#x7814;&#x7A76;&#x5916;&#x754C;&#xFF0C;&#x5982;&#x679C;&#x4EBA;&#x7C7B;&#x80FD;&#x591F;&#x628A;&#x81EA;&#x5DF1;&#x758F;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x758F;&#x79BB;&#x7684;&#x77AC;&#x95F4;&#xFF0C;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#x81EA;&#x5DF1;&#x201D;&#xFF0C;&#x4EBA;&#x7C7B;&#x5E38;&#x5E38;&#x4E0D;&#x613F;&#x653E;&#x8FC7;&#x81EA;&#x5DF1;&#xFF0C;&#x66F4;&#x4E0D;&#x613F;&#x653E;&#x8FC7;&#x522B;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x65E0;&#x89E3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5236;&#x9020;&#x4E00;&#x4E2A;&#x610F;&#x4E49;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x65E9;&#x5DF2;&#x4E60;&#x60EF;&#x8FD9;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x2003;&#x2003;&#x66FE;&#x7ECF;&#x6709;&#x670B;&#x53CB;&#x95EE;&#x6211;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x559C;&#x6B22;&#x732B;&#x8FD9;&#x79CD;&#x52A8;&#x7269;&#xFF0C;&#x6211;&#x56DE;&#x7B54;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5C31;&#x50CF;&#x4E00;&#x53EA;&#x732B;&#xFF0C;&#x4E00;&#x53EA;&#x7279;&#x7ACB;&#x72EC;&#x884C;&#x7684;&#x732B;&#xFF0C;&#x5BF9;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5F88;&#x53CB;&#x5584;&#x548C;&#x853C;&#xFF0C;&#x5374;&#x559C;&#x6B22;&#x72EC;&#x6765;&#x72EC;&#x5F80;&#x3002;&#x56E0;&#x4E3A;&#x7EF4;&#x62A4;&#x8FD9;&#x79CD;&#x82E5;&#x5373;&#x82E5;&#x79BB;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x6BD4;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x90FD;&#x8981;&#x56F0;&#x96BE;&#x3002;&#x4EBA;&#x7C7B;&#x4EE5;&#x4E3A;&#x732B;&#x90FD;&#x662F;&#x50B2;&#x5A07;&#x7684;&#x52A8;&#x7269;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x4EBA;&#x7C7B;&#x7684;&#x4E00;&#x53A2;&#x60C5;&#x613F;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x667A;&#x529B;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x732B;&#x7684;&#x667A;&#x529B;&#x662F;&#x4E0D;&#x53CA;&#x72D7;&#x7684;&#x3002;&#x732B;&#x81EA;&#x7136;&#x5BF9;&#x4EBA;&#x662F;&#x6709;&#x611F;&#x60C5;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x4EBA;&#x7C7B;&#x9A6F;&#x517B;&#x52A8;&#x7269;&#x7684;&#x5386;&#x7A0B;&#x4E2D;&#xFF0C;&#x72D7;&#x66F4;&#x806A;&#x660E;&#x3001;&#x66F4;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x5411;&#x4EBA;&#x7C7B;&#x7D22;&#x53D6;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BA4;&#x5B9A;&#x7684;&#x611F;&#x60C5;&#xFF0C;&#x5728;&#x72D7;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x6216;&#x8BB8;&#x5E76;&#x4E0D;&#x662F;&#x3002;&#x4EBA;&#x7C7B;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x6240;&#x8C13;&#x9633;&#x6625;&#x767D;&#x96EA;&#xFF0C;&#x6240;&#x8C13;&#x66F2;&#x9AD8;&#x548C;&#x5BE1;&#xFF0C;&#x4E0D;&#x81EA;&#x7136;&#x5730;&#x80CC;&#x8D1F;&#x4E0A;&#x9AD8;&#x51B7;&#x7684;&#x540D;&#x58F0;&#xFF0C;&#x5BF9;&#x4E00;&#x53EA;&#x732B;&#x800C;&#x5DF2;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x4E86;&#x89E3;&#x732B;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x3002;&#x4EBA;&#x603B;&#x5728;&#x8BD5;&#x56FE;&#x9A6F;&#x5316;&#x732B;&#x8FD9;&#x79CD;&#x52A8;&#x7269;&#xFF0C;&#x53EF;&#x732B;&#x65E0;&#x975E;&#x662F;&#x4EBA;&#x7C7B;&#x7684;&#x4E00;&#x79CD;&#x6298;&#x5C04;&#x800C;&#x5DF2;&#xFF0C;&#x5B83;&#x5C31;&#x50CF;&#x90A3;&#x4E9B;&#x72EC;&#x7ACB;&#x6F47;&#x6D12;&#x7684;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x85C9;&#x7531;&#x7C98;&#x4EBA;&#x548C;&#x6492;&#x5A07;&#x6765;&#x83B7;&#x53D6;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x4E0A;&#x6CA1;&#x6709;&#x8C01;&#x4F1A;&#x79BB;&#x4E0D;&#x5F00;&#x8C01;&#x3002;&#x4F60;&#x8D70;&#xFF0C;&#x6211;&#x4E0D;&#x5FC5;&#x9001;&#x4F60;&#xFF1B;&#x4F60;&#x6765;&#xFF0C;&#x4E0D;&#x7BA1;&#x591A;&#x5927;&#x98CE;&#x591A;&#x5927;&#x96E8;&#xFF0C;&#x6211;&#x90FD;&#x53BB;&#x63A5;&#x4F60;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x2014;&#x2014;&#x4E00;&#x53EA;&#x732B;&#x7684;&#x81EA;&#x767D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x89C9;&#x5F97;&#x4EBA;&#x7C7B;&#x81EA;&#x4F5C;&#x806A;&#x660E;&#xFF0C;&#x559C;&#x6B22;&#x7ED9;&#x4E16;&#x95F4;&#x7684;&#x4E8B;&#x7269;&#x8D34;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x8B6C;&#x5982;&#x4E8C;&#x54C8;&#x3001;&#x55B5;&#x661F;&#x4EBA;&#x3001;&#x6C6A;&#x661F;&#x4EBA;&#x3001;&#x732B;&#x4E3B;&#x5B50;&#x2026;&#x2026;&#x53EF;&#x4F60;&#x77E5;&#x9053;&#x732B;&#x5982;&#x4F55;&#x8BC4;&#x4EF7;&#x4EBA;&#x7C7B;&#x7684;&#x5417;&#xFF1F;&#x4F5C;&#x8005;&#x8BF4;&#xFF0C;&#x201C;&#x8FD9;&#x4E9B;&#x4EBA;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x5FEB;&#x6D3B;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x53E9;&#x95EE;&#x4ED6;&#x4EEC;&#x7684;&#x5FC3;&#x5E95;&#xFF0C;&#x5374;&#x53EF;&#x4EE5;&#x542C;&#x89C1;&#x60B2;&#x51C9;&#x7684;&#x56DE;&#x54CD;&#x201D;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x542C;&#x89C1;&#x60B2;&#x51C9;&#x7684;&#x56DE;&#x54CD;&#x5462;&#xFF1F;&#x5927;&#x6982;&#x662F;&#x4EBA;&#x7C7B;&#x4E30;&#x5BCC;&#x800C;&#x6709;&#x8DA3;&#x7684;&#x4E2A;&#x6027;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x5C1D;&#x8BD5;&#x6311;&#x6218;&#x4E16;&#x4FD7;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x7ED3;&#x679C;&#x88AB;&#x4E16;&#x4FD7;&#x6253;&#x8D25;&#x800C;&#x53D8;&#x5F97;&#x4E16;&#x4FD7;&#xFF0C;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x7B80;&#x76F4;&#x5C31;&#x50CF;&#x662F;&#xFF0C;&#x82F1;&#x96C4;&#x6740;&#x6B7B;&#x9B54;&#x738B;&#x53C8;&#x53D8;&#x6210;&#x9B54;&#x738B;&#x7684;&#x6545;&#x4E8B;&#x7684;&#x7FFB;&#x7248;&#x3002;&#x201C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5730;&#x4F4D;&#x90FD;&#x63D0;&#x9AD8;&#xFF0C;&#x7B49;&#x540C;&#x4E8E;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5730;&#x4F4D;&#x90FD;&#x4E0B;&#x964D;&#x3002;&#x4EBA;&#x7C7B;&#x4E0D;&#x518D;&#x505A;&#x8BA9;&#x81EA;&#x5DF1;&#x59D4;&#x5C48;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6B63;&#x662F;&#x4E2A;&#x4EBA;&#x529B;&#x91CF;&#x53D8;&#x5F3A;&#x7684;&#x8BC1;&#x660E;&#xFF1B;&#x51E0;&#x4E4E;&#x4E0D;&#x518D;&#x63D2;&#x624B;&#x522B;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53CD;&#x800C;&#x662F;&#x7FA4;&#x4F53;&#x529B;&#x91CF;&#x53D8;&#x5F31;&#x7684;&#x8BC1;&#x660E;&#x201D;&#x3002;&#x4E00;&#x70B9;&#x4E8F;&#x90FD;&#x4E0D;&#x613F;&#x610F;&#x5403;&#xFF0C;&#x4E00;&#x70B9;&#x5C0F;&#x4FBF;&#x5B9C;&#x5C31;&#x8981;&#x5360;&#xFF0C;&#x65E0;&#x4E00;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x4E2A;&#x4EBA;&#x610F;&#x5FD7;&#x7684;&#x5F3A;&#x5316;&#xFF0C;&#x53EF;&#x4EBA;&#x4E0E;&#x4EBA;&#x95F4;&#x7684;&#x7A7A;&#x95F4;&#x8D8A;&#x6765;&#x8D8A;&#x72ED;&#x7A84;&#xFF0C;&#x65E5;&#x76CA;&#x7A98;&#x8FEB;&#xFF0C;&#x4E3A;&#x4E86;&#x6269;&#x5145;&#x81EA;&#x5DF1;&#x81A8;&#x80C0;&#x5230;&#x8FD1;&#x4E4E;&#x7206;&#x70B8;&#x3002;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x90A3;&#x70B9;&#x7A7A;&#x95F4;&#xFF0C;&#x662F;&#x4E00;&#x5207;&#x75DB;&#x82E6;&#x7684;&#x6839;&#x6E90;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x8FD8;&#x4E0D;&#x7B97;&#x4F5C;&#x60B2;&#x51C9;&#x5417;&#xFF1F;&#x6CA1;&#x6709;&#x8C01;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E0D;&#x5B8C;&#x5168;&#x8BA4;&#x77E5;&#x662F;&#x4EBA;&#x7C7B;&#x5173;&#x7CFB;&#x7684;&#x53CD;&#x5E94;&#x5242;&#xFF0C;&#x75DB;&#x82E6;&#x3001;&#x8BEF;&#x4F1A;&#x3001;&#x504F;&#x89C1;&#x2026;&#x2026;&#x7B49;&#x7B49;&#x7EB7;&#x81F3;&#x6C93;&#x6765;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x4F60;&#x6A21;&#x4EFF;&#x732B;&#x53EB;&#xFF0C;&#x732B;&#x5C31;&#x771F;&#x7684;&#x542C;&#x61C2;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x590F;&#x76EE;&#x5148;&#x751F;&#x5728;&#x540E;&#x8BB0;&#x91CC;&#x5199;&#x9053;&#xFF0C;&#x201C;&#x4E16;&#x4E8B;&#x53D8;&#x8FC1;&#x5C31;&#x50CF;&#x732B;&#x7684;&#x773C;&#x73E0;&#x4E00;&#x6837;&#x53D8;&#x5E7B;&#x83AB;&#x6D4B;&#xFF0C;&#x77ED;&#x77ED;&#x51E0;&#x4E2A;&#x6708;&#x4E16;&#x95F4;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x90A3;&#x6781;&#x4E50;&#x4E16;&#x754C;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x628A;&#x85AA;&#x6C34;&#x82B1;&#x5149;&#x5149;&#x3002;&#x5E74;&#x5E95;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6B63;&#x6708;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x82B1;&#x6735;&#x51CB;&#x8C22;&#xFF0C;&#x65B0;&#x53F6;&#x53C8;&#x751F;&#x3002;&#x4EE5;&#x540E;&#x4E16;&#x754C;&#x5C06;&#x5982;&#x4F55;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4E0D;&#x4E86;&#x89E3;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6C34;&#x7F38;&#x4E2D;&#x732B;&#x7684;&#x77B3;&#x5B54;&#xFF0C;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x51DD;&#x6210;&#x6C38;&#x6052;&#x201D;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x4E16;&#x754C;&#x4F1A;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x8FD9;&#x6837;&#x65E0;&#x5948;&#x4E0B;&#x53BB;&#xFF0C;&#x65F6;&#x95F4;&#x4F1A;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x8FD9;&#x6837;&#x6D88;&#x901D;&#x4E0B;&#x53BB;&#xFF0C;&#x800C;&#x4F60;&#x548C;&#x6211;&#x4F1A;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x5E73;&#x5EB8;&#x4E14;&#x70E6;&#x607C;&#x4E0B;&#x53BB;&#x3002;&#x5047;&#x5982;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x53EA;&#x732B;&#xFF0C;&#x901A;&#x8FC7;&#x77B3;&#x5B54;&#x8BB0;&#x4E0B;&#x4E86;&#x6211;&#x7684;&#x751F;&#x5E73;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x4F1A;&#x5982;&#x4F55;&#x8BC4;&#x4EF7;&#x6211;&#x5462;&#xFF1F;&#x5C31;&#x50CF;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x4E0B;&#x96E8;&#x5929;&#xFF0C;&#x7A81;&#x7136;&#x60F3;&#x5230;&#x67D0;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5355;&#x5355;&#x662F;&#x56E0;&#x4E3A;&#x6015;&#x8FD9;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x4ECE;&#x6B64;&#x518D;&#x6CA1;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x97F3;&#x8BAF;&#x3002;&#x53EF;&#x5355;&#x5355;&#x662F;&#x60F3;&#x5230;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x5462;&#xFF1F;&#x300A;&#x7B11;&#x50B2;&#x6C5F;&#x6E56;&#x300B;&#x91CC;&#x4EE4;&#x72D0;&#x51B2;&#x7387;&#x9886;&#x6C5F;&#x6E56;&#x7FA4;&#x96C4;&#xFF0C;&#x524D;&#x5F80;&#x5C11;&#x6797;&#x5BFA;&#x89E3;&#x6551;&#x88AB;&#x56F0;&#x7684;&#x5723;&#x59D1;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C06;&#x6765;&#x4F1A;&#x6210;&#x4E3A;&#x4ED6;&#x59BB;&#x5B50;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x773C;&#x4E0B;&#x66F4;&#x662F;&#x751F;&#x6B7B;&#x672A;&#x77E5;&#x3001;&#x524D;&#x9014;&#x672A;&#x660E;&#xFF0C;&#x53EF;&#x5728;&#x4E00;&#x7247;&#x5BC2;&#x9759;&#x4E2D;&#x542C;&#x5230;&#x96EA;&#x82B1;&#x7C0C;&#x7C0C;&#x843D;&#x4E0B;&#x65F6;&#xFF0C;&#x4ED6;&#x60F3;&#x5230;&#x7684;&#x5374;&#x662F;&#xFF1A;&#x5C0F;&#x5E08;&#x59B9;&#x4E0D;&#x77E5;&#x8FD9;&#x65F6;&#x5019;&#x4E0D;&#x77E5;&#x5728;&#x5E72;&#x751A;&#x4E48;&#x3002;&#x53CA;&#x81F3;&#x5CB3;&#x6797;&#x73CA;&#x4E3A;&#x6797;&#x5E73;&#x4E4B;&#x6240;&#x6740;&#xFF0C;&#x4E34;&#x6B7B;&#x6258;&#x4ED8;&#x4EE4;&#x72D0;&#x51B2;&#x66FF;&#x5979;&#x7167;&#x987E;&#x5C0F;&#x6797;&#x5B50;&#xFF0C;&#x5185;&#x5FC3;&#x5374;&#x53C8;&#x4E0D;&#x77E5;&#x505A;&#x4F55;&#x611F;&#x60F3;&#x4E86;&#x5427;&#x2026;&#x2026;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://blog.yuanpei.me/posts/352037321/">我是猫，一只特立独行的猫</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/352037321/" rel="external">我是猫，一只特立独行的猫</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/352037321/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/352037321/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/夏目漱石/">夏目漱石</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/我是猫/">我是猫</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/日本文学/">日本文学</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/352037321/&title=《我是猫，一只特立独行的猫》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/352037321/&title=《我是猫，一只特立独行的猫》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/352037321/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《我是猫，一只特立独行的猫》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/352037321/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/352037321/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/2809571715/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">行走在消逝中</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1113828794/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">基于Travis CI实现 Hexo 在 Github 和 Coding 的同步部署</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/352037321/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/352037321/&title=《我是猫，一只特立独行的猫》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/352037321/&title=《我是猫，一只特立独行的猫》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/352037321/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《我是猫，一只特立独行的猫》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/352037321/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/352037321/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/352037321/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
