<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        《仙剑奇侠传六》游戏感言 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;目前游戏主线剧情进行到50%左右，在游戏尚未通关前，我对于这一部游戏的感觉始终是一种说不清道不明的情感，作为仙剑系列中唯一一部，从项目立项到宣传曝光再到游戏上市整个过程中持续关注的游戏，它可以说是承载了无数玩家的期待和祝福。和大部分玩家一样，在游戏曝光的第一时刻我们曾经热火朝天地讨论过各种各样可能的设定、曾经为这部游戏的系统玩家想过各种各样的尝试，然而当我面对这款游戏的时候">
<meta name="keywords" content="Unity3D,游戏,仙剑奇侠传,RPG">
<meta property="og:type" content="article">
<meta property="og:title" content="《仙剑奇侠传六》游戏感言">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1118169753/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;目前游戏主线剧情进行到50%左右，在游戏尚未通关前，我对于这一部游戏的感觉始终是一种说不清道不明的情感，作为仙剑系列中唯一一部，从项目立项到宣传曝光再到游戏上市整个过程中持续关注的游戏，它可以说是承载了无数玩家的期待和祝福。和大部分玩家一样，在游戏曝光的第一时刻我们曾经热火朝天地讨论过各种各样可能的设定、曾经为这部游戏的系统玩家想过各种各样的尝试，然而当我面对这款游戏的时候">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziywspt6oj20ih0pp79n.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziyb3m2gwj20im0ppn1d.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy7lss01j20ih0pk78w.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy4tswz4j211y0lc0yn.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixy4csu7j211y0lc79r.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixba6wumj211y0lb78t.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix85ctsuj20sg0g0gov.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix1dsy93j20hi0a3dh5.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz68kjynqjj20hi0a3dhb.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《仙剑奇侠传六》游戏感言">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;目前游戏主线剧情进行到50%左右，在游戏尚未通关前，我对于这一部游戏的感觉始终是一种说不清道不明的情感，作为仙剑系列中唯一一部，从项目立项到宣传曝光再到游戏上市整个过程中持续关注的游戏，它可以说是承载了无数玩家的期待和祝福。和大部分玩家一样，在游戏曝光的第一时刻我们曾经热火朝天地讨论过各种各样可能的设定、曾经为这部游戏的系统玩家想过各种各样的尝试，然而当我面对这款游戏的时候">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziywspt6oj20ih0pp79n.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">《仙剑奇侠传六》游戏感言</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">《仙剑奇侠传六》游戏感言</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-07-24T09:21:20.000Z" itemprop="datePublished" class="page-time">
  2015-07-24
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/单机游戏/">单机游戏</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#引子"><span class="post-toc-number">1.</span> <span class="post-toc-text">引子</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#一、画面"><span class="post-toc-number">2.</span> <span class="post-toc-text">一、画面</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#二、建模"><span class="post-toc-number">3.</span> <span class="post-toc-text">二、建模</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#三、剧情"><span class="post-toc-number">4.</span> <span class="post-toc-text">三、剧情</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#四、游戏性"><span class="post-toc-number">5.</span> <span class="post-toc-text">四、游戏性</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">6.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-《仙剑奇侠传六》游戏感言" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">《仙剑奇侠传六》游戏感言</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-07-24 09:21:20" datetime="2015-07-24T09:21:20.000Z" itemprop="datePublished">2015-07-24</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/单机游戏/">单机游戏</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        47 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x76EE;&#x524D;&#x6E38;&#x620F;&#x4E3B;&#x7EBF;&#x5267;&#x60C5;&#x8FDB;&#x884C;&#x5230;50%&#x5DE6;&#x53F3;&#xFF0C;&#x5728;&#x6E38;&#x620F;&#x5C1A;&#x672A;&#x901A;&#x5173;&#x524D;&#xFF0C;&#x6211;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E00;&#x90E8;&#x6E38;&#x620F;&#x7684;&#x611F;&#x89C9;&#x59CB;&#x7EC8;&#x662F;&#x4E00;&#x79CD;&#x8BF4;&#x4E0D;&#x6E05;&#x9053;&#x4E0D;&#x660E;&#x7684;&#x60C5;&#x611F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4ED9;&#x5251;&#x7CFB;&#x5217;&#x4E2D;&#x552F;&#x4E00;&#x4E00;&#x90E8;&#xFF0C;&#x4ECE;&#x9879;&#x76EE;&#x7ACB;&#x9879;&#x5230;&#x5BA3;&#x4F20;&#x66DD;&#x5149;&#x518D;&#x5230;&#x6E38;&#x620F;&#x4E0A;&#x5E02;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6301;&#x7EED;&#x5173;&#x6CE8;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x627F;&#x8F7D;&#x4E86;&#x65E0;&#x6570;&#x73A9;&#x5BB6;&#x7684;&#x671F;&#x5F85;&#x548C;&#x795D;&#x798F;&#x3002;&#x548C;&#x5927;&#x90E8;&#x5206;&#x73A9;&#x5BB6;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x6E38;&#x620F;&#x66DD;&#x5149;&#x7684;&#x7B2C;&#x4E00;&#x65F6;&#x523B;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x70ED;&#x706B;&#x671D;&#x5929;&#x5730;&#x8BA8;&#x8BBA;&#x8FC7;&#x5404;&#x79CD;&#x5404;&#x6837;&#x53EF;&#x80FD;&#x7684;&#x8BBE;&#x5B9A;&#x3001;&#x66FE;&#x7ECF;&#x4E3A;&#x8FD9;&#x90E8;&#x6E38;&#x620F;&#x7684;&#x7CFB;&#x7EDF;&#x73A9;&#x5BB6;&#x60F3;&#x8FC7;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x7136;&#x800C;&#x5F53;&#x6211;&#x9762;&#x5BF9;&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x5185;&#x5FC3;&#x5E73;&#x9759;&#x5F97;&#x50CF;&#x4E00;&#x6F6D;&#x6B7B;&#x6C34;&#x3002;&#x6211;&#x4ECA;&#x5929;23&#x5C81;&#xFF0C;&#x521A;&#x521A;&#x4ECE;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x7684;&#x6211;&#x672C;&#x5E94;&#x8BE5;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x8FD9;&#x4E2A;&#x793E;&#x4F1A;&#x5B8C;&#x5168;&#x6539;&#x53D8;&#xFF0C;&#x53EF;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x6211;&#x53D8;&#x4E86;&#x8FD8;&#x662F;&#x4ED9;&#x5251;&#x53D8;&#x4E86;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x6253;&#x5F00;&#x4ED9;&#x5251;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x603B;&#x6709;&#x4E00;&#x79CD;&#x604D;&#x82E5;&#x9694;&#x4E16;&#x7684;&#x604D;&#x60DA;&#x611F;&#x3002;</p>
<a id="more"></a>
<h1 id="&#x5F15;&#x5B50;"><a href="#&#x5F15;&#x5B50;" class="headerlink" title="&#x5F15;&#x5B50;"></a>&#x5F15;&#x5B50;</h1><p>&#x2003;&#x2003;&#x66FE;&#x7ECF;&#xFF0C;&#x4ED9;&#x5251;&#x4E00;&#x7684;&#x6E38;&#x620F;&#x5F00;&#x59CB;&#x754C;&#x9762;&#x662F;&#x7B80;&#x5355;&#x5230;&#x4E0D;&#x80FD;&#x518D;&#x7B80;&#x5355;&#x7684;&#x7AF9;&#x7B80;&#x3001;&#x9152;&#x846B;&#x82A6;&#x3001;&#x5251;&#xFF0C;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5C31;&#x4ED7;&#x5251;&#x6C5F;&#x6E56;&#x7684;&#x884C;&#x4FA0;&#x4ED7;&#x4E49;&#x3001;&#x767D;&#x4E91;&#x82CD;&#x72D7;&#x7684;&#x9189;&#x68A6;&#x4EBA;&#x751F;&#x548C;&#x5F90;&#x5F90;&#x9053;&#x6765;&#x7684;&#x6E29;&#x6696;&#x6545;&#x4E8B;&#xFF1B;&#x66FE;&#x7ECF;&#xFF0C;&#x4ED9;&#x5251;&#x4E09;&#x7684;&#x300A;&#x5FA1;&#x5251;&#x6C5F;&#x6E56;&#x300B;&#x4F34;&#x968F;&#x7740;&#x4E91;&#x5C71;&#x96FE;&#x7ED5;&#x7684;&#x8700;&#x5C71;&#x50CF;&#x4E00;&#x5E45;&#x9057;&#x7559;&#x5728;&#x5386;&#x53F2;&#x6DF1;&#x5904;&#x7684;&#x5377;&#x8F74;&#x7F13;&#x7F13;&#x5730;&#x6253;&#x5F00;&#x8BA9;&#x4EBA;&#x4E0D;&#x7531;&#x5F97;&#x5FC3;&#x5934;&#x4E00;&#x9635;&#x60CA;&#x8273;&#xFF1B;&#x66FE;&#x7ECF;&#xFF0C;&#x4ED9;&#x4E09;&#x5916;&#x4F20;&#x5F00;&#x5934;&#x8700;&#x5C71;&#x638C;&#x95E8;&#x5927;&#x6218;&#x72FC;&#x5996;&#xFF0C;&#x65E0;&#x6570;&#x9053;&#x5251;&#x6C14;&#x51DD;&#x6210;&#x7684;&#x5251;&#x67F1;&#x4ECE;&#x5929;&#x800C;&#x964D;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x611F;&#x53D7;&#x5230;&#x90A3;&#x79CD;&#x4ED9;&#x5BB6;&#x9053;&#x6CD5;&#x7684;&#x7384;&#x5999;&#x548C;&#x5947;&#x5E7B;&#xFF1B;&#x66FE;&#x7ECF;&#xFF0C;&#x4ED9;&#x5251;&#x56DB;&#x7684;&#x300A;&#x56DE;&#x68A6;&#x6E38;&#x4ED9;&#x300B;&#x5728;&#x8033;&#x7554;&#x54CD;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x5377;&#x4E91;&#x53F0;&#x50CF;&#x6735;&#x6E05;&#x65B0;&#x8131;&#x4FD7;&#x7684;&#x83B2;&#x82B1;&#x9759;&#x9759;&#x5730;&#x76DB;&#x5F00;&#x5374;&#x5728;&#x6700;&#x540E;&#x4E00;&#x523B;&#x660E;&#x767D;&#x8FD9;&#x6735;&#x83B2;&#x82B1;&#x662F;&#x4E00;&#x5207;&#x60B2;&#x5267;&#x7684;&#x5F00;&#x59CB;&#xFF1B;&#x66FE;&#x7ECF;&#xFF0C;&#x4ED9;&#x5251;&#x4E94;&#x524D;&#x4F20;&#x7684;&#x660E;&#x5DDE;&#x7801;&#x5934;&#x5728;&#x5915;&#x9633;&#x548C;&#x665A;&#x971E;&#x7684;&#x4EA4;&#x76F8;&#x8F89;&#x6620;&#x4E2D;&#xFF0C;&#x747E;&#x8F69;&#x548C;&#x7455;&#x59B9;&#x4F9D;&#x504E;&#x5728;&#x4E00;&#x8D77;&#x770B;&#x7740;&#x843D;&#x971E;&#x4E0E;&#x5B64;&#x9E5C;&#x9F50;&#x98DE;&#x662F;&#x6C38;&#x8FDC;&#x7684;&#x6E29;&#x99A8;&#x753B;&#x9762;&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x53EF;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x8BA9;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x7247;&#x7ECF;&#x8FC7;&#x9AD8;&#x65AF;&#x6A21;&#x7CCA;&#x7684;&#x7EFF;&#x6CB9;&#x6CB9;&#x7684;&#x8349;&#x5730;&#xFF0C;&#x6CA1;&#x9519;&#xFF01;&#x5B83;&#x771F;&#x7684;&#x662F;&#x4E00;&#x7247;&#x7EFF;&#x6CB9;&#x6CB9;&#x7684;&#x8349;&#x5730;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F53;&#x6211;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x5FC3;&#x91CC;&#x95EE;&#x81EA;&#x5DF1;&#xFF1A;&#x8FD9;&#x771F;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x53E4;&#x98CE;&#x7684;&#x4ED9;&#x4FA0;/&#x6B66;&#x4FA0;&#x6E38;&#x620F;&#x5417;&#xFF1F;&#x5728;&#x4ED9;&#x5251;&#x5947;&#x4FA0;&#x4F20;&#x516D;&#x7684;&#x5BA3;&#x4F20;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x5728;&#x6211;&#x7684;QQ&#x7FA4;&#x91CC;&#x3001;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x4E2D;&#x4E0D;&#x65AD;&#x5411;&#x5927;&#x5BB6;&#x8F93;&#x9001;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x4ED9;&#x5251;&#x516D;&#x662F;&#x4ED9;&#x5251;&#x5947;&#x4FA0;&#x4F20;&#x7CFB;&#x5217;&#x4E8C;&#x5341;&#x5E74;&#x7684;&#x7A81;&#x7834;&#x4E4B;&#x4F5C;&#xFF0C;&#x5B83;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x8BA9;&#x5927;&#x5BB6;&#x5931;&#x671B;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x4E0D;&#x9057;&#x4F59;&#x529B;&#x5730;&#x548C;&#x6E38;&#x620F;&#x5708;&#x5B50;&#x91CC;&#x4F7F;&#x7528;Unity3D&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x7684;&#x670B;&#x53CB;&#x4EEC;&#x8BF4;&#xFF0C;&#x770B;&#xFF0C;&#x4ED9;&#x5251;&#x516D;&#x662F;&#x4F7F;&#x7528;Unity3D&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x753B;&#x9762;&#x662F;&#x5386;&#x4EE3;&#x6E38;&#x620F;&#x4E2D;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x5B83;&#x7EC8;&#x4E8E;&#x8981;&#x5C1D;&#x8BD5;&#x5373;&#x65F6;&#x6218;&#x6597;&#x4E86;&#x3002;&#x7136;&#x800C;&#x5F53;&#x6211;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4F1A;&#x88AB;&#x6253;&#x8138;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x6211;&#x9762;&#x5BF9;&#x63A5;&#x53D7;&#x4E86;&#x6211;&#x7684;&#x8FD9;&#x4E9B;&#x89C2;&#x70B9;&#x7684;&#x670B;&#x53CB;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x6B64;&#x6B21;&#x4ED9;&#x5251;&#x516D;&#x6E38;&#x620F;&#x4F18;&#x5316;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x505A;&#x8BE6;&#x7EC6;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x66F4;&#x4E0D;&#x60F3;&#x4E3A;&#x5317;&#x8F6F;&#x6D17;&#x767D;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x4ED9;&#x5251;&#x5947;&#x4FA0;&#x4F20;&#x516D;&#x4E4B;&#x6CF0;&#x5766;&#x9668;&#x843D;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x7B11;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x8BF4;Unity3D&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x4E86;&#x3002;&#x6211;&#x627F;&#x8BA4;&#xFF0C;Unity3D&#x662F;&#x4E2A;&#x624B;&#x673A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF1B;&#x6211;&#x627F;&#x8BA4;&#xFF0C;Unity3D&#x5728;&#x753B;&#x9762;&#x8868;&#x73B0;&#x4E0A;&#x65E0;&#x6CD5;&#x548C;UE&#x3001;CE&#x8FD9;&#x4E9B;&#x9876;&#x7EA7;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x76F8;&#x63D0;&#x5E76;&#x8BBA;&#xFF1B;&#x6211;&#x627F;&#x8BA4;&#xFF0C;&#x73B0;&#x5728;&#x56FD;&#x5185;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;Unity3D&#x6559;&#x7A0B;&#x6EE1;&#x5929;&#x98DE;&#xFF1B;&#x6211;&#x627F;&#x8BA4;&#xFF0C;Unity3D&#x5165;&#x95E8;&#x5FEB;&#x3001;&#x6210;&#x672C;&#x4F4E;&#x3001;&#x8DE8;&#x5E73;&#x53F0;&#x6027;&#x80FD;&#x5F3A;&#x2026;&#x2026;.&#x53EF;&#x662F;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x662F;&#x4F60;&#x4EEC;&#x4E0D;&#x7528;&#x5FC3;&#x505A;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x7406;&#x7531;&#x597D;&#x5417;&#xFF1F;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x6280;&#x672F;&#x4ECE;&#x6765;&#x90FD;&#x6CA1;&#x6709;&#x4F18;&#x52A3;&#x4E4B;&#x5206;&#xFF0C;&#x771F;&#x6B63;&#x8BA9;&#x6280;&#x672F;&#x4F53;&#x73B0;&#x51FA;&#x5DEE;&#x5F02;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x7684;&#x4EBA;&#x3002;Unity3D&#x672C;&#x8D28;&#x4E0A;&#x5E76;&#x975E;&#x662F;&#x4E00;&#x4E2A;&#x5DEE;&#x52B2;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF0C;&#x6240;&#x4EE5;&#x4EE5;&#x5F15;&#x64CE;&#x6765;&#x8BBA;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x6210;&#x8D25;&#x662F;&#x4E0D;&#x6070;&#x5F53;&#x800C;&#x4E14;&#x4E0D;&#x5E94;&#x8BE5;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;Unity3D&#x5F00;&#x53D1;&#x7684;&#x6E38;&#x620F;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x76F8;&#x5F53;&#x7684;&#x591A;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x300A;&#x84B8;&#x6C7D;&#x4E4B;&#x57CE;&#x300B;&#x3001;&#x300A;&#x592A;&#x7A7A;&#x5192;&#x9669;&#x300B;&#x3001;&#x300A;&#x65B0;&#x4ED9;&#x5251;OL&#x300B;<a href="http://www.zhihu.com/question/20998208" target="_blank" rel="noopener">&#x7B49;&#x7B49;</a>&#x4EE5;&#x53CA;&#x65E0;&#x6570;&#x7684;&#x624B;&#x673A;&#x6E38;&#x620F;&#x3002;&#x53EF;&#x662F;&#x80FD;&#x5C06;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x7528;&#x5230;&#x5982;&#x6B64;&#x5730;&#x6B65;&#x7684;&#x6050;&#x6015;&#x53EA;&#x6709;&#x4ED9;&#x5251;&#x516D;&#x5427;&#xFF01;&#x76EE;&#x524D;Unity3D&#x7684;&#x6388;&#x6743;&#x65B9;&#x5F0F;&#x662F;&#x6536;&#x5165;&#x8D85;&#x8FC7;3&#x4E07;&#x7F8E;&#x5143;&#x5373;18&#x4E07;&#x4EBA;&#x6C11;&#x5E01;&#x5DE6;&#x53F3;&#x9700;&#x8981;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x6BD4;&#x4F8B;&#x5411;Unity3D&#x5B98;&#x65B9;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x6B21;&#x7684;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x662F;&#x5426;&#x4F1A;&#x5BF9;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x9500;&#x91CF;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x6050;&#x6015;&#x5B98;&#x65B9;&#x90FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x5B58;&#x5728;&#x5F71;&#x54CD;Unity3D&#x5F15;&#x64CE;&#x58F0;&#x8A89;&#x7684;&#x95EE;&#x9898;&#x5427;&#xFF01;</p>
<h1 id="&#x4E00;&#x3001;&#x753B;&#x9762;"><a href="#&#x4E00;&#x3001;&#x753B;&#x9762;" class="headerlink" title="&#x4E00;&#x3001;&#x753B;&#x9762;"></a>&#x4E00;&#x3001;&#x753B;&#x9762;</h1><p>&#x2003;&#x2003;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x8BF4;&#x6E38;&#x620F;&#x753B;&#x9762;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x4E2D;&#x4FDD;&#x8BC1;&#x7279;&#x6548;&#x5168;&#x5F00;&#xFF0C;&#x603B;&#x4E4B;&#x5728;&#x6211;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x770B;&#x8D77;&#x6765;&#x6574;&#x4E2A;&#x753B;&#x9762;&#x6709;&#x4E00;&#x79CD;&#x7CCA;&#x7CCA;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8FDC;&#x666F;&#x770B;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x552F;&#x7F8E;&#x58EE;&#x4E3D;&#xFF0C;&#x7136;&#x800C;&#x5F53;&#x6211;&#x5C06;&#x955C;&#x5934;&#x62C9;&#x8FD1;&#x7684;&#x65F6;&#x5019;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x8FD8;&#x662F;&#x4E0D;&#x8981;&#x8BA1;&#x8F83;&#x4ED9;&#x5251;&#x5947;&#x4FA0;&#x4F20;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x753B;&#x9762;&#x4E86;&#x5427;&#xFF01;&#x53EF;&#x662F;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x7406;&#x89E3;&#xFF0C;&#x4F5C;&#x4E3A;&#x4ED9;&#x5251;&#x5947;&#x4FA0;&#x4F20;&#x7CFB;&#x5217;&#x7684;&#x597D;&#x5144;&#x5F1F;&#x8F69;&#x8F95;&#x5251;&#x7CFB;&#x5217;&#x5728;&#x4F7F;&#x7528;Unity3D&#x5236;&#x4F5C;&#x4E86;&#x4E24;&#x6B3E;&#x6E38;&#x620F;&#x8FD9;&#x6837;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x5317;&#x8F6F;&#x4E3A;&#x4EC0;&#x4E48;&#x5C31;&#x4E0D;&#x80AF;&#x5411;DOMO&#x5C0F;&#x7EC4;&#x5B66;&#x4E60;&#x54EA;&#x6015;&#x501F;&#x9274;&#x76F8;&#x5173;&#x7684;&#x7ECF;&#x9A8C;&#x5462;&#xFF1F;&#x867D;&#x7136;&#x300A;&#x8F69;&#x8F95;&#x5251;&#x516D;&#x300B;&#x6076;&#x540D;&#x5728;&#x5916;&#x3001;&#x300A;&#x7A79;&#x4E4B;&#x6249;&#x300B;&#x9500;&#x91CF;&#x4E0D;&#x4F73;&#xFF0C;&#x53EF;&#x662F;&#x6700;&#x8D77;&#x7801;&#x4EBA;&#x5BB6;&#x7684;&#x6E38;&#x620F;&#x7684;&#x753B;&#x9762;&#x505A;&#x5F97;&#x76F8;&#x5BF9;&#x4ED9;&#x5251;&#x516D;&#x8981;&#x597D;&#x5F88;&#x591A;&#x597D;&#x4E0D;&#x597D;&#xFF0C;&#x51B5;&#x4E14;&#x4EBA;&#x5BB6;&#x5728;&#x5904;&#x7406;&#x4EBA;&#x7269;&#x548C;&#x573A;&#x666F;&#x65F6;&#x523B;&#x610F;&#x52A0;&#x5F3A;&#x4E86;&#x4EBA;&#x7269;&#x9762;&#x90E8;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x901A;&#x8FC7;&#x6E32;&#x67D3;&#x666F;&#x6DF1;&#x548C;&#x6574;&#x4F53;&#x7684;&#x5149;&#x7167;&#x4F7F;&#x5F97;&#x753B;&#x9762;&#x900F;&#x9732;&#x51FA;&#x4E00;&#x79CD;&#x552F;&#x7F8E;&#x7684;&#x98CE;&#x683C;&#x3002;&#x53EF;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x5462;&#xFF1F;&#x4ED9;&#x5251;&#x516D;&#x4E2D;&#x505A;&#x5F97;&#x6700;&#x597D;&#x770B;&#x7684;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x4EBA;&#x7269;&#x7684;&#x8138;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5317;&#x8F6F;&#x662F;&#x4E0D;&#x662F;&#x5728;&#x6709;&#x610F;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#xFF1A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x770B;&#x8138;&#x3001;&#x9760;&#x8138;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x53D1;&#x73B0;&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x9664;&#x4E86;&#x8138;&#x6BD4;&#x8F83;&#x6F02;&#x4EAE;&#x4EE5;&#x5916;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x70B9;&#xFF0C;&#x53EF;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x7269;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x5408;&#x3001;&#x5E74;&#x9F84;&#x4ED6;&#x7684;&#x9762;&#x90E8;&#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x554A;&#xFF0C;&#x5317;&#x8F6F;&#x4F60;&#x628A;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x8138;&#x90FD;&#x505A;&#x7684;&#x8FD9;&#x4E48;&#x6F02;&#x4EAE;&#xFF0C;&#x662F;&#x60F3;&#x544A;&#x8BC9;&#x73A9;&#x5BB6;&#x90FD;&#x4E0D;&#x7528;&#x53BB;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#x3001;&#x53EA;&#x8981;&#x62FC;&#x8138;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x5417;&#xFF1F;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4F7F;&#x7528;&#x56FD;&#x5916;&#x7684;3A&#x7EA7;&#x522B;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x5982;UE&#x3001;CE&#x7B49;&#x6765;&#x8868;&#x73B0;&#x8FD9;&#x79CD;&#x4E2D;&#x56FD;&#x53E4;&#x5178;&#x7F8E;&#x7684;&#x573A;&#x666F;&#x662F;&#x5426;&#x5408;&#x9002;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5F15;&#x64CE;&#x66F4;&#x9002;&#x5408;&#x5199;&#x5B9E;&#x7684;&#x6E32;&#x67D3;&#xFF0C;&#x800C;&#x65E0;&#x7591;&#x4E2D;&#x56FD;&#x7684;&#x53E4;&#x98CE;&#x6E38;&#x620F;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x610F;&#x8574;&#x4E0A;&#x7684;&#x7F8E;&#x611F;&#x7684;&#x6E32;&#x67D3;&#x3002;&#x7136;&#x800C;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x300B;&#x548C;&#x300A;&#x8F69;&#x8F95;&#x5251;&#x300B;&#x5728;&#x8868;&#x73B0;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x65F6;&#x5904;&#x7406;&#x7684;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#xFF0C;&#x8FD9;&#x6B21;&#x7684;&#x6240;&#x6709;&#x573A;&#x666F;&#x4E2D;&#x6211;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x7684;&#x662F;&#x4E0E;&#x9752;&#x5C71;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x8272;&#x5F69;&#x8FD0;&#x7528;&#x53EF;&#x4EE5;&#x8BA9;&#x73A9;&#x5BB6;&#x5F88;&#x660E;&#x663E;&#x7684;&#x533A;&#x5206;&#x5F00;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x53CD;&#x89C2;&#x5FD8;&#x5C18;&#x5BF0;&#x3001;&#x5F52;&#x589F;&#x3001;&#x5929;&#x6674;&#x4E4B;&#x6D77;&#x3001;&#x996E;&#x9A6C;&#x6CB3;&#x7B49;&#x573A;&#x666F;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x7684;&#x8272;&#x5F69;&#x8F83;&#x4E3A;&#x63A5;&#x8FD1;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x73A9;&#x5BB6;&#x63A2;&#x7D22;&#x8FF7;&#x5BAB;&#x7684;&#x65F6;&#x5019;&#x5E38;&#x5E38;&#x641E;&#x6655;&#xFF0C;&#x518D;&#x8F85;&#x4EE5;&#x672C;&#x6B21;&#x6E38;&#x620F;&#x4E2D;&#x90A3;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x76F8;&#x673A;&#x89C6;&#x89D2;&#xFF0C;&#x63A2;&#x7D22;&#x8FF7;&#x5BAB;&#x7684;&#x4E50;&#x8DA3;&#x771F;&#x662F;&#x5927;&#x5927;&#x7684;&#x589E;&#x5F3A;&#x554A;&#xFF01;&#x6211;&#x4E0D;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x5317;&#x8F6F;&#x8FDE;&#x5168;&#x5C40;&#x5149;&#x7167;&#x8FD9;&#x79CD;&#x53EA;&#x9700;&#x8981;&#x7B80;&#x5355;&#x8BBE;&#x7F6E;&#x4E0B;&#x53C2;&#x6570;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x4E0D;&#x613F;&#x610F;&#x7528;&#xFF0C;&#x5374;&#x8981;&#x82B1;&#x5927;&#x529B;&#x6C14;&#x5728;&#x89D2;&#x8272;&#x7684;&#x5934;&#x9876;&#x4E0A;&#x653E;&#x7F6E;&#x70B9;&#x5149;&#x6E90;&#xFF0C;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x653E;&#x7F6E;&#x70B9;&#x5149;&#x6E90;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x89D2;&#x8272;&#x7684;&#x5934;&#x9876;&#x4EAE;&#x4E00;&#x4E0B;&#x3001;&#x8138;&#x767D;&#x4E00;&#x70B9;&#x5417;&#xFF1F;&#x66F4;&#x4E0D;&#x8981;&#x8BF4;&#x542F;&#x9B42;&#x90AA;&#x6559;&#x603B;&#x575B;&#x91CC;&#x90A3;&#x4E9B;&#x652F;&#x6301;&#x5B9E;&#x65F6;&#x53CD;&#x5C04;&#x7684;&#x6C34;&#x6676;&#x77F3;&#x4E86;&#xFF1F;&#x96BE;&#x9053;&#x4F60;&#x5B81;&#x53EF;&#x8981;&#x8FD9;&#x79CD;&#x534E;&#x800C;&#x4E0D;&#x5B9E;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x90FD;&#x8981;&#x8BA9;&#x73A9;&#x5BB6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8017;&#x8D39;&#x8D44;&#x6E90;&#x53BB;&#x652F;&#x6301;&#x5B83;&#x5417;&#xFF1F;&#x666F;&#x5B89;&#x6B63;&#x6B66;&#x76DF;&#x95E8;&#x524D;&#x7684;&#x90A3;&#x6761;&#x6CB3;&#x7684;&#x679C;&#x51BB;&#x7EFF;&#x6750;&#x8D28;&#x5C31;&#x4E0D;&#x80FD;&#x8BA9;&#x7F8E;&#x672F;&#x60F3;&#x529E;&#x6CD5;&#x66FF;&#x6362;&#x4E0B;&#x5417;&#xFF1F;&#x96BE;&#x9053;&#x6015;&#x73A9;&#x5BB6;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x662F;&#x4F7F;&#x7528;&#x7684;Unity3D&#x91CC;&#x7684;&#x6807;&#x51C6;&#x6750;&#x8D28;&#xFF1F;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x6E38;&#x620F;&#x4E2D;&#x4E3B;&#x89D2;&#x53CA;&#x914D;&#x89D2;&#x7684;&#x9762;&#x90E8;&#x622A;&#x56FE;&#xFF0C;&#x989C;&#x503C;&#x7206;&#x8868;&#x554A;&#xFF01;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziywspt6oj20ih0pp79n.jpg" alt="&#x679C;&#x7136;&#x8FD8;&#x662F;&#x770B;&#x8138;&#x7684;" title>
                </div>
                <div class="image-caption">&#x679C;&#x7136;&#x8FD8;&#x662F;&#x770B;&#x8138;&#x7684;</div>
            </figure>
<p>&#x4E0B;&#x9762;&#x662F;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x4E8C;&#x300B;&#x3001;&#x300A;&#x7A79;&#x4E4B;&#x6249;&#x300B;&#x3001;&#x300A;&#x4ED9;&#x5251;&#x516D;&#x300B;&#x4E09;&#x90E8;&#x6E38;&#x620F;&#x5728;&#x7279;&#x6548;&#x5168;&#x5F00;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x753B;&#x9762;&#x8868;&#x73B0;&#xFF0C;&#x76F8;&#x4FE1;&#x9AD8;&#x4E0B;&#x7ACB;&#x5224;&#x4E86;&#x5427;&#xFF01;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziyb3m2gwj20im0ppn1d.jpg" alt="&#x53E4;&#x5251;&#x5947;&#x8C2D;2&#x6700;&#x9AD8;&#x753B;&#x8D28;](https://ws1.sinaimg.cn/large/4c36074fly1fziyubagmjj20im0ppn3x.jpg)![&#x7A79;&#x4E4B;&#x6249;&#x6700;&#x9AD8;&#x753B;&#x8D28;" title>
                </div>
                <div class="image-caption">&#x53E4;&#x5251;&#x5947;&#x8C2D;2&#x6700;&#x9AD8;&#x753B;&#x8D28;](https://ws1.sinaimg.cn/large/4c36074fly1fziyubagmjj20im0ppn3x.jpg)![&#x7A79;&#x4E4B;&#x6249;&#x6700;&#x9AD8;&#x753B;&#x8D28;</div>
            </figure>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy7lss01j20ih0pk78w.jpg" alt="&#x4ED9;&#x5251;&#x516D;&#x6700;&#x9AD8;&#x753B;&#x8D28;" title>
                </div>
                <div class="image-caption">&#x4ED9;&#x5251;&#x516D;&#x6700;&#x9AD8;&#x753B;&#x8D28;</div>
            </figure>
<h1 id="&#x4E8C;&#x3001;&#x5EFA;&#x6A21;"><a href="#&#x4E8C;&#x3001;&#x5EFA;&#x6A21;" class="headerlink" title="&#x4E8C;&#x3001;&#x5EFA;&#x6A21;"></a>&#x4E8C;&#x3001;&#x5EFA;&#x6A21;</h1><p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x8BF4;&#x8BF4;&#x5EFA;&#x6A21;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4F7F;&#x7528;disunity&#x5BF9;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x90E8;&#x5206;.unity3d&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x5305;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x6BCF;&#x4E2A;&#x6A21;&#x578B;&#x6587;&#x4EF6;&#x7684;&#x5305;&#x5927;&#x6982;&#x5728;10M&#x5DE6;&#x53F3;&#xFF0C;&#x50CF;&#x592A;&#x7A7A;&#x6B65;&#x3001;&#x5FAA;&#x73AF;&#x52A8;&#x753B;&#x3001;&#x7A7F;&#x6A21;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x6211;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x6BCF;&#x6B21;&#x8BF4;&#x4E86;&#x4F60;&#x4EEC;&#x53C8;&#x4E0D;&#x6253;&#x7B97;&#x6539;&#x3002;&#x6211;&#x5C31;&#x6765;&#x8BF4;&#x8BF4;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x91CC;&#x7684;&#x6A21;&#x578B;&#x5427;&#xFF1F;&#x5BF9;&#x4E09;&#x4E2A;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x5305;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x8FD9;&#x4E09;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x5355;&#x4F4D;&#x90FD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5728;scale&#x4E3A;1&#x3001;1&#x3001;1&#x7684;&#x65F6;&#x5019;&#x4E09;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF1B;&#x5176;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x89D2;&#x5EA6;&#x9700;&#x8981;&#x624B;&#x52A8;&#x6539;&#x4E3A;-90,180,0&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5EFA;&#x6A21;&#x7684;&#x65F6;&#x5019;&#x96BE;&#x9053;&#x4E0D;&#x5E94;&#x8BE5;&#x5236;&#x5B9A;&#x76F8;&#x5173;&#x7684;&#x89C4;&#x8303;&#x5417;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x4ECE;Max&#x3001;Maya&#x91CC;&#x5BFC;&#x51FA;&#x5230;FBX&#x5230;Unity3D&#x7684;&#x65F6;&#x5019;&#x96BE;&#x9053;&#x4E0D;&#x5E94;&#x8BE5;&#x89C4;&#x8303;&#x5355;&#x4F4D;&#x3001;&#x89D2;&#x5EA6;&#x548C;&#x4E2D;&#x5FC3;&#x70B9;&#x4F4D;&#x7F6E;&#x5417;&#xFF1F;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x8BA4;&#x4E3A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x5C31;&#x662F;&#x7F8E;&#x672F;&#x628A;&#x6A21;&#x578B;&#x505A;&#x597D;&#x4E86;&#x7ED9;&#x7A0B;&#x5E8F;&#x7528;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7F8E;&#x672F;&#x5728;&#x5EFA;&#x6A21;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x5E94;&#x8BE5;&#x53BB;&#x5173;&#x6CE8;&#x6A21;&#x578B;&#x5728;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x4E0B;&#x7684;&#x6E32;&#x67D3;&#x6548;&#x679C;&#xFF0C;&#x5982;&#x600E;&#x4E48;&#x8C03;&#x6574;&#x6750;&#x8D28;&#x3001;&#x600E;&#x4E48;&#x6253;&#x706F;&#x5149;&#x7B49;&#x7B49;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E0D;&#x5E94;&#x8BE5;&#x63A8;&#x7ED9;&#x7A0B;&#x5E8F;&#x800C;&#x4E14;&#x4E0D;&#x80FD;&#x63A8;&#x7ED9;&#x7A0B;&#x5E8F;&#x3002;&#x4ECE;&#x6A21;&#x578B;&#x8D34;&#x56FE;&#x6765;&#x770B;&#xFF0C;&#x7F8E;&#x672F;&#x60F3;&#x5230;&#x4E86;&#x8BF8;&#x5982;&#x6CD5;&#x7EBF;&#x8D34;&#x56FE;&#x7B49;&#x7B49;&#x7684;&#x6B21;&#x4E16;&#x4EE3;&#x7279;&#x6027;&#xFF0C;&#x53EF;&#x662F;&#x5230;&#x4E86;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x662F;&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x91CC;&#x57FA;&#x672C;&#x6E05;&#x4E00;&#x8272;&#x7684;&#x4F7F;&#x7528;&#x4E86;Diffuse&#x7740;&#x8272;&#x5668;&#xFF0C;&#x90A3;&#x8BF7;&#x95EE;&#x8FD9;&#x6837;&#x505A;&#x8FD9;&#x4E9B;&#x8D34;&#x56FE;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF1F;&#x65E2;&#x7136;&#x4F60;&#x6839;&#x672C;&#x7528;&#x4E0D;&#x5230;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x653E;&#x5230;&#x6E38;&#x620F;&#x91CC;&#xFF1F;&#x800C;&#x4E14;&#x6211;&#x5728;&#x6A21;&#x578B;&#x6587;&#x4EF6;&#x4E2D;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x8BF8;&#x5982;Object01&#x6216;&#x8005;A_toufa&#x3001;B_yifu&#x8FD9;&#x6837;&#x7684;&#x547D;&#x540D;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5BF9;&#x547D;&#x540D;&#x6BD4;&#x8F83;&#x654F;&#x611F;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x51FA;&#x73B0;&#x6C49;&#x8BED;&#x62FC;&#x97F3;&#x5F0F;&#x7684;&#x547D;&#x540D;&#xFF0C;&#x8BF4;&#x660E;&#x5EFA;&#x6A21;&#x7684;&#x4EBA;&#x662F;&#x7279;&#x522B;&#x4E0D;&#x4E13;&#x4E1A;&#x7684;&#x3002;&#x7136;&#x540E;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x8FD9;&#x6B21;&#x6574;&#x4F53;&#x7F8E;&#x672F;&#x98CE;&#x683C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x96BE;&#x9053;&#x5927;&#x5BB6;&#x4E0D;&#x89C9;&#x5F97;&#x5929;&#x6674;&#x4E4B;&#x6D77;&#x7684;&#x5EFA;&#x7B51;&#x98CE;&#x683C;&#x504F;&#x6B27;&#x5F0F;&#x4E86;&#x5417;&#xFF1F;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E2D;&#x56FD;&#x7684;&#x53E4;&#x98CE;&#x6E38;&#x620F;&#x554A;&#xFF01;&#x96BE;&#x9053;&#x5927;&#x5BB6;&#x4E0D;&#x89C9;&#x5F97;&#x76C8;&#x8F89;&#x5821;&#x7684;&#x9053;&#x8DEF;&#x548C;&#x623F;&#x5B50;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x989C;&#x8272;&#x5417;&#xFF1F;&#x6211;&#x5728;&#x5730;&#x56FE;&#x91CC;&#x8F6C;&#x4E86;&#x534A;&#x5929;&#x624D;&#x627E;&#x5230;&#x8DEF;&#x554A;&#xFF01;&#x6B64;&#x6B21;&#x7684;&#x914D;&#x89D2;&#x5982;&#x8D62;&#x65ED;&#x5371;&#x548C;&#x6714;&#x6F29;&#x7684;&#x5EFA;&#x6A21;&#x666E;&#x904D;&#x8981;&#x6BD4;&#x4E3B;&#x89D2;&#x56E2;&#x597D;&#x770B;&#x591A;&#x4E86;&#xFF0C;&#x96BE;&#x9053;&#x4F60;&#x4EEC;&#x8981;&#x5F00;&#x59CB;&#x5B66;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x4E8C;&#x300B;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x6F5C;&#x4F0F;&#x9690;&#x85CF;&#x4E3B;&#x89D2;&#x56E2;&#x5417;&#xFF1F;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4E00;&#x4E2A;2015&#x5E74;&#x7684;&#x6E38;&#x620F;&#x51FA;&#x73B0;NPC&#x914D;&#x97F3;&#x65F6;&#x5634;&#x5DF4;&#x4E0D;&#x52A8;&#x662F;&#x51FA;&#x4E8E;&#x4EC0;&#x4E48;&#x8003;&#x8651;&#xFF1F;NPC&#x4E0D;&#x91CD;&#x8981;&#x5417;&#xFF1F;NPC&#x620F;&#x4EFD;&#x6CA1;&#x6709;&#x4E3B;&#x89D2;&#x56E2;&#x591A;&#x53EF;&#x4EE5;&#x5FCD;&#x3001;&#x957F;&#x5F97;&#x6CA1;&#x6709;&#x4E3B;&#x89D2;&#x56E2;&#x5E05;&#x53EF;&#x4EE5;&#x5FCD;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x5265;&#x593A;&#x4EBA;&#x5BB6;&#x8BF4;&#x8BDD;&#x7684;&#x6743;&#x5229;&#x662F;&#x4EC0;&#x4E48;&#x9B3C;&#xFF1F;&#x8FD8;&#x6709;&#x9A86;&#x9A7C;&#x79FB;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x79FB;&#x52A8;&#x52A8;&#x753B;&#x76F4;&#x63A5;&#x60AC;&#x7A7A;&#x79FB;&#x52A8;&#x53C8;&#x662F;&#x60F3;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x4E00;&#x4E2A;&#x9A86;&#x9A7C;&#x503C;&#x5F97;&#x4F60;&#x4F7F;&#x7528;&#x521A;&#x4F53;&#x8FD9;&#x6837;&#x7684;&#x79FB;&#x52A8;&#x65B9;&#x5F0F;&#x53BB;&#x79FB;&#x52A8;&#x5417;&#xFF1F;&#x5173;&#x4E8E;&#x6E38;&#x620F;&#x8BFB;&#x6761;&#x6162;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x6D4B;&#x8BD5;&#x4E86;&#x4E0B;&#x3001;&#x540C;&#x65F6;&#x627E;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6599;&#x53BB;&#x67E5;&#x9605;&#xFF0C;Unity3D&#x573A;&#x666F;&#x7684;&#x5F02;&#x6B65;&#x52A0;&#x8F7D;&#x7684;&#x786E;&#x6709;&#x5751;&#x5B58;&#x5728;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x76F8;&#x4FE1;&#x53EA;&#x8981;&#x8FD0;&#x7528;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x53EF;&#x4EE5;&#x89C4;&#x907F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x76EE;&#x524D;&#x4EC5;&#x4EC5;&#x89E3;&#x4E86;&#x90E8;&#x5206;AssetBundle&#x5305;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x8FD8;&#x6709;&#x5F85;&#x786E;&#x5B9A;&#xFF0C;&#x7B49;&#x786E;&#x5B9A;&#x540E;&#x4F1A;&#x7EE7;&#x7EED;&#x66F4;&#x65B0;&#x5230;&#x8FD9;&#x91CC;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy4tswz4j211y0lc0yn.jpg" alt="&#x6714;&#x7487;&#x6A21;&#x578B;" title>
                </div>
                <div class="image-caption">&#x6714;&#x7487;&#x6A21;&#x578B;</div>
            </figure>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixy4csu7j211y0lc79r.jpg" alt="&#x8D62;&#x65ED;&#x5371;&#x6A21;&#x578B;" title>
                </div>
                <div class="image-caption">&#x8D62;&#x65ED;&#x5371;&#x6A21;&#x578B;</div>
            </figure>
<h1 id="&#x4E09;&#x3001;&#x5267;&#x60C5;"><a href="#&#x4E09;&#x3001;&#x5267;&#x60C5;" class="headerlink" title="&#x4E09;&#x3001;&#x5267;&#x60C5;"></a>&#x4E09;&#x3001;&#x5267;&#x60C5;</h1><p>&#x2003;&#x2003;&#x5267;&#x60C5;&#x3001;&#x914D;&#x97F3;&#x3001;&#x914D;&#x4E50;&#x8FD9;&#x91CC;&#x653E;&#x5230;&#x4E00;&#x8D77;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x5F15;&#x4EE5;&#x4E3A;&#x8C6A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6B64;&#x6B21;&#x7684;&#x5267;&#x60C5;&#x4E3B;&#x7EBF;&#x6709;&#x4E24;&#x6761;&#xFF0C;&#x5373;&#x53CC;&#x8D8A;&#x8EAB;&#x4E16;&#x4E4B;&#x8C1C;&#x548C;&#x6D1B;&#x5BB6;&#x53CC;&#x751F;&#x5B50;&#x65E9;&#x901D;&#x4E4B;&#x8C1C;&#xFF0C;&#x5C06;&#x8FD9;&#x4E24;&#x6761;&#x7EBF;&#x4EA4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x662F;&#x6A2A;&#x9053;&#x4F17;&#x548C;&#x67F7;&#x6554;&#x95F4;&#x7684;&#x77DB;&#x76FE;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x5B9A;&#x660E;&#x663E;&#x662F;&#x7EE7;&#x627F;&#x4E86;&#x4ED9;&#x4E94;&#x524D;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x53D9;&#x4E8B;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x53D9;&#x4E8B;&#x65B9;&#x5F0F;&#x5E94;&#x8BE5;&#x662F;&#x503C;&#x5F97;&#x80AF;&#x5B9A;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x5230;&#x5E95;&#x662F;&#x4EE5;&#x8C01;&#x4E3A;&#x53D9;&#x4E8B;&#x4E2D;&#x5FC3;&#x7684;&#xFF0C;&#x6B63;&#x5982;&#x4ED9;&#x5251;&#x4E94;&#x662F;&#x4EE5;&#x4E3B;&#x89D2;&#x59DC;&#x4E91;&#x51E1;&#x4E3A;&#x53D9;&#x4E8B;&#x4E2D;&#x5FC3;&#x7684;&#xFF0C;&#x4ED6;&#x6240;&#x770B;&#x5230;&#x7684;&#x4E00;&#x5207;&#x63A8;&#x8FDB;&#x7740;&#x6574;&#x4E2A;&#x5267;&#x60C5;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x518D;&#x5165;&#x4ED9;&#x5251;&#x4E94;&#x524D;&#x4F20;&#x662F;&#x4EE5;&#x4E3B;&#x89D2;&#x590F;&#x4FAF;&#x747E;&#x8F69;&#x4E3A;&#x53D9;&#x4E8B;&#x4E2D;&#x5FC3;&#x7684;&#xFF0C;&#x56F4;&#x7ED5;&#x7740;&#x4E3A;&#x59DC;&#x627F;&#x6D17;&#x5237;&#x51A4;&#x5C48;&#x3001;&#x4E3A;&#x7455;&#x59B9;&#x6CBB;&#x75C5;&#x4E24;&#x6761;&#x4E3B;&#x7EBF;&#x5C06;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x4EBA;&#x6216;&#x4E8B;&#x8054;&#x7CFB;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x53EF;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x6211;&#x771F;&#x6CA1;&#x770B;&#x51FA;&#x6765;&#x662F;&#x4EE5;&#x8C01;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#xFF0C;&#x6574;&#x4E2A;&#x4E3B;&#x89D2;&#x56E2;&#x662F;&#x4ED9;&#x5251;&#x53F2;&#x4E0A;&#x6700;&#x51B7;&#x6F20;&#x3001;&#x6700;&#x5206;&#x88C2;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x5C06;&#x5927;&#x5BB6;&#x8054;&#x7CFB;&#x5230;&#x4E00;&#x8D77;&#x7684;&#x552F;&#x4E00;&#x7406;&#x7531;&#x5C31;&#x662F;&#x5B58;&#x5728;&#x611F;&#x7206;&#x8868;&#x7684;&#x795E;&#x519C;&#x4E5D;&#x6CC9;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5375;&#x7528;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x7AD9;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x7ACB;&#x573A;&#x4E0A;&#x505A;&#x7740;&#x81EA;&#x5DF1;&#x5173;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6BD4;&#x5982;&#x8D8A;&#x4ECA;&#x671D;&#x662F;&#x9738;&#x9053;&#x603B;&#x88C1;&#x201C;&#x53EA;&#x6709;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x53EB;&#x4F60;&#x7948;&#x201D;&#x3002;&#x4E00;&#x8DEF;&#x4E0A;&#x4E0D;&#x662F;&#x6478;&#x5934;&#x5C31;&#x662F;&#x634F;&#x8138;&#xFF0C;&#x53EF;&#x60DC;&#x624B;&#x538B;&#x6839;&#x6CA1;&#x6709;&#x653E;&#x5230;&#x8138;&#x4E0A;&#x53BB;&#xFF1B;&#x518D;&#x6BD4;&#x5982;&#x8D8A;&#x7948;&#x662F;&#x5929;&#x771F;&#x50BB;&#x201C;&#x6211;&#x542C;&#x4ECA;&#x671D;&#x7684;&#x201D;&#x3002;&#x4E00;&#x8DEF;&#x4E0A;&#x5403;&#x9762;&#x5403;&#x5F97;&#x6211;&#x90FD;&#x997F;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x90A3;&#x7897;&#x9E21;&#x86CB;&#x9762;&#x5C31;&#x662F;&#x4E00;&#x5F20;&#x8D34;&#x56FE;&#x554A;&#xFF0C;&#x5403;&#x534A;&#x5929;&#x7A7A;&#x6C14;&#x6700;&#x540E;&#x5C45;&#x7136;&#x5403;&#x5B8C;&#x4E86;&#xFF0C;&#x6211;&#x8981;&#x5411;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x56DB;&#x4F4D;&#x7A0B;&#x5E8F;&#x5458;&#x81F4;&#x656C;&#xFF1B;&#x518D;&#x6BD4;&#x5982;&#x95F2;&#x537F;&#x662F;&#x5178;&#x578B;&#x7684;&#x53CC;&#x6807;&#x72D7;&#xFF0C;&#x4E00;&#x9762;&#x8981;&#x8BA8;&#x597D;&#x8001;&#x5A46;&#x6D1B;&#x662D;&#x8A00;&#x548C;&#x4E16;&#x4F84;&#x5C0F;&#x7EE3;&#x513F;&#xFF0C;&#x4E00;&#x9762;&#x8FD8;&#x8981;&#x505A;&#x51FA;&#x4E00;&#x526F;&#x95F2;&#x9002;&#x6DE1;&#x6CCA;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x90FD;&#x5FCD;&#x4E0D;&#x4F4F;&#x8981;&#x4E3A;&#x4F60;&#x7684;&#x6F14;&#x6280;&#x70B9;&#x8D5E;&#xFF1B;&#x518D;&#x6BD4;&#x5982;&#x8033;&#x5149;&#x7EE3;&#x660E;&#x7EE3;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8981;&#x4E48;&#x662F;&#x7F8E;&#x672F;&#x548C;&#x7B56;&#x5212;&#x6709;&#x4EC7;&#xFF0C;&#x6545;&#x610F;&#x5C06;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51F6;&#x72E0;&#x7684;&#x89D2;&#x8272;&#x753B;&#x6210;&#x751C;&#x7F8E;&#x53EF;&#x4EBA;&#x7684;&#x5973;&#x795E;&#x8303;&#x513F;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x7F16;&#x5267;&#x7ECF;&#x5E38;&#x770B;&#x743C;&#x7476;&#x5267;&#x6BD4;&#x8F83;&#x70ED;&#x8877;&#x4E8E;&#x6253;&#x4EBA;&#x8033;&#x5149;&#xFF0C;&#x4E00;&#x4E2A;&#x6B66;&#x4FA0;&#x6E38;&#x620F;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x6EE1;&#x76F4;&#x63A5;&#x4EAE;&#x5175;&#x5668;&#x4E0D;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x8981;&#x662F;&#x5F53;&#x5E74;&#x6708;&#x5982;&#x88AB;&#x900D;&#x9065;&#x5728;&#x626C;&#x5DDE;&#x57CE;&#x5916;&#x6B3A;&#x8D1F;&#x4E86;&#x76F4;&#x63A5;&#x6253;&#x674E;&#x900D;&#x9065;&#x4E00;&#x4E2A;&#x8033;&#x5149;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x6050;&#x6015;&#x8981;&#x5931;&#x53BB;&#x4E0D;&#x5C11;&#x5FE0;&#x5B9E;&#x7C89;&#x4E1D;&#x5427;;&#x518D;&#x6BD4;&#x5982;&#x8BF4;&#x6280;&#x672F;&#x5B85;&#x5C45;&#x58EB;&#x65B9;&#x8FD9;&#x8D27;&#x603B;&#x662F;&#x4E00;&#x526F;&#x201C;&#x4F60;&#x4EEC;&#x90FD;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x602A;&#x6211;&#x54AF;&#x201D;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x6211;&#x81F3;&#x4ECA;&#x90FD;&#x60F3;&#x4E0D;&#x660E;&#x767D;&#x4ED6;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x5BF9;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x65E2;&#x7136;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x62FF;&#x4F60;&#x5F53;&#x670B;&#x53CB;&#xFF0C;&#x4F60;&#x51ED;&#x4EC0;&#x4E48;&#x8981;&#x4E3A;&#x8FD9;&#x6837;&#x4E00;&#x7FA4;&#x4EBA;&#x727A;&#x7272;&#x8C46;&#x5305;&#x554A;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x559C;&#x6B22;&#x4ED9;&#x5251;&#x8425;&#x9020;&#x7684;&#x90A3;&#x79CD;&#x670B;&#x53CB;&#x95F4;&#x6BD4;&#x8F83;&#x6E29;&#x6696;&#x7684;&#x60C5;&#x611F;&#xFF0C;&#x6BD4;&#x5982;&#x4ED9;&#x5251;&#x56DB;&#x91CC;&#x5C0F;&#x7D2B;&#x82F1;&#x4E00;&#x53E5;&#x201C;&#x627F;&#x541B;&#x6B64;&#x8BFA;&#x5FC5;&#x5B88;&#x4E00;&#x751F;&#x201D;&#x5C31;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x6E29;&#x6696;&#xFF0C;&#x5373;&#x4F7F;&#x4EE5;&#x540E;&#x5927;&#x5BB6;&#x5206;&#x5F00;&#x4E86;&#x5F7C;&#x6B64;&#x7684;&#x5FC3;&#x4E2D;&#x8FD8;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x7275;&#x6302;&#x3002;&#x53EF;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x5462;&#xFF0C;&#x90A3;&#x665A;&#x5927;&#x5BB6;&#x505A;&#x4E00;&#x8D77;&#x8D4F;&#x6708;&#x559D;&#x9152;&#x672C;&#x6765;&#x5E94;&#x8BE5;&#x662F;&#x5F7C;&#x6B64;&#x76F8;&#x4E92;&#x4E86;&#x89E3;&#x548C;&#x8BA4;&#x8BC6;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x7ED3;&#x679C;&#x5927;&#x5BB6;&#x90FD;&#x5FD9;&#x7740;&#x53BB;&#x7EA6;&#x4F1A;&#x4E86;&#xFF0C;&#x7559;&#x4E0B;&#x5C45;&#x5341;&#x65B9;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x54EA;&#x91CC;&#x559D;&#x95F7;&#x9152;&#xFF0C;&#x751A;&#x81F3;&#x4ED6;&#x559D;&#x9189;&#x4E86;&#x9152;&#x5410;&#x9732;&#x5FC3;&#x4E8B;&#x4E3B;&#x89D2;&#x56E2;&#x4E2D;&#x7ADF;&#x7136;&#x65E0;&#x4E00;&#x4EBA;&#x542C;&#x89C1;&#xFF0C;&#x6211;&#x4E25;&#x91CD;&#x6000;&#x7591;&#x7F16;&#x5267;&#x6BCF;&#x6B21;&#x548C;&#x540C;&#x5B66;&#x805A;&#x4F1A;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x90A3;&#x4E2A;&#x62A2;&#x7740;&#x9EA6;&#x514B;&#x98CE;&#x5636;&#x543C;&#x5374;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x6709;&#x4EBA;&#x53BB;&#x5B89;&#x6170;&#x4ED6;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#xFF0C;&#x7F16;&#x5267;&#x554A;&#xFF0C;&#x5DF1;&#x6240;&#x4E0D;&#x6B32;&#x52FF;&#x65BD;&#x4E8E;&#x4EBA;&#x554A;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;RPG&#x6E38;&#x620F;&#x7684;&#x6838;&#x5FC3;&#x5728;&#x4E8E;&#x4EE3;&#x5165;&#x611F;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x4F60;&#x8981;&#x8BA9;&#x73A9;&#x5BB6;&#x89C9;&#x5F97;&#x4ED6;&#x5C31;&#x662F;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x4E3B;&#x89D2;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x73A9;&#x4ED9;&#x5251;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x662F;&#x674E;&#x900D;&#x9065;&#xFF0C;&#x4ED9;&#x4E94;&#x524D;&#x8C22;&#x53D4;&#x5355;&#x6311;&#x59DC;&#x4E16;&#x79BB;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x662F;&#x8C22;&#x53D4;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4EE3;&#x5165;&#x611F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53EF;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x5462;&#xFF0C;&#x5C45;&#x7136;&#x5DE7;&#x5999;&#x7684;&#x907F;&#x5F00;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x641E;&#x5F97;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x90FD;&#x50CF;&#x5728;&#x770B;&#x7535;&#x5F71;&#xFF0C;&#x4E0D;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x53EB;&#x505A;&#x5728;&#x770B;&#x5E7B;&#x706F;&#x7247;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4ED9;&#x516D;&#x662F;&#x4E0D;&#x662F;&#x501F;&#x9274;&#x4E86;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x4E8C;&#x300B;&#x7684;&#x53D9;&#x4E8B;&#x65B9;&#x5F0F;&#xFF0C;&#x6574;&#x4E2A;&#x53D9;&#x8FF0;&#x89C6;&#x89D2;&#x66F4;&#x50CF;&#x662F;&#x4EE5;&#x4E0A;&#x5E1D;&#x4FEF;&#x89C6;&#x4EBA;&#x95F4;&#x7684;&#x89C6;&#x89D2;&#x5728;&#x8BB2;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x4E8C;&#x300B;&#x6210;&#x5C31;&#x4E86;&#x6D41;&#x6708;&#x57CE;&#xFF0C;&#x90A3;&#x4E48;&#x4ED9;&#x5251;&#x516D;&#x4FBF;&#x6210;&#x5C31;&#x4E86;&#x8861;&#x9053;&#x4F17;&#xFF0C;&#x800C;&#x4E14;&#x7F16;&#x5267;&#x89C9;&#x5F97;&#x4E3A;&#x4E86;&#x548C;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x4E8C;&#x300B;&#x62C9;&#x5F00;&#x5DEE;&#x8DDD;&#xFF0C;&#x523B;&#x610F;&#x8BA9;&#x7AD9;&#x5728;&#x5BF9;&#x7ACB;&#x9762;&#x7684;&#x8861;&#x9053;&#x4F17;&#x8BA4;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x9519;&#x8BEF;&#x5E76;&#x5BF9;&#x4E3B;&#x89D2;&#x4E00;&#x884C;&#x4EBA;&#x63D0;&#x4F9B;&#x4E86;&#x8865;&#x507F;&#x3002;&#x6211;&#x627F;&#x8BA4;&#xFF0C;&#x8FD9;&#x8BA9;&#x4ED9;&#x5251;&#x516D;&#x5728;&#x7ACB;&#x610F;&#x4E0A;&#x6709;&#x4E86;&#x6DF1;&#x5EA6;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x4F60;&#x4EEC;&#x7684;&#x4E0D;&#x5BF9;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x73A9;&#x4ED9;&#x5251;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x6BD4;&#x6B66;&#x62DB;&#x4EB2;&#x3001;&#x8700;&#x5C71;&#x5251;&#x6CD5;&#x3001;&#x6797;&#x5BB6;&#x7EDD;&#x5B66;&#x3001;&#x82D7;&#x7586;&#x86CA;&#x672F;&#x3001;&#x4E94;&#x7075;&#x4ED9;&#x672F;&#x6211;&#x4EEC;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x89C9;&#x5F97;&#x5B58;&#x5728;&#x8FDD;&#x548C;&#x611F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x4E1C;&#x65B9;&#x6587;&#x5316;&#x4E2D;&#x5DF2;&#x6709;&#x6216;&#x8005;&#x8BF4;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x8D77;&#x6E90;&#x8FFD;&#x6714;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x662F;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x7F16;&#x5267;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x6574;&#x4E2A;&#x4ED9;&#x5251;&#x516D;&#x9664;&#x4E86;&#x9CB2;&#x9E4F;&#x80FD;&#x591F;&#x5728;&#x5E84;&#x5B50;&#x7684;&#x300A;&#x900D;&#x9065;&#x6E38;&#x300B;&#x4E2D;&#x627E;&#x5230;&#x8BB0;&#x8F7D;&#x4EE5;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x8FD9;&#x4E9B;&#x662F;&#x4E2D;&#x56FD;&#x4F20;&#x7EDF;&#x6587;&#x5316;&#x5B58;&#x5728;&#x7684;&#x5417;&#xFF1F;&#x662F;&#xFF0C;&#x65F6;&#x7A7A;&#x7A7F;&#x8D8A;&#x65E9;&#x5C31;&#x6709;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x56DE;&#x9B42;&#x4ED9;&#x68A6;&#x548C;&#x8840;&#x6FE1;&#x56DE;&#x9B42;&#x90FD;&#x65E0;&#x6CD5;&#x6539;&#x53D8;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF1B;&#x662F;&#xFF0C;&#x5728;&#x5929;&#x4E0A;&#x98DE;&#x65E9;&#x5C31;&#x6709;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x8700;&#x5C71;&#x4ED9;&#x5251;&#x6D3E;&#x5FA1;&#x5251;&#x98DE;&#x884C;&#x65E9;&#x5728;&#x6B66;&#x4FA0;&#x5C0F;&#x8BF4;&#x3001;&#x5FD7;&#x602A;&#x5C0F;&#x8BF4;&#x4E2D;&#x6709;&#x8BB0;&#x8F7D;&#xFF0C;&#x6240;&#x4EE5;&#x8700;&#x5C71;&#x7684;&#x5FA1;&#x5251;&#x672F;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x4E1D;&#x6BEB;&#x7684;&#x8FDD;&#x548C;&#x611F;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x641E;&#x4E2A;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x90FD;&#x672A;&#x5FC5;&#x6709;&#x7684;&#x98DE;&#x884C;&#x5668;&#x662F;&#x4EC0;&#x4E48;&#x9B3C;&#xFF0C;&#x53E4;&#x65F6;&#x5019;&#x5C1D;&#x8BD5;&#x4E0A;&#x5929;&#x7684;&#x4EBA;&#x6700;&#x591A;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x6905;&#x5B50;&#x4E0A;&#x6346;&#x6EE1;&#x706B;&#x836F;&#xFF0C;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x53CD;&#x51B2;&#x529B;&#x98DE;&#x5230;&#x5929;&#x4E0A;&#x53BB;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;&#x79D1;&#x5B66;&#x4E8B;&#x4E1A;&#x732E;&#x8EAB;&#x4E86;&#xFF0C;&#x7F16;&#x5267;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x9B3C;&#x3002;&#x6211;&#x771F;&#x50BB;&#xFF0C;&#x6211;&#x5355;&#x5355;&#x77E5;&#x9053;&#x9ED1;&#x79D1;&#x6280;&#x4F1A;&#x5728;&#x4ED9;&#x5251;&#x5267;&#x91CC;&#x51FA;&#x73B0;&#xFF0C;&#x5374;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x5728;&#x4ED9;&#x5251;&#x6E38;&#x620F;&#x91CC;&#x51FA;&#x73B0;&#xFF0C;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x5FA1;&#x754C;&#x67A2;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x5916;&#x661F;&#x4EBA;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x667A;&#x80FD;&#x624B;&#x673A;&#x3001;&#x5E73;&#x677F;&#x7535;&#x8111;&#x4E0D;&#x8FC7;&#x56DB;&#x4E94;&#x5E74;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x7F16;&#x5267;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x8861;&#x9053;&#x4F17;&#x91CC;&#x7684;&#x4EBA;&#x662F;&#x600E;&#x4E48;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x4ECE;&#x672A;&#x6765;&#x7A7F;&#x8D8A;&#x8FC7;&#x53BB;&#x7684;&#x561B;&#xFF1F;&#x597D;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x8BF7;&#x5141;&#x8BB8;&#x6211;&#x66FF;&#x5386;&#x4EE3;&#x4ED9;&#x5251;&#x4E2D;&#x56E0;&#x4E3A;&#x5267;&#x60C5;&#x9700;&#x8981;&#x800C;&#x727A;&#x7272;&#x7684;&#x5404;&#x4F4D;&#x7537;&#x4E3B;&#x89D2;&#x3001;&#x5973;&#x4E3B;&#x89D2;&#x3001;&#x7537;&#x914D;&#x89D2;&#x3001;&#x5973;&#x914D;&#x89D2;&#x3001;&#x5C0F;&#x602A;&#x4EE5;&#x53CA;Boss&#x8BF4;&#x53E5;&#x516C;&#x9053;&#x8BDD;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x516D;&#x4EE3;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EA4;&#x6362;&#x5B9E;&#x73B0;&#x201C;&#x4E0D;&#x6B7B;&#x201D;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x800C;&#x516D;&#x4EE3;&#x4EE5;&#x524D;&#x7684;&#x5C31;&#x53EA;&#x80FD;&#x9886;&#x4FBF;&#x5F53;&#xFF1F;&#x6211;&#x77E5;&#x9053;&#x7F16;&#x5267;&#x4E00;&#x5B9A;&#x4F1A;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x4E86;&#x5168;&#x65B0;&#x7684;&#x4EE5;&#x795E;&#x519C;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x4E16;&#x754C;&#x89C2;&#xFF0C;&#x53EF;&#x662F;&#x7F16;&#x5267;&#x597D;&#x50CF;&#x5FD8;&#x4E86;&#x795E;&#x519C;&#x548C;&#x5973;&#x5A32;&#x5DEE;&#x4E0D;&#x591A;&#x662F;&#x540C;&#x65F6;&#x5728;&#x5B87;&#x5B99;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x5427;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x4E94;&#x4EE3;&#x7684;Boss&#x9B54;&#x7FF3;&#x6BD4;&#x8F83;&#x51A4;&#x6789;&#xFF0C;&#x5192;&#x7740;&#x505A;&#x574F;&#x4EBA;&#x7684;&#x5371;&#x9669;&#x3001;&#x62FC;&#x7740;&#x547D;&#x4E3A;&#x9B54;&#x754C;&#x627E;&#x6765;&#x4E86;&#x6C34;&#x6E90;&#xFF0C;&#x7ED3;&#x679C;&#x4F60;&#x8BF4;&#x4E5D;&#x6CC9;&#x4E4B;&#x4E00;&#x7684;&#x70ED;&#x6D77;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x6C34;&#x6E90;&#xFF0C;&#x6211;&#x539F;&#x672C;&#x53EA;&#x8981;&#x4F24;&#x5BB3;&#x6D1B;&#x57CB;&#x540D;&#x4E00;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x53D6;&#x5F97;&#x6C34;&#x6E90;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x56E0;&#x4E3A;&#x4F60;&#x8FD9;&#x5947;&#x602A;&#x7684;&#x8BBE;&#x5B9A;&#xFF0C;&#x4E94;&#x4EE3;&#x9020;&#x5C31;&#x4E86;&#x4ED9;&#x5251;&#x53F2;&#x4E0A;&#x6700;&#x5927;&#x7684;&#x727A;&#x7272;&#xFF0C;&#x7F16;&#x5267;&#x554A;&#x7F16;&#x5267;&#x539F;&#x6765;&#x4F60;&#x662F;&#x771F;&#x6B63;&#x7684;&#x5E55;&#x540E;&#x9ED1;&#x624B;&#xFF0C;&#x795E;&#x9A6C;&#x9ED1;&#x5305;&#x5B50;&#x5404;&#x79CD;&#x8FDE;&#x643A;&#x6280;&#x5168;&#x90FD;&#x5F31;&#x7206;&#x4E86;&#x597D;&#x5417;&#xFF1F;&#x4F60;&#x628A;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x6545;&#x4E8B;&#x8BBE;&#x5B9A;&#x5230;&#x4ED9;&#x4E94;&#x524D;&#x7684;&#x4E94;&#x516D;&#x5341;&#x5E74;&#x91CC;&#x96BE;&#x9053;&#x4E0D;&#x62C5;&#x5FC3;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x53D8;&#x5316;&#x8DDF;&#x4E0D;&#x4E0A;&#x4F60;&#x7684;&#x8282;&#x594F;&#x5417;&#xFF1F;&#x7F16;&#x5267;&#x4F60;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x8BA9;&#x8700;&#x5C71;&#x6D3E;&#x8FD9;&#x6837;&#x7684;&#x795E;&#x6743;&#x5929;&#x6388;&#x3001;&#x4F9D;&#x9760;&#x76D8;&#x53E4;&#x4E4B;&#x5FC3;&#x5B58;&#x5728;&#x4E8E;&#x4E16;&#x95F4;&#x7684;&#x6B63;&#x6D3E;&#x7EC4;&#x7EC7;&#x8361;&#x7136;&#x65E0;&#x5B58;&#x554A;&#xFF0C;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x5FA1;&#x5251;&#x672F;&#x90FD;&#x5728;&#x6C5F;&#x6E56;&#x4E0A;&#x5931;&#x4F20;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x6446;&#x660E;&#x4E86;&#x4EE5;&#x540E;&#x4E0D;&#x4F1A;&#x518D;&#x51FA;&#x73B0;&#x8700;&#x5C71;&#x6216;&#x8005;&#x5FA1;&#x5251;&#x672F;&#x7684;&#x8282;&#x594F;&#x5417;&#xFF1F;&#x6211;&#x4E50;&#x610F;&#x770B;&#x5230;&#x4ED9;&#x5251;&#x516D;&#x5728;&#x4E16;&#x754C;&#x89C2;&#x4E0A;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x5E94;&#x8BE5;&#x662F;&#x539F;&#x6765;&#x4EE5;&#x5973;&#x5A32;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x7684;&#x4E00;&#x79CD;&#x8865;&#x5145;&#x800C;&#x975E;&#x63A8;&#x7FFB;&#x554A;&#xFF0C;&#x4F60;&#x63D0;&#x51FA;&#x4E86;&#x795E;&#x519C;&#x4E5D;&#x6CC9;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x8BBE;&#x5B9A;&#x53EF;&#x4EE5;&#x8BA9;&#x4ED9;&#x5251;&#x7684;&#x9898;&#x6750;&#x53D8;&#x5F97;&#x65B0;&#x9896;&#x4E9B;&#xFF0C;&#x7136;&#x5E76;&#x5375;&#x8FD9;&#x4E00;&#x6B21;&#x5C31;&#x628A;&#x4E5D;&#x6CC9;&#x7684;&#x6545;&#x4E8B;&#x5DEE;&#x4E0D;&#x591A;&#x90FD;&#x8BB2;&#x5B8C;&#x4E86;&#xFF0C;&#x662F;&#x60F3;&#x7B49;&#x4E0B;&#x4E00;&#x90E8;&#x6E38;&#x620F;&#x7ACB;&#x9879;&#x7684;&#x65F6;&#x5019;&#x518D;&#x6B21;&#x63A8;&#x7FFB;&#x8FD9;&#x6B21;&#x7684;&#x8BBE;&#x5B9A;&#xFF0C;&#x7F16;&#x5267;&#x554A;&#xFF0C;&#x4F60;&#x5230;&#x5E95;&#x662F;&#x6765;&#x6316;&#x5751;&#x7684;&#x8FD8;&#x662F;&#x6269;&#x5C55;&#x4ED9;&#x5251;&#x7684;&#x6E38;&#x620F;&#x4E16;&#x754C;&#x89C2;&#x7684;&#x554A;&#xFF01;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixba6wumj211y0lb78t.jpg" alt="&#x4ED9;&#x5251;&#x516D;&#x9ED1;&#x79D1;&#x6280;" title>
                </div>
                <div class="image-caption">&#x4ED9;&#x5251;&#x516D;&#x9ED1;&#x79D1;&#x6280;</div>
            </figure>
<h1 id="&#x56DB;&#x3001;&#x6E38;&#x620F;&#x6027;"><a href="#&#x56DB;&#x3001;&#x6E38;&#x620F;&#x6027;" class="headerlink" title="&#x56DB;&#x3001;&#x6E38;&#x620F;&#x6027;"></a>&#x56DB;&#x3001;&#x6E38;&#x620F;&#x6027;</h1><p>&#x2003;&#x2003;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x91CD;&#x70B9;&#x8BF4;&#x8BF4;&#x6E38;&#x620F;&#x6027;&#x3002;&#x4F60;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BF4;&#x6E38;&#x620F;&#x6027;&#x554A;&#xFF1F;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x3001;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x6E38;&#x620F;&#x4E0D;&#x63D0;&#x6E38;&#x620F;&#x6027;&#x4F60;&#x89C9;&#x5F97;&#x63D0;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x6211;&#x60F3;&#x5F3A;&#x8C03;&#x4E00;&#x4E2A;&#x89C2;&#x70B9;&#xFF0C;&#x8BA4;&#x4E3A;&#x4ED9;&#x5251;&#x516D;&#x53EA;&#x8981;&#x5267;&#x60C5;&#x597D;&#x5C31;&#x884C;&#x4E86;&#x7684;&#x670B;&#x53CB;&#x8BF7;&#x5411;&#x59DA;&#x4ED9;&#x5EFA;&#x8BAE;&#x5C06;&#x4ED9;&#x5251;&#x505A;&#x6210;&#x4E00;&#x4E2A;&#x52A8;&#x6F2B;&#x6216;&#x8005;&#x7535;&#x5F71;&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x5BB6;&#x8FDE;&#x81EA;&#x52A8;&#x6218;&#x6597;&#x90FD;&#x4E0D;&#x7528;&#x70B9;&#x4E86;&#x5BF9;&#x5427;&#xFF01;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x7A81;&#x7834;&#x633A;&#x591A;&#x7684;&#xFF0C;&#x53EF;&#x60DC;&#x6CE8;&#x91CD;&#x4E86;&#x91CF;&#x800C;&#x4E0D;&#x6CE8;&#x91CD;&#x8D28;&#xFF0C;&#x8FD9;&#x6837;&#x5E73;&#x5747;&#x4E0B;&#x6765;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x7A81;&#x7834;&#x5176;&#x5B9E;&#x5F88;&#x5C11;&#x5F88;&#x5C11;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x8BF4;&#x5F00;&#x653E;&#x5730;&#x56FE;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5730;&#x56FE;&#x5F00;&#x653E;&#x4E86;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x63A2;&#x7D22;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x591A;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x8981;&#x771F;&#x7684;&#x60F3;&#x505A;&#x597D;&#x5F00;&#x653E;&#x5730;&#x56FE;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x8BA4;&#x771F;&#x7684;&#x53BB;&#x8BBE;&#x8BA1;&#x7A7A;&#x6C14;&#x5899;&#x800C;&#x4E0D;&#x662F;&#x7B49;&#x73A9;&#x5BB6;&#x6389;&#x5751;&#x91CC;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#x6253;&#x5F00;&#x6E38;&#x620F;&#x83DC;&#x5355;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x539F;&#x70B9;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x4EEC;&#x5728;&#x8BBE;&#x7F6E;&#x7A7A;&#x6C14;&#x5899;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x7528;&#x5FC3;&#xFF0C;&#x5728;&#x8FC7;&#x996E;&#x9A6C;&#x6CB3;&#x548C;&#x53BB;&#x843D;&#x65E5;&#x90E8;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x6BD4;&#x5982;&#x7948;&#x59B9;&#x7684;&#x9694;&#x7A7A;&#x79FB;&#x7269;&#x548C;&#x4ECA;&#x671D;&#x7684;&#x51CC;&#x7A7A;&#x98DE;&#x5251;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x6211;&#x662F;&#x76F4;&#x63A5;&#x4ECE;&#x4E24;&#x8FB9;&#x7684;&#x77F3;&#x5934;&#x4E0A;&#x8DF3;&#x8FC7;&#x53BB;&#x7684;&#x3002;&#x6293;&#x732B;&#x662F;&#x633A;&#x597D;&#x73A9;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x73A9;&#x5BB6;&#x7AD9;&#x5728;&#x6811;&#x9876;&#x7EB9;&#x4E1D;&#x4E0D;&#x52A8;&#x3001;&#x8D70;&#x7EF3;&#x5B50;&#x5982;&#x5C65;&#x5E73;&#x5730;&#x662F;&#x4EC0;&#x4E48;&#x9B3C;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x5BF9;Unity3D&#x5185;&#x90E8;&#x96C6;&#x6210;&#x7684;Physic&#x7269;&#x7406;&#x5F15;&#x64CE;&#x8FDB;&#x884C;&#x5B8C;&#x5168;&#x5145;&#x5206;&#x7684;&#x4E86;&#x89E3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D38;&#x7136;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x6280;&#x672F;&#x4F60;&#x786E;&#x5B9A;&#x4F60;&#x80FD;&#x9A7E;&#x9A6D;&#x5F97;&#x597D;&#x5417;&#xFF1F;&#x6D6E;&#x91D1;&#x5802;&#x6211;&#x8DF3;&#x4E86;&#x4E00;&#x4E2A;&#x4E0B;&#x5348;&#x6CA1;&#x6709;&#x8DF3;&#x8FC7;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x8DF3;&#x51FA;&#x5404;&#x79CD;Bug&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#x8FD9;&#x6B21;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4EBA;&#x80FD;&#x73A9;&#x5230;70&#x4E2A;&#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x5566;&#xFF0C;&#x606D;&#x559C;&#x5317;&#x8F6F;&#x4F60;&#x4EEC;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x4E86;&#x600E;&#x6837;&#x5EF6;&#x957F;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x6B21;&#x7684;&#x5F00;&#x673A;&#x5173;&#x8BA9;&#x5C45;&#x5341;&#x65B9;&#x90FD;&#x89C9;&#x5F97;&#x90C1;&#x95F7;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x9700;&#x8981;&#x5F00;&#x673A;&#x5173;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x63D0;&#x793A;&#x201C;&#x5F00;&#x673A;&#x5173;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x8FD8;&#x662F;&#x8BA9;&#x5341;&#x65B9;&#x53BB;&#x505A;&#x5427;!&#x201D;&#xFF0C;&#x5F53;&#x6211;&#x7EC8;&#x4E8E;&#x5E86;&#x5E78;&#x6709;&#x7528;&#x5F97;&#x7740;&#x5341;&#x65B9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E0B;&#x8F6E;&#x5230;&#x6211;&#x90C1;&#x95F7;&#x4E86;&#xFF0C;&#x96BE;&#x9053;&#x5C0F;&#x6E38;&#x620F;&#x5C31;&#x4E0D;&#x80FD;&#x7ED9;&#x70B9;&#x63D0;&#x793A;&#x5417;&#xFF1F;&#x6211;&#x603B;&#x5F97;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x5427;&#xFF01;&#x5212;&#x8239;&#x6211;&#x518D;&#x8F6C;&#x4E86;&#x4E0D;&#x77E5;&#x591A;&#x4E45;&#x4EE5;&#x540E;&#x624D;&#x660E;&#x767D;&#x8FC7;&#x6765;&#x600E;&#x4E48;&#x63A7;&#x5236;&#x8239;&#x7684;&#x79FB;&#x52A8;&#x65B9;&#x5411;&#x548C;&#x89D2;&#x5EA6;&#xFF0C;&#x8FD9;&#x79CD;&#x5C0F;&#x95EE;&#x9898;&#x96BE;&#x9053;&#x6BCF;&#x6B21;&#x90FD;&#x8981;&#x8BA9;&#x5927;&#x5BB6;&#x8BF4;&#x5417;&#xFF1F;&#x8FD9;&#x6B21;&#x7684;&#x8FF7;&#x5BAB;&#x8BBE;&#x8BA1;&#x6709;&#x4E86;&#x5C42;&#x6B21;&#x611F;&#x548C;&#x7ACB;&#x4F53;&#x611F;&#xFF0C;&#x6BD4;&#x5982;&#x542F;&#x9B42;&#x90AA;&#x6559;&#x603B;&#x575B;&#x7684;&#x8FF7;&#x5BAB;&#x548C;&#x673A;&#x5173;&#x8BBE;&#x8BA1;&#x5F97;&#x90FD;&#x4E0D;&#x9519;&#xFF0C;&#x5929;&#x6674;&#x4E4B;&#x6D77;&#x5F97;&#x8FF7;&#x5BAB;&#x8BBE;&#x8BA1;&#x5F97;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x7136;&#x800C;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x662F;&#x4E0E;&#x9752;&#x5C71;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF01;</p>
<p>&#x6211;&#x5C31;&#x653E;&#x4E2A;&#x56FE;&#xFF0C;&#x4E0D;&#x8BF4;&#x8BDD;&#xFF01;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzix85ctsuj20sg0g0gov.jpg" alt="&#x6D6E;&#x91D1;&#x5802;&#x8DF3;&#x8DC3;Bug" title>
                </div>
                <div class="image-caption">&#x6D6E;&#x91D1;&#x5802;&#x8DF3;&#x8DC3;Bug</div>
            </figure>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x8BF4;&#x5B8C;&#x8FD9;&#x4E9B;&#x5C0F;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x8BF4;&#x8FD9;&#x6B21;&#x4ED9;&#x5251;&#x516D;&#x7684;&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4E00;&#x79CD;&#x8003;&#x91CF;&#x8BA9;&#x4F60;&#x4EEC;&#x9009;&#x62E9;&#x53BB;&#x6A21;&#x4EFF;FF13&#x7684;&#x6218;&#x6597;&#x6A21;&#x5F0F;&#xFF0C;&#x96BE;&#x9053;&#x662F;&#x4E3A;&#x4E86;&#x523B;&#x610F;&#x548C;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x4E8C;&#x300B;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1F;&#x7136;&#x5E76;&#x5375;&#xFF0C;&#x8FD9;&#x6B21;&#x7684;&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x7CDF;&#x7CD5;&#x900F;&#x4E86;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x662F;&#x5E0C;&#x671B;&#x4ED9;&#x5251;&#x7684;&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x6162;&#x6162;&#x5730;&#x5411;&#x7740;&#x5373;&#x65F6;&#x5236;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x73B0;&#x5728;&#x7684;&#x5927;&#x52BF;&#x6240;&#x8D8B;&#x5427;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x300B;&#x3001;&#x300A;&#x96E8;&#x8840;&#x300B;&#x548C;&#x300A;&#x5FA1;&#x5929;&#x964D;&#x9B54;&#x4F20;&#x300B;&#x8FD9;&#x7C7B;&#x6E38;&#x620F;&#x6B63;&#x5728;&#x5F15;&#x9886;&#x7740;&#x5927;&#x5BB6;&#x7684;&#x5174;&#x8DA3;&#x5F80;&#x5373;&#x65F6;&#x65B9;&#x5411;&#x8F6C;&#x53D8;&#xFF0C;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#x4ED9;&#x5251;&#x79EF;&#x6781;&#x5730;&#x5411;&#x5373;&#x65F6;&#x5236;&#x8F6C;&#x53D8;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x6765;&#x8BB2;&#x662F;&#x4E00;&#x79CD;&#x4E0D;&#x5F97;&#x4E0D;&#x91C7;&#x53D6;&#x7684;&#x9632;&#x5FA1;&#x6027;&#x63AA;&#x65BD;&#x3002;&#x53EF;&#x662F;&#x6211;&#x6709;&#x6559;&#x8FC7;&#x4F60;&#x7528;&#x4E00;&#x4E2A;&#x4F2A;&#x5373;&#x65F6;&#x5236;&#x7684;&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x6765;&#x6B3A;&#x9A97;&#x5927;&#x5BB6;&#x7684;&#x611F;&#x60C5;&#x5417;&#xFF1F;&#x4EE5;&#x524D;&#x5927;&#x5BB6;&#x5BF9;&#x6392;&#x7AD9;&#x597D;&#x5728;&#x6BCF;&#x4E2A;&#x56DE;&#x5408;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F9D;&#x6B21;&#x63A7;&#x5236;&#x591A;&#x540D;&#x89D2;&#x8272;&#xFF0C;&#x7136;&#x540E;&#x4F9D;&#x6B21;&#x91CA;&#x653E;&#x6280;&#x80FD;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x95F4;&#x7B56;&#x7565;&#x7684;&#x8C03;&#x6574;&#x6765;&#x5C06;&#x6E38;&#x620F;&#x8FDB;&#x884C;&#x4E0B;&#x53BB;&#xFF1B;&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x8FC8;&#x7740;&#x592A;&#x7A7A;&#x6B65;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x56DE;&#x5408;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4E00;&#x540D;&#x89D2;&#x8272;&#xFF0C;&#x6BCF;&#x6B21;&#x53EF;&#x4EE5;&#x53D1;&#x52A8;&#x591A;&#x6B21;&#x884C;&#x52A8;&#xFF0C;&#x5176;&#x4ED6;&#x89D2;&#x8272;&#x7531;AI&#x63A7;&#x5236;&#xFF0C;&#x7136;&#x540E;&#x573A;&#x666F;&#x4E2D;&#x5404;&#x79CD;&#x7C92;&#x5B50;&#x7279;&#x6548;&#x4E71;&#x98DE;&#x3002;&#x5F53;&#x6211;&#x770B;&#x5230;&#x7C92;&#x5B50;&#x7279;&#x6548;&#x8D34;&#x56FE;&#x7684;&#x77E9;&#x5F62;&#x8FB9;&#x6846;&#x65F6;&#xFF0C;&#x6211;&#x7684;&#x5185;&#x5FC3;&#x662F;&#x5954;&#x6E83;&#x7684;&#x3002;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x548C;&#x56DE;&#x5408;&#x5236;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x5F53;&#x521D;&#x4E3B;&#x4F01;&#x5212;&#x8BF4;&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x66F4;&#x597D;&#x7684;&#x89C2;&#x8D4F;&#x6218;&#x6597;&#x753B;&#x9762;&#x7279;&#x610F;&#x5C06;UI&#x505A;&#x5230;&#x4E86;&#x53F3;&#x4E0B;&#x89D2;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x5728;&#x4E00;&#x4E2A;&#x5373;&#x65F6;&#x5236;&#x7684;&#x6E38;&#x620F;&#x91CC;&#x7528;&#x773C;&#x89D2;&#x7684;&#x4F59;&#x5149;&#x626B;&#x89C6;&#x53F3;&#x4E0B;&#x89D2;&#x7136;&#x540E;&#x7528;&#x6EDA;&#x52A8;&#x6761;&#x4ECE;&#x4E00;&#x5806;&#x7269;&#x54C1;&#x4E2D;&#x9009;&#x62E9;&#x9700;&#x8981;&#x7684;&#x7269;&#x54C1;&#x8BE5;&#x6709;&#x591A;&#x86CB;&#x75BC;&#xFF0C;&#x7B49;&#x4F60;&#x9009;&#x597D;&#x4E86;&#xFF0C;&#x961F;&#x53CB;&#x6216;&#x8005;&#x73A9;&#x5BB6;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x503C;&#x7B56;&#x5212;&#x4E3A;&#x660E;&#x7EE3;&#x914D;&#x7F6E;&#x9006;&#x5929;&#x7684;&#x6CBB;&#x7597;&#x6570;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x5927;&#x5BB6;&#x5C31;&#x4E0D;&#x7528;&#x5403;&#x836F;&#x4E86;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x662F;&#x4F60;&#x4EEC;&#x8BE5;&#x5403;&#x836F;&#x4E86;&#x5427;&#xFF0C;&#x4F60;&#x544A;&#x8BC9;&#x6211;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x73A9;&#x5230;&#x73B0;&#x5728;&#x6211;&#x90FD;&#x6CA1;&#x8BB0;&#x4F4F;&#x51E0;&#x4E2A;&#x6280;&#x80FD;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x540E;&#x95EE;&#x8D77;&#x6765;&#x5927;&#x5BB6;&#x63D0;&#x5230;&#x4E07;&#x5251;&#x8BC0;&#x3001;&#x5929;&#x5251;&#x3001;&#x9152;&#x795E;&#x3001;&#x771F;&#x5143;&#x62A4;&#x4F53;&#x3001;&#x5929;&#x7F61;&#x6218;&#x6C14;&#x3001;&#x4E94;&#x7075;&#x5F52;&#x5B97;&#x3001;&#x4E7E;&#x5764;&#x4E00;&#x63B7;&#x3001;&#x6C14;&#x7597;&#x672F;&#x3001;&#x6C14;&#x6307;&#x5251;&#x3001;&#x4E07;&#x7269;&#x5F52;&#x70EC;&#x3001;&#x4ED9;&#x98CE;&#x4E91;&#x4F53;&#x3001;&#x5343;&#x65B9;&#x6B8B;&#x5149;&#x5251;&#x7B49;&#x7B49;&#x7ECF;&#x5178;&#x62DB;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x4E0D;&#x8981;&#x8BF4;&#x6211;&#x4EEC;&#x539A;&#x6B64;&#x8584;&#x5F7C;&#x5C31;&#x597D;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x6709;&#x597D;&#x591A;&#x59B9;&#x5B50;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x5F00;&#x7740;&#x81EA;&#x52A8;&#x6218;&#x6597;&#x76F4;&#x63A5;&#x770B;&#x5267;&#x60C5;&#x7684;&#x4E60;&#x60EF;&#x4E86;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x4ED9;&#x5251;&#x8FD8;&#x4E0D;&#x5982;&#x4E70;&#x5C0F;&#x8BF4;&#x6216;&#x8005;&#x62CD;&#x52A8;&#x6F2B;&#x5462;&#xFF0C;&#x6B63;&#x597D;&#x8FD9;&#x6B21;&#x6240;&#x6709;&#x7684;&#x8FC7;&#x573A;&#x52A8;&#x753B;&#x90FD;&#x662F;2D&#x52A8;&#x753B;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x544A;&#x8BC9;&#x6211;2D&#x52A8;&#x753B;&#x662F;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x3001;3D&#x5EFA;&#x6A21;&#x662F;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x3001;&#x5C0F;&#x5267;&#x60C5;&#x8868;&#x60C5;&#x662F;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#xFF0C;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x91CC;&#x4E09;&#x79CD;&#x98CE;&#x683C;&#xFF0C;&#x4F60;&#x662F;&#x6253;&#x7B97;&#x540C;&#x65F6;&#x7167;&#x987E;&#x52A8;&#x6F2B;&#x548C;&#x6E38;&#x620F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7FA4;&#x4F53;&#x7684;&#x73A9;&#x5BB6;&#x5417;&#xFF1F;&#x7136;&#x5E76;&#x5375;&#xFF0C;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#x4E0D;&#x89C1;&#x5F97;&#x4EBA;&#x5BB6;&#x4F1A;&#x9886;&#x60C5;&#xFF0C;&#x4EBA;&#x5BB6;&#x4F1A;&#x8BF4;&#x4F60;&#x6284;&#x88AD;&#x3001;&#x649E;&#x6897;&#xFF0C;&#x4F60;&#x8BF4;&#x4F60;&#x53C8;&#x662F;&#x4F55;&#x82E6;&#x5462;&#xFF1F;&#x6211;&#x7ED9;&#x4ED9;&#x5251;&#x516D;&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x63D0;&#x70B9;&#x610F;&#x89C1;&#x5427;&#xFF0C;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x73A9;&#x5BB6;&#x81EA;&#x5B9A;&#x4E49;&#x5FEB;&#x6377;&#x952E;&#xFF0C;&#x6BD4;&#x5982;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x6311;&#x9009;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x6280;&#x80FD;&#x548C;&#x5E38;&#x7528;&#x7684;&#x7269;&#x54C1;&#xFF0C;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x90FD;&#x4F1A;&#x6D88;&#x8017;&#x884C;&#x52A8;&#x70B9;&#x6570;&#xFF0C;&#x884C;&#x52A8;&#x70B9;&#x6570;&#x76EE;&#x6D88;&#x8017;&#x5B8C;&#x4E86;&#x5C31;&#x89E6;&#x53D1;&#x6280;&#x80FD;&#x52A8;&#x753B;&#xFF0C;&#x8FD9;&#x6837;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x8BA9;&#x70B9;&#x9F20;&#x6807;&#x53D8;&#x5F97;&#x9AD8;&#x7AEF;&#x4E9B;&#xFF0C;&#x5C31;&#x50CF;&#x82F1;&#x96C4;&#x8054;&#x76DF;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;Q&#x3001;W&#x3001;E&#x4E09;&#x4E2A;&#x952E;&#x5404;&#x79CD;&#x6309;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x88C5;X&#x5730;&#x8BF4;&#x8FD9;&#x91CC;&#x9762;&#x6D89;&#x53CA;&#x5230;&#x8D70;&#x4F4D;&#x548C;&#x610F;&#x8BC6;&#x3002;&#x5BF9;&#x4E86;&#xFF0C;&#x7075;&#x8109;&#x7CFB;&#x7EDF;&#x754C;&#x9762;&#x80FD;&#x4E0D;&#x80FD;&#x70B9;&#x51FB;&#x4E86;&#x4EE5;&#x540E;&#x4E0D;&#x8981;&#x653E;&#x5927;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x90A3;&#x6837;&#x771F;&#x7684;&#x597D;&#x770B;&#x5417;&#xFF1F;&#x518D;&#x8BF4;&#x4E09;&#x79CD;&#x57F9;&#x517B;&#x65B9;&#x5F0F;&#x6211;&#x975E;&#x5F97;&#x4E00;&#x6761;&#x8DEF;&#x8D70;&#x5230;&#x9ED1;&#xFF1F;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzix1dsy93j20hi0a3dh5.jpg" alt="&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x622A;&#x56FE;1" title>
                </div>
                <div class="image-caption">&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x622A;&#x56FE;1</div>
            </figure>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz68kjynqjj20hi0a3dhb.jpg" alt="&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x622A;&#x56FE;2" title>
                </div>
                <div class="image-caption">&#x6218;&#x6597;&#x7CFB;&#x7EDF;&#x622A;&#x56FE;2</div>
            </figure>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x71AC;&#x591C;&#x5230;&#x51CC;&#x6668;&#x4E09;&#x70B9;&#x5199;&#x5B8C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x5BF9;&#x4ED9;&#x5251;&#x7EDD;&#x5BF9;&#x662F;&#x771F;&#x7231;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x8BB8;&#x591A;&#x4EBA;&#x6765;&#x5410;&#x69FD;&#x6211;&#x5199;&#x7684;&#x8FD9;&#x7BC7;&#x5410;&#x69FD;&#xFF0C;&#x53EF;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF1A;&#x4F60;&#x8981;&#x771F;&#x7684;&#x7231;&#x5B83;&#x5C31;&#x522B;&#x603B;&#x662F;&#x60EF;&#x7740;&#x5B83;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x7231;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x6EBA;&#x7231;&#xFF01;&#x5728;&#x5B98;&#x65B9;&#x653E;&#x51FA;&#x7B2C;&#x4E09;&#x7248;&#x8865;&#x4E01;&#x540E;&#xFF0C;&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x4F18;&#x5316;&#x5F97;&#x5230;&#x4E86;&#x8F83;&#x597D;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4ECE;&#x611F;&#x5B98;&#x4E0A;&#x50CF;&#x4E2A;&#x6E38;&#x620F;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x670B;&#x53CB;&#x8FD8;&#x5728;&#x5F98;&#x5F8A;&#x4E0D;&#x5B9A;&#xFF0C;&#x4E0D;&#x59A8;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C1D;&#x8BD5;&#x4E0B;&#x5427;&#xFF01;&#x4EE5;&#x4E0A;&#x89C2;&#x70B9;&#xFF0C;&#x4E00;&#x5BB6;&#x4E4B;&#x8A00;&#xFF0C;&#x4E0D;&#x8DB3;&#x4E3A;&#x636E;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3120185261/">EasyAR尝鲜系列教程之Hello EasyAR</a></li><li><a href="https://qinyuanpei.github.io/posts/1156673678/">EasyAR尝鲜系列教程之自定义Marker的实现</a></li><li><a href="https://qinyuanpei.github.io/posts/4088452183/">Unity3D游戏开发之MMD For Unity插件研究</a></li><li><a href="https://blog.yuanpei.me/posts/3120185261/">EasyAR尝鲜系列教程之Hello EasyAR</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1118169753/" rel="external">《仙剑奇侠传六》游戏感言</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1118169753/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1118169753/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/RPG/">RPG</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/仙剑奇侠传/">仙剑奇侠传</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/游戏/">游戏</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1118169753/&title=《《仙剑奇侠传六》游戏感言》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1118169753/&title=《《仙剑奇侠传六》游戏感言》 — PayneQinのBlog&source=&emsp;&emsp;目前游戏主线剧情进行到50%左右，在游戏尚未通关前，我对于这一部游戏的感觉始终是一种说不清道不明的情感，作为仙剑系列中唯一一部，从..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1118169753/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《《仙剑奇侠传六》游戏感言》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1118169753/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1118169753/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/183718218/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">SDL游戏开发系列第一话：Hello SDL</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/582264328/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Unity3D游戏开发之SQLite让数据库开发更简单</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1118169753/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1118169753/&title=《《仙剑奇侠传六》游戏感言》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1118169753/&title=《《仙剑奇侠传六》游戏感言》 — PayneQinのBlog&source=&emsp;&emsp;目前游戏主线剧情进行到50%左右，在游戏尚未通关前，我对于这一部游戏的感觉始终是一种说不清道不明的情感，作为仙剑系列中唯一一部，从..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1118169753/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《《仙剑奇侠传六》游戏感言》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1118169753/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1118169753/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1118169753/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
