<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        做最初的自己 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;在中秋节这样一个万家团圆的日子，我却再度因为工作的问题和家人发生争执。发生争执的原因简单到习以为常，家人喜欢稳定、安逸的生活，而我却喜欢有挑战、梦想的生活。我不知道梦想对一个二十三岁的人是不是一种奢侈品，我只知道当我住在狭小、拥挤的出租房里的时候，我想努力去拥有一个温暖的家，我不想靠着一张嘴去哗众取宠，我不想刻意地迎合和奉承这个世界，我只想靠我平凡而微薄的努力让我的生活一天">
<meta name="keywords" content="生活,梦想,人生">
<meta property="og:type" content="article">
<meta property="og:title" content="做最初的自己">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/786195243/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;在中秋节这样一个万家团圆的日子，我却再度因为工作的问题和家人发生争执。发生争执的原因简单到习以为常，家人喜欢稳定、安逸的生活，而我却喜欢有挑战、梦想的生活。我不知道梦想对一个二十三岁的人是不是一种奢侈品，我只知道当我住在狭小、拥挤的出租房里的时候，我想努力去拥有一个温暖的家，我不想靠着一张嘴去哗众取宠，我不想刻意地迎合和奉承这个世界，我只想靠我平凡而微薄的努力让我的生活一天">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="做最初的自己">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;在中秋节这样一个万家团圆的日子，我却再度因为工作的问题和家人发生争执。发生争执的原因简单到习以为常，家人喜欢稳定、安逸的生活，而我却喜欢有挑战、梦想的生活。我不知道梦想对一个二十三岁的人是不是一种奢侈品，我只知道当我住在狭小、拥挤的出租房里的时候，我想努力去拥有一个温暖的家，我不想靠着一张嘴去哗众取宠，我不想刻意地迎合和奉承这个世界，我只想靠我平凡而微薄的努力让我的生活一天">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">做最初的自己</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">做最初的自己</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-09-30T10:19:26.000Z" itemprop="datePublished" class="page-time">
  2015-09-30
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-做最初的自己" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">做最初的自己</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-09-30 10:19:26" datetime="2015-09-30T10:19:26.000Z" itemprop="datePublished">2015-09-30</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        15 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5728;&#x4E2D;&#x79CB;&#x8282;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E07;&#x5BB6;&#x56E2;&#x5706;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x6211;&#x5374;&#x518D;&#x5EA6;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x7684;&#x95EE;&#x9898;&#x548C;&#x5BB6;&#x4EBA;&#x53D1;&#x751F;&#x4E89;&#x6267;&#x3002;&#x53D1;&#x751F;&#x4E89;&#x6267;&#x7684;&#x539F;&#x56E0;&#x7B80;&#x5355;&#x5230;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#xFF0C;&#x5BB6;&#x4EBA;&#x559C;&#x6B22;&#x7A33;&#x5B9A;&#x3001;&#x5B89;&#x9038;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x6211;&#x5374;&#x559C;&#x6B22;&#x6709;&#x6311;&#x6218;&#x3001;&#x68A6;&#x60F3;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x68A6;&#x60F3;&#x5BF9;&#x4E00;&#x4E2A;&#x4E8C;&#x5341;&#x4E09;&#x5C81;&#x7684;&#x4EBA;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x5962;&#x4F88;&#x54C1;&#xFF0C;&#x6211;&#x53EA;&#x77E5;&#x9053;&#x5F53;&#x6211;&#x4F4F;&#x5728;&#x72ED;&#x5C0F;&#x3001;&#x62E5;&#x6324;&#x7684;&#x51FA;&#x79DF;&#x623F;&#x91CC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x60F3;&#x52AA;&#x529B;&#x53BB;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x6E29;&#x6696;&#x7684;&#x5BB6;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x9760;&#x7740;&#x4E00;&#x5F20;&#x5634;&#x53BB;&#x54D7;&#x4F17;&#x53D6;&#x5BA0;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x523B;&#x610F;&#x5730;&#x8FCE;&#x5408;&#x548C;&#x5949;&#x627F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x53EA;&#x60F3;&#x9760;&#x6211;&#x5E73;&#x51E1;&#x800C;&#x5FAE;&#x8584;&#x7684;&#x52AA;&#x529B;&#x8BA9;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x4E00;&#x5929;&#x5929;&#x5730;&#x6E29;&#x6696;&#x8D77;&#x6765;&#x3002;&#x4ECE;&#x5C0F;&#x6211;&#x88AB;&#x544A;&#x8BC9;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x6B63;&#x76F4;&#x3001;&#x5584;&#x826F;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x662F;&#x968F;&#x7740;&#x6211;&#x6162;&#x6162;&#x5730;&#x957F;&#x5927;&#xFF0C;&#x5728;&#x6211;&#x7684;&#x8033;&#x8FB9;&#x603B;&#x4F1A;&#x542C;&#x5230;&#x201C;&#x8981;&#x53BB;&#x9002;&#x5E94;&#x8FD9;&#x4E2A;&#x793E;&#x4F1A;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x7136;&#x800C;&#x6700;&#x8BBD;&#x523A;&#x7684;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5E38;&#x5E38;&#x51FA;&#x81EA;&#x540C;&#x4E00;&#x4EBA;&#x7684;&#x53E3;&#x4E2D;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x867D;&#x7136;&#x6211;&#x77E5;&#x9053;&#x5F53;&#x4ECA;&#x4E2D;&#x56FD;&#x7684;&#x793E;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x60C5;&#x793E;&#x4F1A;&#x3001;&#x5173;&#x7CFB;&#x793E;&#x4F1A;&#xFF0C;&#x53EF;&#x6211;&#x5C31;&#x662F;&#x4E0D;&#x613F;&#x610F;&#x628A;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x4EA4;&#x9645;&#x5E94;&#x916C;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x77E5;&#x9053;&#x4EBA;&#x7684;&#x8FD9;&#x4E00;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x975E;&#x5E38;&#x5B9D;&#x8D35;&#x7684;&#xFF0C;&#x4ECE;&#x5C0F;&#x6211;&#x5C31;&#x770B;&#x5230;&#x8EAB;&#x8FB9;&#x719F;&#x6089;&#x7684;&#x4EBA;&#x56E0;&#x4E3A;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x539F;&#x56E0;&#x7A81;&#x7136;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#x9762;&#x4E34;&#x6B7B;&#x4EA1;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x61D2;&#x5F97;&#x7406;&#x4F1A;&#x8FD9;&#x4E9B;&#x65E0;&#x804A;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x66F4;&#x5E0C;&#x671B;&#x5728;&#x6211;&#x559C;&#x6B22;&#x6216;&#x8005;&#x5173;&#x6CE8;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#x6295;&#x5165;&#x7CBE;&#x529B;&#x3002;&#x6BCF;&#x6B21;&#x5F53;&#x5BB6;&#x4EBA;&#x8BF4;&#x6211;&#x5E94;&#x8BE5;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x6837;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x5047;&#x8BBE;&#x81EA;&#x5DF1;&#x5982;&#x679C;&#x6309;&#x7167;&#x8FD9;&#x6837;&#x7684;&#x89C4;&#x5212;&#x6765;&#x5EA6;&#x8FC7;&#x8FD9;&#x4E00;&#x751F;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x6211;&#x8870;&#x8001;&#x76F4;&#x81F3;&#x6B7B;&#x4EA1;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x6211;&#x5FC3;&#x91CC;&#x53C8;&#x4F1A;&#x60F3;&#x4E9B;&#x4EC0;&#x4E48;&#xFF1F;&#x6211;&#x8BA8;&#x538C;&#x653F;&#x6CBB;&#x548C;&#x5B97;&#x6559;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x7531;&#x4EBA;&#x7C7B;&#x81EA;&#x5DF1;&#x4E3A;&#x4EBA;&#x7C7B;&#x5236;&#x9020;&#x7684;&#x7CBE;&#x795E;&#x67B7;&#x9501;&#xFF0C;&#x5728;&#x5B83;&#x4EEC;&#x6D89;&#x8DB3;&#x7684;&#x9886;&#x57DF;&#x5E38;&#x5E38;&#x4F34;&#x968F;&#x5404;&#x79CD;&#x65E0;&#x53EF;&#x4E89;&#x8FA9;&#x7684;&#x5047;&#x8C61;&#x6216;&#x8005;&#x8C0E;&#x8A00;&#xFF0C;&#x8FD9;&#x6070;&#x6070;&#x662F;&#x6211;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6B63;&#x76F4;&#x7684;&#x672C;&#x6027;&#x4E2D;&#x6781;&#x5EA6;&#x538C;&#x6076;&#x7684;&#x90E8;&#x5206;&#x3002;&#x957F;&#x8F88;&#x4EEC;&#x6216;&#x591A;&#x6216;&#x5C11;&#x5730;&#x559C;&#x6B22;&#x7ED9;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x51A0;&#x4EE5;&#x201C;&#x6124;&#x9752;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8363;&#x8A89;&#x79F0;&#x53F7;&#xFF0C;&#x53EF;&#x6211;&#x505A;&#x9519;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x50CF;&#x300A;&#x7687;&#x5E1D;&#x7684;&#x65B0;&#x88C5;&#x300B;&#x91CC;&#x7684;&#x90A3;&#x4E2A;&#x5C0F;&#x5B69;&#xFF0C;&#x7A81;&#x7136;&#x8BF4;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x5BB6;&#x90FD;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#x7684;&#x79D8;&#x5BC6;&#x800C;&#x5DF2;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x7684;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5C0F;&#x5B69;&#x4ECE;&#x89C1;&#x5230;&#x4E86;&#x5C31;&#x8981;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x53D8;&#x6210;&#x73B0;&#x5728;&#x89C1;&#x5230;&#x4E86;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#x3001;&#x770B;&#x5728;&#x773C;&#x91CC;&#x8BF4;&#x5728;&#x5FC3;&#x91CC;&#x3002;&#x4EBA;&#x4EEC;&#x5E38;&#x5E38;&#x628A;&#x8FD9;&#x79CD;&#x8F6C;&#x53D8;&#x5F53;&#x4F5C;&#x6210;&#x719F;&#xFF0C;&#x53EF;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x4EBA;&#x4EEC;&#x53EA;&#x662F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x9EBB;&#x6728;&#x800C;&#x5DF2;&#x3002;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x6211;&#x5047;&#x88C5;&#x9EBB;&#x6728;&#x60F3;&#x8981;&#x6446;&#x8131;&#x8FD9;&#x4E9B;&#x63A9;&#x8033;&#x76D7;&#x94C3;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x957F;&#x8F88;&#x4EEC;&#x5374;&#x518D;&#x5EA6;&#x6446;&#x51FA;&#x201C;&#x793E;&#x4F1A;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x53BB;&#x9002;&#x5E94;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x67B6;&#x52BF;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x5ACC;&#x5F03;&#x6211;&#x5047;&#x88C5;&#x9EBB;&#x6728;&#x96BE;&#x4EE5;&#x5165;&#x620F;&#x9700;&#x8981;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x865A;&#x4F2A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x5929;&#x751F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x4F1A;&#x8868;&#x6F14;&#x7684;&#x4EBA;&#xFF0C;&#x4ECE;&#x5C0F;&#x65F6;&#x5019;&#x6392;&#x7EC3;&#x821E;&#x8E48;&#x5B66;&#x4E60;&#x52A8;&#x4F5C;&#x5230;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x9700;&#x8981;&#x6211;&#x53BB;&#x9022;&#x573A;&#x4F5C;&#x620F;&#x7684;&#x5404;&#x79CD;&#x573A;&#x5408;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x8BF4;&#x9664;&#x4E86;&#x8BA9;&#x4EBA;&#x9AD8;&#x5174;&#x8FD8;&#x662F;&#x9AD8;&#x5174;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x8BA9;&#x559C;&#x6012;&#x54C0;&#x4E50;&#x50CF;&#x53D8;&#x8138;&#x3001;&#x50CF;&#x7FFB;&#x4E66;&#x4E00;&#x6837;&#x5FEB;&#x3002;&#x957F;&#x8F88;&#x4EEC;&#x4E00;&#x76F4;&#x5E0C;&#x671B;&#x6211;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x5706;&#x6ED1;&#x4E16;&#x6545;&#x3001;&#x80F8;&#x6709;&#x57CE;&#x5E9C;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x6211;&#x542C;&#x60EF;&#x4E86;&#x8BB8;&#x5D69;&#x7684;&#x300A;&#x57CE;&#x5E9C;&#x300B;&#x3001;&#x300A;&#x522B;&#x54AC;&#x6211;&#x300B;&#x3001;&#x300A;&#x79CB;&#x5343;&#x5760;&#x300B;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5929;&#x751F;&#x6392;&#x65A5;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x957F;&#x8F88;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x91CC;&#xFF0C;&#x6211;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x51A5;&#x987D;&#x4E0D;&#x7075;&#x3001;&#x56FE;&#x6837;&#x56FE;&#x68EE;&#x7834;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x3002;&#x957F;&#x8F88;&#x4EEC;&#x56FA;&#x7136;&#x662F;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x51FA;&#x53D1;&#xFF0C;&#x60F3;&#x8BA9;&#x4F5C;&#x4E3A;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x6211;&#x8D70;&#x4E0A;&#x4E00;&#x6761;&#x5E73;&#x5766;&#x8212;&#x9002;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x65E9;&#x5DF2;&#x5728;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x4E2D;&#x53D1;&#x751F;&#x7740;&#x5929;&#x7FFB;&#x5730;&#x8986;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x957F;&#x8F88;&#x4EEC;&#x7684;&#x7ECF;&#x9A8C;&#x83B7;&#x53D6;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x987A;&#x5229;&#x901A;&#x5173;&#x4EBA;&#x751F;&#x8FD9;&#x573A;&#x6E38;&#x620F;&#xFF0C;&#x7136;&#x800C;&#x7F3A;&#x5C11;&#x4E86;&#x81EA;&#x6211;&#x63A2;&#x7D22;&#x7684;&#x65C5;&#x7A0B;&#x672A;&#x514D;&#x663E;&#x5F97;&#x5E73;&#x51E1;&#x800C;&#x65E0;&#x8DA3;&#x3002;&#x6211;&#x6709;&#x5E78;&#x5728;&#x5C0F;&#x5B66;&#x4E09;&#x5E74;&#x7EA7;&#x7684;&#x65F6;&#x5019;&#x63A5;&#x89E6;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5728;&#x521D;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x63A5;&#x89E6;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x5728;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x63A5;&#x89E6;&#x7F16;&#x7A0B;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x8FD9;&#x77ED;&#x77ED;&#x7684;&#x82E5;&#x5E72;&#x5E74;&#x95F4;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x98CE;&#x8D77;&#x4E91;&#x6D8C;&#x3001;&#x8D77;&#x8D77;&#x4F0F;&#x4F0F;&#x5374;&#x5E76;&#x975E;&#x6211;&#x4EEC;&#x7684;&#x7236;&#x8F88;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x3002;&#x6211;&#x8D70;&#x8FDB;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x793E;&#x4EA4;&#x7F51;&#x7AD9;(SNS)&#x5F00;&#x59CB;&#x5174;&#x8D77;&#xFF0C;&#x4EE5;Facebook&#x3001;Twitter&#x3001;&#x4EBA;&#x4EBA;&#x7F51;&#x3001;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x3001;&#x817E;&#x8BAF;&#x5FAE;&#x535A;&#x7B49;&#x7B49;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x793E;&#x4F1A;&#x5316;&#x5E73;&#x53F0;&#x8FC5;&#x901F;&#x5730;&#x5360;&#x9886;&#x4E86;&#x6574;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x5236;&#x9AD8;&#x70B9;&#x3002;&#x6216;&#x8BB8;&#x548C;70&#x540E;&#x3001;80&#x540E;&#x76F8;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x4EE3;&#x4EBA;&#x5728;&#x8FD9;&#x4E2A;&#x53D8;&#x5316;&#x5267;&#x70C8;&#x7684;&#x65F6;&#x4EE3;&#x663E;&#x5F97;&#x6709;&#x70B9;&#x751F;&#x4E0D;&#x9022;&#x65F6;&#xFF0C;&#x53EF;&#x662F;&#x673A;&#x9047;&#x548C;&#x6311;&#x6218;&#x603B;&#x662F;&#x5E76;&#x5B58;&#x7684;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x548C;&#x524D;&#x8F88;&#x4EEC;&#x4E00;&#x8D77;&#x6210;&#x4E3A;&#x65F6;&#x4EE3;&#x7684;&#x5F04;&#x6F6E;&#x513F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x6709;&#x52AA;&#x529B;&#x53BB;&#x8FFD;&#x8D76;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x5FD9;&#x788C;&#x7684;&#x811A;&#x6B65;&#x3002;&#x77ED;&#x77ED;&#x5927;&#x5B66;&#x56DB;&#x5E74;&#xFF0C;&#x6211;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#x6BCF;&#x5929;&#x5929;&#x7FFB;&#x5730;&#x8986;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4ECE;SNS&#x5230;&#x4E91;&#x8BA1;&#x7B97;&#x3001;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x3001;&#x5927;&#x6570;&#x636E;&#x3001;&#x7269;&#x8054;&#x7F51;&#x518D;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x91D1;&#x878D;&#x3001;O2O&#xFF0C;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x6162;&#x6162;&#x5730;&#x6E17;&#x900F;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#x6765;&#x3002;&#x66FE;&#x7ECF;&#x6211;&#x7684;&#x957F;&#x8F88;&#x8BA4;&#x4E3A;&#x5982;&#x679C;&#x4F9D;&#x9760;&#x653F;&#x6CBB;&#x529B;&#x91CF;&#x6BC1;&#x706D;&#x4E86;&#x767E;&#x5EA6;&#xFF0C;&#x5219;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x501F;&#x7531;&#x653F;&#x6CBB;&#x529B;&#x91CF;&#x91CD;&#x65B0;&#x521B;&#x9020;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x767E;&#x5EA6;&#xFF0C;&#x53EF;&#x662F;&#x540C;&#x6837;&#x662F;&#x7531;&#x653F;&#x6CBB;&#x529B;&#x91CF;&#x9886;&#x5BFC;&#x7684;&#x4EBA;&#x6C11;&#x7F51;&#x3001;&#x540C;&#x6837;&#x662F;&#x7531;&#x653F;&#x6CBB;&#x529B;&#x91CF;&#x63A8;&#x5230;&#x53F0;&#x524D;&#x7684;&#x9093;&#x4E9A;&#x840D;&#xFF0C;&#x4EBA;&#x6C11;&#x7F51;&#x6700;&#x7EC8;&#x4F9D;&#x7136;&#x5728;&#x8FD9;&#x573A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5927;&#x6218;&#x4E2D;&#x4EE5;&#x5931;&#x8D25;&#x544A;&#x7EC8;&#x3002;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x56FD;&#x5916;&#x7F51;&#x7AD9;&#x5E76;&#x975E;&#x662F;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x4E16;&#x754C;&#x5C71;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x4EEC;&#x4F9D;&#x9760;&#x653F;&#x6CBB;&#x529B;&#x91CF;&#x7528;&#x6D41;&#x6C13;&#x4E00;&#x6837;&#x7684;&#x624B;&#x6BB5;&#x5728;&#x5168;&#x7403;&#x4E00;&#x4F53;&#x5316;&#x7684;&#x4ECA;&#x5929;&#x5B9E;&#x65BD;&#x4FE1;&#x606F;&#x9886;&#x57DF;&#x7684;&#x95ED;&#x5173;&#x9501;&#x56FD;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x662F;&#x653F;&#x6CBB;&#x5E72;&#x9884;&#x8F83;&#x4E3A;&#x7A00;&#x758F;&#x7684;&#x4E00;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5F53;&#x4E2D;&#x6211;&#x4E0D;&#x4F1A;&#x906D;&#x9047;&#x90A3;&#x4E9B;&#x8BA9;&#x6211;&#x538C;&#x6076;&#x7684;&#x653F;&#x6CBB;&#x56E0;&#x7D20;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x4EBA;&#x805A;&#x96C6;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x4F1A;&#x6709;&#x653F;&#x6CBB;&#x4EA7;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x57FA;&#x7840;&#x8981;&#x7D20;&#x4E4B;&#x4E00;&#x7684;&#x6280;&#x672F;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7EAF;&#x7CB9;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5B83;&#x4F9D;&#x9760;&#x6700;&#x4E3A;&#x7B80;&#x5355;&#x7684;0&#x548C;1&#x6784;&#x6210;&#x4E86;&#x4ECA;&#x5929;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x5B83;&#x8BB2;&#x9053;&#x7406;&#x3001;&#x5B88;&#x89C4;&#x77E9;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x7B80;&#x5355;&#x800C;&#x7EAF;&#x7CB9;&#x3002;&#x957F;&#x8F88;&#x4EEC;&#x4E0D;&#x7406;&#x89E3;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x6709;&#x8FD9;&#x6837;&#x72EC;&#x7279;&#x7684;&#x60C5;&#x7ED3;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x666E;&#x901A;&#x4EBA;&#x773C;&#x4E2D;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5A31;&#x4E50;&#x548C;&#x529E;&#x516C;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x6211;&#x773C;&#x4E2D;&#x5B83;&#x50CF;&#x662F;&#x6211;&#x7684;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x9ED8;&#x9ED8;&#x5730;&#x652F;&#x6301;&#x7740;&#x6211;&#x53BB;&#x89E3;&#x51B3;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x3002;&#x4ECE;&#x6211;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x8D77;&#x6211;&#x5C31;&#x8BA4;&#x5B9A;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5C06;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x4E00;&#x8F88;&#x5B50;&#x7684;&#x4E00;&#x79CD;&#x5BC4;&#x6258;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x6C38;&#x6052;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x4F1A;&#x628A;&#x653F;&#x6CBB;&#x548C;&#x5B97;&#x6559;&#x5F53;&#x6210;&#x6211;&#x4E00;&#x751F;&#x7684;&#x4FE1;&#x4EF0;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5927;&#x5B66;&#x56DB;&#x5E74;&#x91CC;&#x5B83;&#x6BCF;&#x5929;&#x548C;&#x6211;&#x5982;&#x5F71;&#x968F;&#x5F62;&#xFF0C;&#x8BA9;&#x6211;&#x53BB;&#x601D;&#x8003;&#x3001;&#x53BB;&#x521B;&#x9020;&#x3001;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x957F;&#x8F88;&#x4EEC;&#x8BA4;&#x4E3A;&#x5927;&#x5B66;&#x5B66;&#x4E60;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4E13;&#x4E1A;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x4ECE;&#x4E8B;&#x5B9E;&#x9645;&#x7684;&#x5DE5;&#x4F5C;&#x4EE5;&#x540E;&#x6CE8;&#x5B9A;&#x8981;&#x53BB;&#x4ECE;&#x5934;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x53EF;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x601D;&#x8DEF;&#x901A;&#x5E38;&#x9002;&#x7528;&#x4E8E;&#x90A3;&#x4E9B;&#x5BF9;&#x672A;&#x6765;&#x6CA1;&#x6709;&#x76EE;&#x6807;&#x3001;&#x968F;&#x9047;&#x800C;&#x5B89;&#x7684;&#x4EBA;&#xFF0C;&#x663E;&#x7136;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x90FD;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4ECE;&#x59CB;&#x81F3;&#x7EC8;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x7531;&#x5927;&#x5230;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x672A;&#x6709;&#x6240;&#x6539;&#x53D8;&#x3002;&#x6211;&#x7684;&#x957F;&#x8F88;&#x4EEC;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x3001;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x57FA;&#x672C;&#x90FD;&#x6CA1;&#x6709;&#x8FC7;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x4ECE;&#x6765;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x5C1D;&#x8BD5;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5374;&#x4E60;&#x60EF;&#x4E8E;&#x53BB;&#x6307;&#x8D23;&#x6211;&#x505A;&#x51FA;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x671F;&#x671B;&#x7684;&#x9009;&#x62E9;&#x3002;&#x6211;&#x662F;&#x4E00;&#x540D;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x89C9;&#x5F97;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x4F4E;&#x4EBA;&#x4E00;&#x7B49;&#xFF0C;&#x6211;&#x6BCF;&#x5929;&#x7684;&#x4ED8;&#x51FA;&#x548C;&#x8001;&#x5E08;&#x7ED9;&#x5B66;&#x751F;&#x6388;&#x8BFE;&#x3001;&#x9500;&#x552E;&#x5458;&#x7ED9;&#x987E;&#x5BA2;&#x552E;&#x8D27;&#x3001;&#x94F6;&#x884C;&#x67DC;&#x5458;&#x7ED9;&#x6D88;&#x8D39;&#x8005;&#x529E;&#x7406;&#x4E1A;&#x52A1;&#x3001;&#x516C;&#x52A1;&#x5458;&#x4E3A;&#x4EBA;&#x6C11;&#x670D;&#x52A1;&#x2026;&#x2026;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x9760;&#x81EA;&#x5DF1;&#x638C;&#x63E1;&#x7684;&#x6280;&#x80FD;&#x53BB;&#x89E3;&#x51B3;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x9760;&#x81EA;&#x5DF1;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x53BB;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x89C9;&#x5F97;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x6761;&#x9519;&#x8BEF;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x96BE;&#x9053;&#x5728;&#x5B89;&#x9038;&#x4E2D;&#x6E10;&#x6E10;&#x8FF7;&#x5931;&#x4E86;&#x81EA;&#x6211;&#x4F1A;&#x8BA9;&#x4F60;&#x4ECE;&#x6B64;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#xFF1F;&#x66FE;&#x7ECF;&#x548C;&#x8001;&#x5E08;&#x4E00;&#x8D77;&#x505A;&#x827E;&#x4F9D;&#x6CB3;&#x7684;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#xFF0C;&#x5F53;&#x65F6;&#x89C9;&#x5F97;&#x5BF9;&#x6574;&#x4E2A;&#x827E;&#x4F9D;&#x6CB3;&#x4E86;&#x5982;&#x6307;&#x638C;&#xFF0C;&#x7136;&#x800C;&#x6BCF;&#x5929;&#x4E0A;&#x4E0B;&#x73ED;&#x4ECE;&#x5B9D;&#x6E56;&#x7ECF;&#x8FC7;&#x7684;&#x65F6;&#x5019;&#x5374;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x6E3A;&#x5C0F;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x6211;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x52AA;&#x529B;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x5F3A;&#x5927;&#x53BB;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x6E29;&#x6696;&#x7684;&#x5BB6;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x56E0;&#x8870;&#x8001;&#x800C;&#x75B2;&#x60EB;&#x7684;&#x5FC3;&#x6709;&#x4E2A;&#x5F52;&#x5BBF;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x5728;&#x6EE1;&#x662F;&#x8FF7;&#x96FE;&#x7684;&#x73B0;&#x5B9E;&#x4E2D;&#x4E22;&#x5931;&#x672C;&#x5FC3;&#xFF0C;&#x6211;&#x5C31;&#x60F3;&#x4E00;&#x76F4;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#x5730;&#x751F;&#x6D3B;&#x4E0B;&#x53BB;&#xFF0C;&#x505A;&#x6B63;&#x76F4;&#x3001;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x6E29;&#x6696;&#x3001;&#x5584;&#x826F;&#x7684;&#x4EBA;&#xFF0C;&#x505A;&#x6700;&#x521D;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3111375079/">冬天来了，春天还会远吗？</a></li><li><a href="https://qinyuanpei.github.io/posts/1394521917/">青黄未接的2015</a></li><li><a href="https://qinyuanpei.github.io/posts/1059499448/">Unity3D游戏开发之路：一月工作总结</a></li><li><a href="https://zymin.cn/arcticle/nextcloud-file-scan.html">OCC命令给ownCloud/Nextcloud手动添加文件</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/786195243/" rel="external">做最初的自己</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/786195243/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/786195243/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/人生/">人生</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/梦想/">梦想</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生活/">生活</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/786195243/&title=《做最初的自己》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/786195243/&title=《做最初的自己》 — PayneQinのBlog&source=&emsp;&emsp;在中秋节这样一个万家团圆的日子，我却再度因为工作的问题和家人发生争执。发生争执的原因简单到习以为常，家人喜欢稳定、安逸的生活，而我..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/786195243/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《做最初的自己》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/786195243/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/786195243/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/821259985/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">在Unity3D中加载外部图片的两种方法</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/927393529/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Unity3D游戏场景优化系列之批处理</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/786195243/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/786195243/&title=《做最初的自己》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/786195243/&title=《做最初的自己》 — PayneQinのBlog&source=&emsp;&emsp;在中秋节这样一个万家团圆的日子，我却再度因为工作的问题和家人发生争执。发生争执的原因简单到习以为常，家人喜欢稳定、安逸的生活，而我..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/786195243/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《做最初的自己》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/786195243/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/786195243/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/786195243/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
