<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        Redis缓存技术学习系列之事务处理 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;在本系列的第一篇文章中，我们主要针对Redis中的“键”和“值”进行了学习。我们可以注意到，Redis是一个C/S架构的数据库，在我们目前的认知中，它是通过终端中的一条条命令来存储和读取的，即它是一个非常典型的“请求-响应”模型。可是我们知道在实际的应用中，我们要面对的或许是更为复杂的业务逻辑，因为Redis中不存在传统关系型数据库中表的概念，因此在使用Redis的过程中，">
<meta name="keywords" content="Redis,缓存,数据库">
<meta property="og:type" content="article">
<meta property="og:title" content="Redis缓存技术学习系列之事务处理">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/335366821/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;在本系列的第一篇文章中，我们主要针对Redis中的“键”和“值”进行了学习。我们可以注意到，Redis是一个C/S架构的数据库，在我们目前的认知中，它是通过终端中的一条条命令来存储和读取的，即它是一个非常典型的“请求-响应”模型。可是我们知道在实际的应用中，我们要面对的或许是更为复杂的业务逻辑，因为Redis中不存在传统关系型数据库中表的概念，因此在使用Redis的过程中，">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.512Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Redis缓存技术学习系列之事务处理">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;在本系列的第一篇文章中，我们主要针对Redis中的“键”和“值”进行了学习。我们可以注意到，Redis是一个C/S架构的数据库，在我们目前的认知中，它是通过终端中的一条条命令来存储和读取的，即它是一个非常典型的“请求-响应”模型。可是我们知道在实际的应用中，我们要面对的或许是更为复杂的业务逻辑，因为Redis中不存在传统关系型数据库中表的概念，因此在使用Redis的过程中，">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">Redis缓存技术学习系列之事务处理</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">Redis缓存技术学习系列之事务处理</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-04-08T21:46:40.000Z" itemprop="datePublished" class="page-time">
  2017-04-08
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据存储/">数据存储</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#从数据库事务说起"><span class="post-toc-number">1.</span> <span class="post-toc-text">从数据库事务说起</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#Redis中的事务处理"><span class="post-toc-number">2.</span> <span class="post-toc-text">Redis中的事务处理</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#如何管理Redis的键"><span class="post-toc-number">3.</span> <span class="post-toc-text">如何管理Redis的键</span></a></li></ol><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number"></span> <span class="post-toc-text">你可能感兴趣</span></a>
        </li></nav>
    </aside>
    
<article id="post-Redis缓存技术学习系列之事务处理" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">Redis缓存技术学习系列之事务处理</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-04-08 21:46:40" datetime="2017-04-08T21:46:40.000Z" itemprop="datePublished">2017-04-08</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据存储/">数据存储</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        19 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5728;&#x672C;&#x7CFB;&#x5217;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x9488;&#x5BF9;Redis&#x4E2D;&#x7684;&#x201C;&#x952E;&#x201D;&#x548C;&#x201C;&#x503C;&#x201D;&#x8FDB;&#x884C;&#x4E86;&#x5B66;&#x4E60;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;Redis&#x662F;&#x4E00;&#x4E2A;C/S&#x67B6;&#x6784;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x7684;&#x8BA4;&#x77E5;&#x4E2D;&#xFF0C;&#x5B83;&#x662F;&#x901A;&#x8FC7;&#x7EC8;&#x7AEF;&#x4E2D;&#x7684;&#x4E00;&#x6761;&#x6761;&#x547D;&#x4EE4;&#x6765;&#x5B58;&#x50A8;&#x548C;&#x8BFB;&#x53D6;&#x7684;&#xFF0C;&#x5373;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5178;&#x578B;&#x7684;&#x201C;&#x8BF7;&#x6C42;-&#x54CD;&#x5E94;&#x201D;&#x6A21;&#x578B;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x9762;&#x5BF9;&#x7684;&#x6216;&#x8BB8;&#x662F;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x56E0;&#x4E3A;Redis&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8868;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x4F7F;&#x7528;Redis&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x9762;&#x5BF9;&#x4E24;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x7684;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x201D;&#x952E;&#x201C;&#x3001;&#x5982;&#x4F55;&#x5728;&#x9AD8;&#x6548;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x7684;&#x540C;&#x65F6;&#x4FDD;&#x8BC1;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x6210;&#x529F;&#x3002;&#x5BF9;&#x4E8E;&#x524D;&#x8005;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x540E;&#x8005;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x627E;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5E26;&#x7740;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x51FA;&#x53D1;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6B63;&#x5F0F;&#x8FDB;&#x5165;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x4E3B;&#x9898;&#xFF1A;Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x8BF4;&#x8D77;"><a href="#&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x8BF4;&#x8D77;" class="headerlink" title="&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x8BF4;&#x8D77;"></a>&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x8BF4;&#x8D77;</h2><p>&#x200B;&#x2003;&#x2003;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x63D0;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x8981;&#x63D0;&#x5230;&#x4E8B;&#x52A1;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x4E8B;&#x52A1;&#x5462;&#xFF1F;&#x4E8B;&#x52A1;&#x662F;&#x6307;&#x4F5C;&#x4E3A;&#x5355;&#x4E2A;&#x903B;&#x8F91;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x6267;&#x884C;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9996;&#x5148;&#x4E8B;&#x52A1;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x5177;&#x6709;&#x4E8C;&#x6001;&#x6027;&#xFF0C;&#x5373;&#x5B8C;&#x5168;&#x5730;&#x6267;&#x884C;&#x6216;&#x8005;&#x5B8C;&#x5168;&#x5730;&#x4E0D;&#x6267;&#x884C;&#x3002;&#x56E0;&#x6B64;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x9664;&#x975E;&#x4E8B;&#x52A1;&#x5355;&#x5143;&#x5185;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x7684;&#x6210;&#x529F;&#x5B8C;&#x6210;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x4F1A;&#x6C38;&#x4E45;&#x66F4;&#x65B0;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x9664;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x4EE5;&#x5916;&#xFF0C;&#x63D2;&#x5165;(Insert)&#x3001;&#x5220;&#x9664;(Delete)&#x548C;&#x66F4;&#x65B0;(Update)&#x8FD9;&#x4E09;&#x79CD;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x5BF9;&#x6570;&#x636E;&#x9020;&#x6210;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x4E3A;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x5730;&#x6267;&#x884C;&#x6216;&#x8005;&#x5B8C;&#x5168;&#x4E0D;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x88AB;&#x63D0;&#x4EA4;&#x4EE5;&#x540E;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x6761;SQL&#x8BED;&#x53E5;&#x5728;&#x88AB;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x6761;&#x64A4;&#x9500;&#x65E5;&#x5FD7;(Undo Log)&#xFF0C;&#x800C;&#x64A4;&#x9500;&#x65E5;&#x5FD7;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x548C;&#x5F53;&#x524D;&#x64E6;&#x4F5C;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x5220;&#x9664;&#x7684;&#x76F8;&#x53CD;&#x64CD;&#x4F5C;&#x662F;&#x63D2;&#x5165;&#xFF0C;&#x63D2;&#x5165;&#x7684;&#x76F8;&#x53CD;&#x64CD;&#x4F5C;&#x662F;&#x5220;&#x9664;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x53BB;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x63D2;&#x9500;&#x65E5;&#x5FD7;&#x91CC;&#x7684;&#x76F8;&#x53CD;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x540C;&#x6837;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x53EA;&#x6709;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x5B8C;&#x5168;&#x6267;&#x884C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5728;&#x610F;&#x5916;&#x60C5;&#x51B5;&#x4E0B;&#x5BFC;&#x81F4;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x7684;&#x3002;</p>
<p>&#x200B;&#x2003;&#x2003;&#x5728;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x5173;&#x7406;&#x8BBA;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x4E8B;&#x52A1;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;ACID&#xFF0C;&#x5373;&#x539F;&#x5B50;&#x6027;&#x3001;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x9694;&#x79BB;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x3002;(1)&#xFF1A;&#x539F;&#x5B50;&#x6027;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6307;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5185;&#x7684;&#x6240;&#x6709;SQL&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x6709;&#x6240;&#x6709;&#x7684;SQL&#x64CD;&#x4F5C;&#x90FD;&#x5B8C;&#x5168;&#x6267;&#x884C;&#x6210;&#x529F;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x65B9;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#x3002;&#x5982;&#x679C;&#x5728;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x8FC7;&#x7A0B;&#x4E2D;&#x67D0;&#x4E00;&#x6761;SQL&#x8BED;&#x53E5;&#x6267;&#x884C;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x56DE;&#x6EDA;&#x5230;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x524D;&#x7684;&#x72B6;&#x6001;&#x3002;(2)&#xFF1A;&#x800C;&#x4E00;&#x81F4;&#x6027;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5219;&#x662F;&#x6307;&#xFF0C;&#x4E8B;&#x52A1;&#x5728;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x843D;&#x5B9E;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5404;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x4E0A;&#xFF0C;&#x5219;&#x8981;&#x6C42;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x3001;&#x7D22;&#x5F15;&#x3001;&#x7EA6;&#x675F;&#x3001;&#x65E5;&#x5FD7;&#x7B49;&#x5728;&#x4E8B;&#x52A1;&#x524D;&#x540E;&#x5177;&#x5907;&#x4E00;&#x81F4;&#x6027;&#x3002;(3)&#xFF1A;&#x9694;&#x79BB;&#x6027;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x5E76;&#x53D1;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x7684;&#x4FEE;&#x6539;&#x5FC5;&#x987B;&#x662F;&#x76F8;&#x4E92;&#x9694;&#x79BB;&#x7684;&#xFF0C;&#x5047;&#x8BBE;&#x6709;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x52A1;A&#x548C;B&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;A&#x6765;&#x8BB2;&#xFF0C;&#x5B83;&#x5728;&#x6267;&#x884C;&#x524D;&#x7684;&#x72B6;&#x6001;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x5373;B&#x6267;&#x884C;&#x524D;&#x548C;B&#x6267;&#x884C;&#x540E;&#x3002;&#x540C;&#x7406;&#xFF0C;&#x5BF9;B&#x6765;&#x8BB2;&#x540C;&#x6837;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7279;&#x6027;&#x6211;&#x4EEC;&#x5C31;&#x79F0;&#x4E3A;&#x9694;&#x79BB;&#x6027;&#x3002;(4)&#xFF1A;&#x6301;&#x4E45;&#x6027;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x662F;&#x6307;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x4EE5;&#x540E;&#x5B83;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x5F71;&#x54CD;&#x662F;&#x6C38;&#x4E45;&#x6027;&#x7684;&#x3002;</p>
<h2 id="Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;"><a href="#Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;" class="headerlink" title="Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;"></a>Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;</h2><p>&#x200B;&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x622A;&#x6B62;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x76F8;&#x5173;&#x7406;&#x8BBA;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5343;&#x5DEE;&#x4E07;&#x522B;&#xFF0C;&#x4F46;&#x6211;&#x76F8;&#x4FE1;&#x5728;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x5B83;&#x4EEC;&#x6700;&#x7EC8;&#x4F1A;&#x6B8A;&#x9014;&#x540C;&#x5F52;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x5E76;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x51B2;&#x7A81;&#x95EE;&#x9898;&#xFF0C;&#x5E38;&#x89C4;&#x7684;&#x505A;&#x6CD5;&#x4F9D;&#x7136;&#x662F;&#x52A0;&#x9501;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x8981;&#x82B1;&#x8D39;&#x7CBE;&#x529B;&#x53BB;&#x7406;&#x89E3;&#x548C;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6280;&#x672F;&#x53EF;&#x8C13;&#x662F;&#x65E5;&#x65B0;&#x6708;&#x5F02;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x4E00;&#x5473;&#x5730;&#x4E3A;&#x65B0;&#x6280;&#x672F;&#x800C;&#x75B2;&#x4E8E;&#x5954;&#x547D;&#xFF0C;&#x90A3;&#x4E48;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x4F1A;&#x6E10;&#x6E10;&#x5730;&#x5931;&#x53BB;&#x5BF9;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x70ED;&#x7231;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x539F;&#x7406;&#x6C38;&#x8FDC;&#x6BD4;&#x6846;&#x67B6;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x6CA1;&#x6709;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x8BA9;&#x6211;&#x81F3;&#x4ECA;&#x90FD;&#x9887;&#x4E3A;&#x9057;&#x61BE;&#x3002;Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x662F;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;MULTI&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x4EEC;&#x58F0;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x961F;&#x5217;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5411;Redis&#x4E2D;&#x63D0;&#x4EA4;&#x7684;&#x6BCF;&#x6761;&#x547D;&#x4EE4;&#xFF0C;&#x90FD;&#x4F1A;&#x88AB;&#x6392;&#x5165;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x961F;&#x5217;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x8F93;&#x5165;EXEC&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x5C06;&#x89E6;&#x53D1;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x4EEC;&#x4ECE;&#x547D;&#x4EE4;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x547D;&#x4EE4;&#x5E76;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x4EE5;Redis&#x4E2D;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4ECE;&#x5F00;&#x59CB;&#x5230;&#x6267;&#x884C;&#x4F1A;&#x7ECF;&#x5386;<strong>&#x5F00;&#x59CB;&#x4E8B;&#x52A1;</strong>&#x3001;<strong>&#x547D;&#x4EE4;&#x5165;&#x961F;</strong>&#x548C;<strong>&#x6267;&#x884C;&#x4E8B;&#x52A1;</strong>&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5728;Redis&#x4E2D;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x7684;&#x7B80;&#x5355;&#x793A;&#x4F8B;&#xFF1A;</p>
<figure class="highlight css"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">127<span class="selector-class">.0</span><span class="selector-class">.0</span><span class="selector-class">.1</span><span class="selector-pseudo">:6379</span>&gt; <span class="selector-tag">MULTI</span></span><br><span class="line"><span class="selector-tag">OK</span></span><br><span class="line">127<span class="selector-class">.0</span><span class="selector-class">.0</span><span class="selector-class">.1</span><span class="selector-pseudo">:6379</span>&gt; <span class="selector-tag">SET</span> <span class="selector-tag">Book_Name</span> &quot;<span class="selector-tag">GIt</span> <span class="selector-tag">Pro</span>&quot;</span><br><span class="line"><span class="selector-tag">QUEUED</span></span><br><span class="line">127<span class="selector-class">.0</span><span class="selector-class">.0</span><span class="selector-class">.1</span><span class="selector-pseudo">:6379</span>&gt; <span class="selector-tag">SADD</span> <span class="selector-tag">Program_Language</span> &quot;<span class="selector-tag">C</span>++&quot; &quot;<span class="selector-tag">C</span>#&quot; &quot;<span class="selector-tag">Jave</span>&quot; &quot;<span class="selector-tag">Python</span>&quot; </span><br><span class="line"><span class="selector-tag">QUEUED</span></span><br><span class="line">127<span class="selector-class">.0</span><span class="selector-class">.0</span><span class="selector-class">.1</span><span class="selector-pseudo">:6379</span>&gt; <span class="selector-tag">GET</span> <span class="selector-tag">Book_Name</span></span><br><span class="line"><span class="selector-tag">QUEUED</span></span><br><span class="line">127<span class="selector-class">.0</span><span class="selector-class">.0</span><span class="selector-class">.1</span><span class="selector-pseudo">:6379</span>&gt; <span class="selector-tag">EXEC</span></span><br><span class="line">1) <span class="selector-tag">OK</span></span><br><span class="line">2) (<span class="selector-tag">integer</span>) 4</span><br><span class="line">3) &quot;<span class="selector-tag">GIt</span> <span class="selector-tag">Pro</span>&quot;</span><br></pre></td></tr></tbody></table></figure>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x548C;&#x901A;&#x5E38;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x4E8B;&#x52A1;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x5373;</p>
<ul>
<li>&#x4E8B;&#x52A1;&#x662F;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x7EC4;&#x6210;&#x7684;&#x5355;&#x4E2A;&#x903B;&#x8F91;&#x5DE5;&#x4F5C;&#x6267;&#x884C;&#x5355;&#x5143;&#x3002;&#x7279;&#x522B;&#x5730;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;Redis&#x4E2D;&#x547D;&#x4EE4;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x547D;&#x4EE4;&#x90FD;&#x4F1A;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x4F1A;&#x88AB;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x5176;&#x5B83;&#x547D;&#x4EE4;&#x4E2D;&#x65AD;&#x3002;</li>
<li>&#x4E8B;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x4E8B;&#x7269;&#x4E2D;&#x7684;&#x547D;&#x4EE4;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x6267;&#x884C;&#x7ED3;&#x679C;&#xFF0C;&#x5373;&#x5168;&#x90E8;&#x6267;&#x884C;&#x6216;&#x8005;&#x5168;&#x90E8;&#x4E0D;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x4F7F;&#x7528;MULTI&#x547D;&#x4EE4;&#x5F00;&#x542F;&#x4E8B;&#x52A1;&#x540E;&#x56E0;&#x4E3A;&#x610F;&#x5916;&#x800C;&#x6CA1;&#x6709;&#x6267;&#x884C;EXEC&#x547D;&#x4EE4;&#xFF0C;&#x5219;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x547D;&#x4EE4;&#x90FD;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x3002;&#x540C;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x4F7F;&#x7528;MULTI&#x547D;&#x4EE4;&#x5F00;&#x542F;&#x4E8B;&#x52A1;&#x540E;&#x6267;&#x884C;EXEC&#x547D;&#x4EE4;&#xFF0C;&#x5219;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x547D;&#x4EE4;&#x90FD;&#x4F1A;&#x6267;&#x884C;&#x3002;</li>
<li>Redis&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;DISCARD&#x547D;&#x4EE4;&#x6765;&#x6E05;&#x7A7A;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x961F;&#x5217;&#xFF0C;&#x5E76;&#x653E;&#x5F03;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x547D;&#x4EE4;&#x5728;&#x5165;&#x961F;&#x65F6;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;Redis&#x5C06;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;EXEC&#x547D;&#x4EE4;&#x65F6;&#x62D2;&#x7EDD;&#x6267;&#x884C;&#x5E76;&#x53D6;&#x6D88;&#x4E8B;&#x52A1;&#xFF0C;&#x4F46;&#x662F;&#x5728;EXEC&#x547D;&#x4EE4;&#x6267;&#x884C;&#x540E;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#xFF0C;Redis&#x5C06;&#x9009;&#x62E9;&#x81EA;&#x52A8;&#x5FFD;&#x7565;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x65B9;&#x6848;&#x4E3B;&#x8981;&#x6709;&#x60B2;&#x89C2;&#x9501;&#x548C;&#x4E50;&#x89C2;&#x9501;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x91CC;&#x9996;&#x5148;&#x6765;&#x89E3;&#x91CA;&#x4E0B;&#x8FD9;&#x4E24;&#x79CD;&#x6982;&#x5FF5;&#x3002;&#x6240;&#x8C13;&#x60B2;&#x89C2;&#x9501;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#x662F;&#x4E00;&#x79CD;&#x60B2;&#x89C2;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x60B2;&#x89C2;&#x9501;&#x8BA4;&#x4E3A;&#xFF1A;&#x5728;&#x5BF9;&#x4EFB;&#x4F55;&#x8BB0;&#x5F55;&#x505A;&#x4FEE;&#x6539;&#x524D;&#x90FD;&#x5E94;&#x8BE5;&#x52A0;&#x9501;&#xFF0C;&#x5982;&#x679C;&#x52A0;&#x9501;&#x5931;&#x8D25;&#x5219;&#x8868;&#x660E;&#x8BE5;&#x673A;&#x5F55;&#x6B63;&#x5728;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x6B64;&#x65F6;&#x5E94;&#x8BE5;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF1B;&#x5982;&#x679C;&#x52A0;&#x9501;&#x6210;&#x529F;&#x5219;&#x4FEE;&#x6539;&#x8BB0;&#x5F55;&#x5E76;&#x5728;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x540E;&#x89E3;&#x9501;&#xFF1B;&#x5982;&#x679C;&#x6709;&#x5176;&#x5B83;&#x4EBA;&#x4FEE;&#x6539;&#x5219;&#x5E94;&#x8BE5;&#x7B49;&#x5F85;&#x5F53;&#x524D;&#x4FEE;&#x6539;&#x89E3;&#x9501;&#x6216;&#x8005;&#x662F;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x800C;&#x6240;&#x8C13;&#x4E50;&#x89C2;&#x9501;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#x662F;&#x4E00;&#x79CD;&#x4E50;&#x89C2;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4E50;&#x89C2;&#x9501;&#x8BA4;&#x4E3A;&#xFF1A;&#x6BCF;&#x6B21;&#x4ECE;&#x8BB0;&#x5F55;&#x4E2D;&#x67E5;&#x627E;&#x6570;&#x636E;&#x522B;&#x4EBA;&#x90FD;&#x4E0D;&#x4F1A;&#x4FEE;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x9501;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x66F4;&#x65B0;&#x8BB0;&#x5F55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x901A;&#x8FC7;&#x7248;&#x672C;&#x53F7;&#x6765;&#x5224;&#x65AD;&#x522B;&#x4EBA;&#x662F;&#x5426;&#x4FEE;&#x6539;&#x8FC7;&#x5F53;&#x524D;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x2003;&#x2003;&#x901A;&#x5E38;&#x6765;&#x8BB2;&#xFF0C;&#x4E50;&#x89C2;&#x9501;&#x9002;&#x5408;&#x5728;&#x5199;&#x51B2;&#x7A81;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x7684;&#x573A;&#x5408;&#x4E0B;&#xFF0C;&#x60B2;&#x89C2;&#x9501;&#x9002;&#x5408;&#x5728;&#x5199;&#x51B2;&#x7A81;&#x76F8;&#x5BF9;&#x8F83;&#x591A;&#x7684;&#x573A;&#x5408;&#x4E0B;&#x3002;Redis&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;check-and-set&#x7684;&#x673A;&#x5236;&#xFF0C;&#x8BE5;&#x673A;&#x5236;&#x4E3B;&#x8981;&#x901A;&#x8FC7;WATCH&#x547D;&#x4EE4;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x539F;&#x7406;&#x6B63;&#x662F;&#x57FA;&#x4E8E;&#x4E50;&#x89C2;&#x9501;&#x7684;&#x7B56;&#x7565;&#xFF0C;Redis&#x4F1A;&#x5728;&#x6267;&#x884C;EXEC&#x547D;&#x4EE4;&#x524D;&#x68C0;&#x67E5;&#x88AB;&#x76D1;&#x89C6;&#x7684;&#x952E;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x662F;&#x5426;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x503C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x8868;&#x660E;&#x6709;&#x4EBA;&#x4FEE;&#x6539;&#x8FC7;&#x8FD9;&#x4E2A;&#x952E;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x503C;&#xFF0C;&#x6B64;&#x65F6;Redis&#x5C06;&#x4F1A;&#x81EA;&#x52A8;&#x53D6;&#x6D88;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight routeros"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">WATCH Record_Count</span><br><span class="line">val = <span class="builtin-name">GET</span> Record_Count</span><br><span class="line">val = val + 1</span><br><span class="line">MULTI</span><br><span class="line"><span class="builtin-name">SET</span> Record_Count <span class="variable">$val</span></span><br><span class="line">EXEC</span><br></pre></td></tr></tbody></table></figure>
<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x5BF9;Record_Count&#x505A;&#x4E00;&#x4E2A;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x975E;&#x5E76;&#x53D1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x5E76;&#x53D1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6267;&#x884C;EXEC&#x547D;&#x4EE4;&#x524D;&#x6709;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x4FEE;&#x6539;&#x4E86;Record_Count&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x6B64;&#x65F6;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x6BD4;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x5C0F;1&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;WATCH&#xFF0C;Redis&#x5C31;&#x4F1A;&#x5BF9;Record_Count&#x8FDB;&#x884C;&#x76D1;&#x542C;&#xFF0C;&#x5F53;Redis&#x76D1;&#x542C;&#x5230;&#x8BE5;&#x503C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x52A1;&#x5C31;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x53D6;&#x6D88;&#xFF0C;&#x8FDB;&#x800C;&#x907F;&#x514D;&#x9020;&#x6210;&#x51B2;&#x7A81;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x7BA1;&#x7406;Redis&#x7684;&#x952E;"><a href="#&#x5982;&#x4F55;&#x7BA1;&#x7406;Redis&#x7684;&#x952E;" class="headerlink" title="&#x5982;&#x4F55;&#x7BA1;&#x7406;Redis&#x7684;&#x952E;"></a>&#x5982;&#x4F55;&#x7BA1;&#x7406;Redis&#x7684;&#x952E;</h2><p>&#x200B;&#x2003;&#x2003;&#x5176;&#x5B9E;&#x4ECE;&#x5207;&#x9898;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x57FA;&#x672C;&#x4E0A;&#x8BF4;&#x6E05;&#x695A;&#x4E86;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x7ED9;&#x5927;&#x5BB6;&#x5E26;&#x6765;&#x591A;&#x5C11;&#x60CA;&#x559C;&#xFF0C;&#x5374;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x6070;&#x5230;&#x597D;&#x5904;&#x7684;&#x7ED3;&#x9898;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x4E4B;&#x524D;&#x6709;&#x670B;&#x53CB;&#x5728;&#x535A;&#x5BA2;&#x4E2D;&#x7559;&#x8A00;&#x5E76;&#x95EE;&#x5230;Redis&#x7684;&#x952E;&#x7BA1;&#x7406;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x535A;&#x4E3B;&#x51B3;&#x5B9A;&#x5728;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x7684;&#x8BA8;&#x8BBA;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x9274;&#x4E8E;&#x535A;&#x4E3B;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x6837;&#x90FD;&#x662F;&#x611F;&#x521A;&#x63A5;&#x89E6;Redis&#xFF0C;&#x6240;&#x4EE5;&#x4E0B;&#x9762;&#x7684;&#x89C2;&#x70B9;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x5BB6;&#x4E4B;&#x8A00;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7591;&#x95EE;&#x53EF;&#x4EE5;&#x5728;&#x535A;&#x5BA2;&#x4E2D;&#x7559;&#x8A00;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x6279;&#x8BC4;&#x6307;&#x6B63;&#x3002;&#x6211;&#x8BA4;&#x4E3A;Redis&#x4E2D;&#x7684;&#x952E;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x4E24;&#x79CD;&#x7B56;&#x7565;&#xFF0C;&#x5373;&#x60F0;&#x6027;&#x5220;&#x9664;&#x548C;&#x5B9A;&#x671F;&#x5220;&#x9664;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x6B63;&#x662F;Redis&#x9ED8;&#x8BA4;&#x7684;&#x952E;&#x5220;&#x9664;&#x7B56;&#x7565;&#xFF1A;</p>
<blockquote>
<p>redis&#x4F7F;&#x7528;<code>&#x60F0;&#x6027;&#x5220;&#x9664;</code>&#x548C;<code>&#x5B9A;&#x671F;&#x5220;&#x9664;</code>&#x4E24;&#x79CD;&#x7B56;&#x7565;&#x6765;&#x5220;&#x9664;&#x8FC7;&#x671F;&#x7684;&#x952E;&#xFF1A;&#x60F0;&#x6027;&#x5220;&#x9664;&#x7B56;&#x7565;&#x5728;&#x78B0;&#x5230;&#x8FC7;&#x671F;&#x952E;&#x65F6;&#x65B9;&#x8FDB;&#x884C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#xFF0C;&#x5B9A;&#x671F;&#x5220;&#x9664;&#x7B56;&#x7565;&#x5219;&#x6BCF;&#x9694;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E3B;&#x52A8;&#x67E5;&#x627E;&#x5E76;&#x5220;&#x9664;&#x8FC7;&#x671F;&#x952E;&#x3002;</p>
</blockquote>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x4E24;&#x79CD;&#x952E;&#x5220;&#x9664;&#x7B56;&#x7565;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x7684;&#x505A;&#x6CD5;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x4E8E;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E34;&#x65F6;&#x952E;&#x6765;&#x5B58;&#x50A8;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x5168;&#x5C40;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x7531;Redis&#x5728;&#x952E;&#x8FC7;&#x671F;&#x540E;&#x81EA;&#x52A8;&#x5220;&#x9664;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x6301;&#x4E45;&#x5316;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x666E;&#x901A;&#x952E;&#x6765;&#x5B58;&#x50A8;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x95F4;&#x5B9A;&#x4E49;&#x534F;&#x8BAE;&#x6765;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x4E3B;&#x52A8;&#x5220;&#x9664;&#x952E;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x952E;&#x91C7;&#x53D6;&#x7EDF;&#x4E00;&#x89C4;&#x8303;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#x6765;&#x547D;&#x540D;&#x952E;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;Redis&#x4E2D;&#x952E;&#x7BA1;&#x7406;&#x6DF7;&#x4E71;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x8BBE;&#x8BA1;&#x5408;&#x7406;&#x7684;&#x952E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF0C;&#x907F;&#x514D;Redis&#x4F7F;&#x7528;&#x8D85;&#x8FC7;95%&#x4EE5;&#x4E0A;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;Redis&#x4E2D;&#x7684;&#x6700;&#x5927;&#x5185;&#x5B58;&#x5BB9;&#x91CF;&#x53CA;&#x5176;&#x5185;&#x5B58;&#x7B56;&#x7565;&#x6765;&#x4E3B;&#x52A8;&#x89E6;&#x53D1;Redis&#x5BF9;&#x952E;&#x7684;&#x6DD8;&#x6C70;&#x3002;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF1A;<a href="https://segmentfault.com/a/1190000004171731" target="_blank" rel="noopener">Sunnyxd - Redis&#x5B66;&#x4E60;&#x7B14;&#x8BB0;-&#x4E8B;&#x52A1;&#x3001;&#x952E;&#x7A7A;&#x95F4;&#x7684;&#x7EF4;&#x62A4;&#x4E0E;&#x6027;&#x80FD;</a></li>
</ul>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x559C;&#x6B22;&#xFF0C;&#x4E0B;&#x7BC7;&#x89C1;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/4197961431/">Redis缓存技术学习系列之Lua脚本</a></li><li><a href="https://qinyuanpei.github.io/posts/1444577573/">Redis缓存技术学习系列之发布订阅</a></li><li><a href="https://qinyuanpei.github.io/posts/3032366281/">Redis缓存技术学习系列之邂逅Redis</a></li><li><a href="http://www.buildupchao.cn/2018/05/15/Redis缓存设计之令人兴奋的OOM/">Redis缓存设计之令人兴奋的OOM</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/335366821/" rel="external">Redis缓存技术学习系列之事务处理</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/335366821/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/335366821/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Redis/">Redis</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/数据库/">数据库</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/缓存/">缓存</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/335366821/&title=《Redis缓存技术学习系列之事务处理》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/335366821/&title=《Redis缓存技术学习系列之事务处理》 — PayneQinのBlog&source=&emsp;&emsp;在本系列的第一篇文章中，我们主要针对Redis中的“键”和“值”进行了学习。我们可以注意到，Redis是一个C/S架构的数据库，在..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/335366821/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《Redis缓存技术学习系列之事务处理》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/335366821/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/335366821/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1444577573/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">Redis缓存技术学习系列之发布订阅</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1357715684/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">时间如灰烬般遥远</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/335366821/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/335366821/&title=《Redis缓存技术学习系列之事务处理》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/335366821/&title=《Redis缓存技术学习系列之事务处理》 — PayneQinのBlog&source=&emsp;&emsp;在本系列的第一篇文章中，我们主要针对Redis中的“键”和“值”进行了学习。我们可以注意到，Redis是一个C/S架构的数据库，在..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/335366821/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《Redis缓存技术学习系列之事务处理》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/335366821/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/335366821/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/335366821/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
