<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        关于电影《暗杀》背后的故事和想法 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x770B;&amp;#x8FC7;&amp;#x4E86;&amp;#x7531;&amp;#x5168;&amp;#x667A;&amp;#x8D24;&amp;#x4E3B;&amp;#x6F14;&amp;#x7684;&amp;#x7535;&amp;#x5F71;&amp;#x300A;&amp;#x6697;&amp;#x6740;&amp;#x300B;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x8BF4;&amp;#x8FD9">
<meta name="keywords" content="影评,和平,全智贤">
<meta property="og:type" content="article">
<meta property="og:title" content="关于电影《暗杀》背后的故事和想法">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2462008667/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x770B;&amp;#x8FC7;&amp;#x4E86;&amp;#x7531;&amp;#x5168;&amp;#x667A;&amp;#x8D24;&amp;#x4E3B;&amp;#x6F14;&amp;#x7684;&amp;#x7535;&amp;#x5F71;&amp;#x300A;&amp;#x6697;&amp;#x6740;&amp;#x300B;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x8BF4;&amp;#x8FD9">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="关于电影《暗杀》背后的故事和想法">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x770B;&amp;#x8FC7;&amp;#x4E86;&amp;#x7531;&amp;#x5168;&amp;#x667A;&amp;#x8D24;&amp;#x4E3B;&amp;#x6F14;&amp;#x7684;&amp;#x7535;&amp;#x5F71;&amp;#x300A;&amp;#x6697;&amp;#x6740;&amp;#x300B;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x8BF4;&amp;#x8FD9">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

<link rel="stylesheet" href="/assets/css/APlayer.min.css" class="aplayer-style-marker">
<script src="/assets/js/APlayer.min.js" class="aplayer-script-marker"></script>
<script src="/assets/js/Meting.min.js" class="meting-script-marker"></script>
</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">关于电影《暗杀》背后的故事和想法</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">关于电影《暗杀》背后的故事和想法</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-06-01T09:33:25.000Z" itemprop="datePublished" class="page-time">
  2018-06-01
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#一明一灭，两条暗杀线"><span class="post-toc-number">1.</span> <span class="post-toc-text">一明一灭，两条暗杀线</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#这个反派有点帅哦"><span class="post-toc-number">2.</span> <span class="post-toc-text">这个反派有点帅哦</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#演技与颜值同时在线的全女神"><span class="post-toc-number">3.</span> <span class="post-toc-text">演技与颜值同时在线的全女神</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#一个超有力量感的故事结尾"><span class="post-toc-number">4.</span> <span class="post-toc-text">一个超有力量感的故事结尾</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#写在战争结束以后"><span class="post-toc-number">5.</span> <span class="post-toc-text">写在战争结束以后</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">6.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-关于电影《暗杀》背后的故事和想法" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">关于电影《暗杀》背后的故事和想法</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-06-01 09:33:25" datetime="2018-06-01T09:33:25.000Z" itemprop="datePublished">2018-06-01</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        28 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <div id="aplayer-wTaosakN" class="aplayer aplayer-tag-marker meting-tag-marker" data-id="569213279" data-server="netease" data-type="song" data-mode="circulation" data-autoplay="true" data-mutex="false" data-listmaxheight="340px" data-preload="none" data-theme="#ad7a86"></div>
<p>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x770B;&#x8FC7;&#x4E86;&#x7531;&#x5168;&#x667A;&#x8D24;&#x4E3B;&#x6F14;&#x7684;&#x7535;&#x5F71;&#x300A;&#x6697;&#x6740;&#x300B;&#xFF0C;&#x867D;&#x7136;&#x8BF4;&#x8FD9;&#x662F;&#x4E00;&#x90E8;&#x6211;&#x4EEC;&#x65E9;&#x5DF2;&#x719F;&#x7A14;&#x7684;&#x6297;&#x6218;&#x9898;&#x6750;&#x7535;&#x5F71;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x5168;&#x5973;&#x795E;&#x989C;&#x503C;&#x548C;&#x6F14;&#x6280;&#x7684;&#x8BF1;&#x60D1;&#x4E0B;&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x8FD8;&#x662F;&#x82B1;&#x4E86;&#x70B9;&#x65F6;&#x95F4;&#x6765;&#x770B;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x3002;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x89C1;&#x8BC6;&#x8FC7;&#x4E86;&#x592A;&#x591A;&#x7684;<strong>&#x201C;&#x6297;&#x65E5;&#x795E;&#x5267;&#x201D;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x9762;&#x5BF9;&#x8FD9;&#x6837;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x96BE;&#x514D;&#x5E26;&#x7740;&#x67D0;&#x79CD;&#x4E0D;&#x5C51;&#x7684;&#x773C;&#x5149;&#x53BB;&#x5BA1;&#x89C6;&#x5B83;&#x3002;&#x53EF;&#x662F;&#x5F53;&#x4F60;&#x770B;&#x5B8C;&#x4E86;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x7A81;&#x7136;&#x95F4;&#x5174;&#x594B;&#x5230;&#x96BE;&#x4EE5;&#x81EA;&#x5236;&#xFF0C;&#x4E0D;&#x7531;&#x5730;&#x60CA;&#x547C;&#x4E00;&#x58F0;&#xFF1A;&#x60F3;&#x4E0D;&#x5230;&#x97E9;&#x56FD;&#x62CD;&#x8FD9;&#x79CD;&#x4E3B;&#x65CB;&#x5F8B;&#x7535;&#x5F71;&#x90FD;&#x80FD;&#x8FD9;&#x4E48;&#x597D;&#x770B;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x89C6;&#x89D2;&#x8F6C;&#x6362;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x4EE3;&#x5165;&#x611F;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x770B;&#x8FC7;&#x65E5;&#x672C;&#x62CD;&#x6444;&#x7684;&#x7532;&#x5348;&#x6D77;&#x6218;&#xFF0C;&#x65E5;&#x672C;&#x5728;&#x660E;&#x6CBB;&#x7EF4;&#x65B0;&#x4EE5;&#x540E;&#xFF0C;&#x79EF;&#x6781;&#x5730;&#x5411;&#x897F;&#x65B9;&#x5B66;&#x4E60;&#x5148;&#x8FDB;&#x6280;&#x672F;&#xFF0C;&#x4ECE;&#x5929;&#x7687;&#x5230;&#x5B98;&#x5458;&#xFF0C;&#x90FD;&#x80FD;&#x4ECE;&#x4FF8;&#x7984;&#x4E2D;&#x7701;&#x51FA;&#x94B1;&#x6765;&#x53D1;&#x5C55;&#x6D77;&#x519B;&#x4E8B;&#x4E1A;&#xFF0C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x4EE5;&#x5929;&#x671D;&#x4E0A;&#x56FD;&#x81EA;&#x8BE9;&#x7684;&#x5927;&#x6E05;&#x5E1D;&#x56FD;&#x5219;&#x662F;&#x674E;&#x9E3F;&#x7AE0;&#x4E00;&#x4EBA;&#x5728;&#x652F;&#x6491;&#x7740;&#x5C8C;&#x5C8C;&#x53EF;&#x5371;&#x7684;&#x671D;&#x5EF7;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x901A;&#x8FC7;&#x300A;&#x6D6A;&#x5BA2;&#x5251;&#x5FC3;&#x300B;&#x540C;&#x540D;&#x7535;&#x5F71;&#xFF0C;&#x4F60;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x5728;&#x660E;&#x6CBB;&#x7EF4;&#x65B0;&#x8FD9;&#x573A;&#x53D8;&#x9769;&#x80CC;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x65E0;&#x6570;&#x4E2A;&#x50CF;&#x5FD7;&#x5FD7;&#x96C4;&#x8FD9;&#x6837;&#x7684;&#x653F;&#x6CBB;&#x727A;&#x7272;&#x54C1;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x89C6;&#x89D2;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x800C;&#x5F15;&#x8D77;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5728;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x4E2D;&#xFF0C;&#x5B83;&#x8BB2;&#x8FF0;&#x4E86;&#x97E9;&#x3001;&#x671D;&#x4E24;&#x56FD;&#x4EBA;&#x8BB0;&#x5FC6;&#x4E2D;&#x7684;&#x6297;&#x65E5;&#x6218;&#x4E89;&#xFF0C;&#x8FD9;&#x573A;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x6297;&#x65E5;&#x6218;&#x4E89;&#xFF0C;&#x5728;&#x97E9;&#x56FD;&#x4EBA;&#x773C;&#x4E2D;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x5BF9;&#x6211;&#x4EEC;&#x770B;&#x5F85;&#x5386;&#x53F2;&#x4F1A;&#x6709;&#x6240;&#x542F;&#x793A;&#x3002;</p>
<h1 id="&#x4E00;&#x660E;&#x4E00;&#x706D;&#xFF0C;&#x4E24;&#x6761;&#x6697;&#x6740;&#x7EBF;"><a href="#&#x4E00;&#x660E;&#x4E00;&#x706D;&#xFF0C;&#x4E24;&#x6761;&#x6697;&#x6740;&#x7EBF;" class="headerlink" title="&#x4E00;&#x660E;&#x4E00;&#x706D;&#xFF0C;&#x4E24;&#x6761;&#x6697;&#x6740;&#x7EBF;"></a>&#x4E00;&#x660E;&#x4E00;&#x706D;&#xFF0C;&#x4E24;&#x6761;&#x6697;&#x6740;&#x7EBF;</h1><p>&#x2003;&#x2003;&#x7535;&#x5F71;&#x8BB2;&#x8FF0;&#x4E86;19&#x4E16;&#x7EAA;30&#x5E74;&#x4EE3;&#xFF0C;&#x4EE5;&#x5B89;&#x6C83;&#x5141;(<strong>&#x5168;&#x667A;&#x8D24;</strong>&#x9970;)&#x4E3A;&#x9996;&#x7684;&#x6697;&#x6740;&#x4E09;&#x4EBA;&#x7EC4;&#xFF0C;&#x5949;&#x547D;&#x523A;&#x6740;&#x65E5;&#x519B;&#x9A7B;&#x671D;&#x9C9C;&#x53F8;&#x4EE4;&#x5B98;&#x53CA;&#x672C;&#x56FD;&#x5356;&#x56FD;&#x8D3C;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x6545;&#x4E8B;&#x53D1;&#x751F;&#x5728;&#x4EAC;&#x57CE;(&#x5373;&#x97E9;&#x56FD;&#x9996;&#x5C14;)&#x548C;&#x4E0A;&#x6D77;&#xFF0C;&#x65F6;&#x4EFB;&#x97E9;&#x56FD;&#x4E34;&#x65F6;&#x653F;&#x5E9C;&#x5C40;&#x52A1;&#x5C40;&#x5C40;&#x957F;&#x7684;&#x5EC9;&#x9521;&#x9547;(<strong>&#x674E;&#x653F;&#x5BB0;</strong>&#x9970;)&#xFF0C;&#x5728;&#x65E9;&#x5E74;&#x523A;&#x6740;&#x65E5;&#x519B;&#x5927;&#x5C06;&#x5931;&#x8D25;&#x4EE5;&#x540E;&#xFF0C;&#x6697;&#x5730;&#x91CC;&#x65E9;&#x5DF2;&#x6295;&#x9760;&#x65E5;&#x672C;&#x4EBA;&#xFF0C;&#x6B64;&#x65F6;&#x66F4;&#x5C06;&#x6697;&#x6740;&#x4E09;&#x4EBA;&#x7EC4;&#x7684;&#x6D88;&#x606F;&#x6CC4;&#x9732;&#x7ED9;&#x65E5;&#x65B9;&#x3002;&#x4E00;&#x65F6;&#x95F4;&#xFF0C;&#x6697;&#x6740;&#x4E09;&#x4EBA;&#x7EC4;&#x7684;&#x523A;&#x6740;&#x884C;&#x52A8;&#x548C;&#x5904;&#x51B3;&#x53DB;&#x5F92;&#x5EC9;&#x9521;&#x9547;&#x523A;&#x6740;&#x884C;&#x52A8;&#xFF0C;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x660E;&#x4E00;&#x6697;&#x4E24;&#x6761;&#x7EBF;&#x7D22;&#xFF0C;&#x547C;&#x5E94;&#x4E86;&#x672C;&#x7247;&#x7247;&#x540D;<strong>&#x201C;&#x6697;&#x6740;&#x201D;</strong>&#xFF0C;&#x800C;&#x5EC9;&#x9521;&#x9547;&#x66F4;&#x662F;&#x627E;&#x6765;&#x8D4F;&#x91D1;&#x730E;&#x4EBA;<strong>&#x201C;&#x590F;&#x5A01;&#x5937;&#x624B;&#x67AA;&#x201D;</strong>(<strong>&#x6CB3;&#x5185;&#x5B87;</strong>&#x9970;)&#xFF0C;&#x610F;&#x56FE;&#x963B;&#x6320;&#x6697;&#x6740;&#x4E09;&#x4EBA;&#x7EC4;&#x7684;&#x523A;&#x6740;&#x884C;&#x52A8;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x8109;&#x7EDC;&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x523A;&#x6740;&#x884C;&#x52A8;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x6545;&#x4E8B;&#x60AC;&#x5FF5;&#x5C31;&#x843D;&#x5728;&#x4E86;<strong>&#x523A;&#x5BA2;&#x7684;&#x523A;&#x6740;&#x8BA1;&#x5212;&#x5982;&#x4F55;&#x843D;&#x5B9E;</strong>&#x4EE5;&#x53CA;<strong>&#x53CD;&#x6D3E;&#x7684;&#x963B;&#x6320;&#x65B9;&#x6848;&#x5C06;&#x5982;&#x4F55;&#x5F00;&#x5C55;</strong>&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x77E5;&#x9053;&#x53CD;&#x6D3E;&#x6700;&#x7EC8;&#x4E00;&#x5B9A;&#x6CA1;&#x6709;&#x597D;&#x4E0B;&#x573A;&#xFF0C;&#x53EF;&#x4E0D;&#x5230;&#x5168;&#x5973;&#x795E;&#x653E;&#x4E0B;&#x67AA;&#x7684;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x4F60;&#x603B;&#x662F;&#x4E0D;&#x80AF;&#x653E;&#x4E0B;&#x5FC3;&#x6765;&#x3002;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x662F;&#x770B;&#x53CC;&#x65B9;&#x6597;&#x667A;&#x6597;&#x52C7;&#xFF0C;&#x5728;&#x989C;&#x503C;&#x4E0E;&#x6F14;&#x6280;&#x90FD;&#x5728;&#x7EBF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x4F9D;&#x7136;&#x663E;&#x5F97;&#x8D4F;&#x5FC3;&#x60A6;&#x76EE;&#x3002;&#x5168;&#x5973;&#x795E;&#x5728;&#x7247;&#x4E2D;&#x51E0;&#x4E4E;&#x627F;&#x62C5;&#x4E86;&#x6240;&#x6709;&#x7684;&#x52A8;&#x4F5C;&#x620F;&#x4EFD;&#xFF0C;&#x53EF;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x674E;&#x653F;&#x5BB0;&#x5728;&#x7247;&#x4E2D;&#x9970;&#x6F14;&#x7684;&#x53CD;&#x6D3E;&#x5EC9;&#x9521;&#x9547;&#xFF0C;&#x98CE;&#x5934;&#x4E00;&#x5EA6;&#x4E0D;&#x4E9A;&#x4E8E;&#x5168;&#x5973;&#x795E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x540E;&#x9762;&#x518D;&#x8BE6;&#x7EC6;&#x8BF4;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7535;&#x5F71;&#x4E2D;&#x524D;&#x671F;&#x51FA;&#x73B0;&#x7684;&#x573A;&#x666F;&#x90FD;&#x662F;&#x5728;&#x4E0A;&#x6D77;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x670B;&#x53CB;&#x4F1A;&#x7591;&#x60D1;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x90E8;&#x97E9;&#x56FD;&#x62CD;&#x7684;&#x7535;&#x5F71;&#x91CC;&#x4F1A;&#x51FA;&#x73B0;&#x4E0A;&#x6D77;&#x3002;&#x8FD9;&#x5C31;&#x8981;&#x9996;&#x5148;&#x8BF4;&#x8BF4;&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#xFF0C;&#x5F53;&#x65F6;&#x97E9;&#x56FD;&#x7684;&#x4E34;&#x65F6;&#x653F;&#x5E9C;&#x662F;&#x8BBE;&#x5728;&#x4E0A;&#x6D77;&#x7684;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x65B9;&#x4FBF;&#x91D1;&#x4E5D;&#x3001;&#x91D1;&#x5143;&#x51E4;&#x8FD9;&#x6837;&#x7684;&#x9769;&#x547D;&#x5FD7;&#x58EB;&#x5F00;&#x5C55;&#x6551;&#x4EA1;&#x56FE;&#x5B58;&#x6D3B;&#x52A8;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x7684;&#x97E9;&#x56FD;(&#x5728;&#x5357;&#x3001;&#x5317;&#x671D;&#x9C9C;&#x6CA1;&#x6709;&#x5206;&#x88C2;&#x4EE5;&#x524D;&#xFF0C;&#x6307;&#x6574;&#x4E2A;&#x671D;&#x9C9C;&#x534A;&#x5C9B;&#xFF09;&#x65E9;&#x5DF2;&#x7B3C;&#x7F69;&#x5728;&#x65E5;&#x519B;&#x7684;&#x519B;&#x4E8B;&#x7EDF;&#x6CBB;&#x9634;&#x5F71;&#x4E0B;&#x3002;&#x5386;&#x53F2;&#x4E0A;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x671F;&#x957F;&#x8FBE;35&#x5E74;&#x4E4B;&#x4E45;&#x3002;&#x65E5;&#x672C;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5360;&#x9886;&#x671D;&#x9C9C;&#x7684;&#x5462;&#xFF1F;&#x6CA1;&#x9519;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x719F;&#x6089;&#x7684;&#x4E2D;&#x65E5;&#x7532;&#x5348;&#x6218;&#x4E89;&#x3002;&#x5F53;&#x65F6;&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x6B63;&#x662F;&#x5728;&#x8FD0;&#x9001;&#x9646;&#x519B;&#x62B5;&#x8FBE;&#x671D;&#x9C9C;&#x540E;&#x7684;&#x8FD4;&#x822A;&#x9014;&#x4E2D;&#xFF0C;&#x4E0E;&#x65E5;&#x672C;&#x6D77;&#x519B;&#x53D1;&#x751F;&#x8FD1;&#x4EE3;&#x5386;&#x53F2;&#x4E0A;&#x7B2C;&#x4E00;&#x6B21;&#x5927;&#x89C4;&#x6A21;&#x94C1;&#x7532;&#x8230;&#x6D77;&#x6218;&#x3002;&#x8FD9;&#x573A;&#x6218;&#x4E89;&#x7684;&#x7ED3;&#x679C;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x51E0;&#x4E4E;&#x5168;&#x519B;&#x8986;&#x6CA1;&#xFF0C;&#x6E05;&#x653F;&#x5E9C;&#x66F4;&#x662F;&#x540C;&#x65E5;&#x672C;&#x7B7E;&#x8BA2;&#x4E86;&#x4E27;&#x6743;&#x8FB1;&#x56FD;&#x7684;&#x9A6C;&#x5173;&#x6761;&#x7EA6;&#x3002;&#x65E5;&#x672C;&#x5360;&#x9886;&#x671D;&#x9C9C;&#x534A;&#x5C9B;&#x540E;&#xFF0C;&#x66FE;&#x5BF9;&#x5F53;&#x5730;&#x4EBA;&#x8FDB;&#x884C;&#x4E86;&#x60E8;&#x65E0;&#x4EBA;&#x9053;&#x7684;&#x5C60;&#x6740;&#xFF0C;&#x6B63;&#x662F;&#x4ECE;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x8D77;&#xFF0C;&#x671D;&#x9C9C;&#x5F00;&#x59CB;&#x7B3C;&#x7F69;&#x5728;&#x65E5;&#x519B;&#x7684;&#x7EDF;&#x6CBB;&#x9634;&#x5F71;&#x4E4B;&#x4E0B;&#xFF0C;&#x800C;&#x6D41;&#x4EA1;&#x56FD;&#x5916;&#x7684;&#x4E34;&#x65F6;&#x653F;&#x5E9C;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x5BC4;&#x5C45;&#x5728;&#x4E0A;&#x6D77;&#x7684;&#x6CD5;&#x79DF;&#x754C;&#xFF0C;&#x7EE7;&#x7EED;&#x5F00;&#x5C55;&#x6297;&#x65E5;&#x6D3B;&#x52A8;&#x3002;&#x5F71;&#x7247;&#x4E2D;&#x7684;&#x91D1;&#x4E5D;&#x548C;&#x91D1;&#x5143;&#x51E4;&#xFF0C;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#x90FD;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x8BB0;&#x5F55;&#x3002;&#x4E0A;&#x6D77;&#x8679;&#x53E3;&#x7206;&#x70B8;&#x4E8B;&#x4EF6;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x7684;&#x5386;&#x53F2;&#x539F;&#x578B;&#xFF0C;&#x5F71;&#x7247;&#x4E2D;&#x4E8C;&#x91D1;&#x7684;&#x5408;&#x4F5C;&#x4FC3;&#x6210;&#x4E86;&#x4E09;&#x4EBA;&#x6697;&#x6740;&#x7EC4;&#x7684;&#x6210;&#x7ACB;&#xFF0C;&#x6545;&#x4E8B;&#x7531;&#x6B64;&#x5F00;&#x59CB;&#x3002;</p>
<h1 id="&#x8FD9;&#x4E2A;&#x53CD;&#x6D3E;&#x6709;&#x70B9;&#x5E05;&#x54E6;"><a href="#&#x8FD9;&#x4E2A;&#x53CD;&#x6D3E;&#x6709;&#x70B9;&#x5E05;&#x54E6;" class="headerlink" title="&#x8FD9;&#x4E2A;&#x53CD;&#x6D3E;&#x6709;&#x70B9;&#x5E05;&#x54E6;"></a>&#x8FD9;&#x4E2A;&#x53CD;&#x6D3E;&#x6709;&#x70B9;&#x5E05;&#x54E6;</h1><p>&#x2003;&#x2003;&#x674E;&#x653F;&#x5BB0;&#x9970;&#x6F14;&#x7684;&#x5EC9;&#x9521;&#x9547;&#xFF0C;&#x5728;&#x7535;&#x5F71;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x4EE5;&#x9769;&#x547D;&#x5FD7;&#x58EB;&#x7684;&#x5F62;&#x8C61;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x4ED6;&#x523A;&#x6740;&#x65E5;&#x519B;&#x5927;&#x5C06;&#x7684;&#x4EFB;&#x52A1;&#x5931;&#x8D25;&#xFF0C;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x4ED6;&#x5728;&#x88AB;&#x6355;&#x540E;&#x906D;&#x53D7;&#x4E25;&#x9177;&#x7684;&#x5211;&#x7F5A;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x95F4;&#x63A5;&#x5BFC;&#x81F4;&#x4E86;&#x5973;&#x4E3B;&#x5B89;&#x6C83;&#x5141;&#x7684;&#x6BCD;&#x4EB2;&#x88AB;&#x4EB2;&#x65E5;&#x6D3E;&#x7236;&#x4EB2;&#x5EB7;&#x5BC5;&#x56FD;&#x6D3E;&#x4EBA;&#x6740;&#x6B7B;&#xFF0C;&#x5B89;&#x6C83;&#x5141;&#x4E0E;&#x53CC;&#x80DE;&#x80CE;&#x59D0;&#x59D0;&#x7F8E;&#x6D25;&#x5B50;&#x5206;&#x79BB;&#xFF0C;&#x76F4;&#x81F3;&#x591A;&#x5E74;&#x540E;&#xFF0C;&#x6765;&#x81EA;&#x4E1C;&#x5317;&#x6297;&#x65E5;&#x6B66;&#x88C5;&#x7684;&#x5B89;&#x6C83;&#x5141;&#xFF0C;&#x548C;&#x81EA;&#x5E7C;&#x5728;&#x65E5;&#x5360;&#x533A;&#x957F;&#x5927;&#x7684;&#x7F8E;&#x6D25;&#x5B50;&#xFF0C;&#x7EC8;&#x4E8E;&#x5728;&#x4E00;&#x4E2A;&#x5C4B;&#x6A90;&#x4E0B;&#x76F8;&#x8BA4;&#xFF0C;&#x53EF;&#x8F6C;&#x773C;&#x95F4;&#xFF0C;&#x59D0;&#x59D0;&#x5C31;&#x88AB;&#x5356;&#x56FD;&#x8D3C;&#x5EB7;&#x5BC5;&#x56FD;&#x7ED9;&#x6740;&#x6B7B;&#x4E86;&#xFF0C;&#x7535;&#x5F71;&#x4E2D;&#x5168;&#x5973;&#x795E;&#x4EB2;&#x773C;&#x76EE;&#x7779;&#x59D0;&#x59D0;&#x6B7B;&#x4EA1;&#x7684;&#x90A3;&#x4E00;&#x5E55;&#x771F;&#x7684;&#x662F;&#x4EE4;&#x4EBA;&#x5FC3;&#x788E;&#x3002;&#x53EF;&#x504F;&#x504F;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4EB2;&#x624B;&#x6311;&#x9009;&#x4E86;&#x8FD9;&#x4E09;&#x540D;&#x6697;&#x6740;&#x7EC4;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x4EB2;&#x624B;&#x5C06;&#x523A;&#x6740;&#x884C;&#x52A8;&#x7684;&#x60C5;&#x62A5;&#x6CC4;&#x9732;&#x7ED9;&#x65E5;&#x65B9;&#x4EBA;&#x5458;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4ED6;&#x4ECE;&#x8863;&#x515C;&#x91CC;&#x53D6;&#x51FA;&#x5047;&#x4FE1;&#x4EF6;&#x6295;&#x5165;&#x706B;&#x5806;&#xFF0C;&#x4F2A;&#x9020;&#x51FA;&#x4FE1;&#x4EF6;&#x88AB;&#x6BC1;&#x7684;&#x5047;&#x8C61;&#x8FD9;&#x4E00;&#x5E55;&#x3002;&#x9762;&#x5BF9;&#x91D1;&#x4E5D;&#x7684;&#x6000;&#x7591;&#xFF0C;&#x5728;&#x660E;&#x77E5;&#x624B;&#x67AA;&#x91CC;&#x6CA1;&#x6709;&#x5B50;&#x5F39;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x201C;&#x4EE5;&#x6B7B;&#x660E;&#x5FD7;&#x201D;&#x3002;&#x5BF9;&#x6614;&#x65E5;&#x7684;&#x540C;&#x5FD7;&#x6BEB;&#x4E0D;&#x624B;&#x8F6F;&#xFF0C;&#x4E24;&#x4E2A;&#x88AB;&#x91D1;&#x4E5D;&#x6D3E;&#x53BB;&#x523A;&#x6740;&#x4ED6;&#x7684;&#x540C;&#x5FD7;&#xFF0C;&#x5747;&#x88AB;&#x4ED6;&#x91CD;&#x4F24;&#x751A;&#x81F3;&#x6740;&#x6B7B;&#x3002;&#x9762;&#x5BF9;&#x66FE;&#x7ECF;&#x523A;&#x6740;&#x8FC7;&#x7684;&#x65E5;&#x519B;&#x5927;&#x5C06;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x539A;&#x989C;&#x65E0;&#x803B;&#x5730;&#x9080;&#x529F;&#x8BF7;&#x8D4F;&#xFF0C;&#x5E76;&#x63A5;&#x53D7;&#x65E5;&#x519B;&#x6388;&#x4E88;&#x7684;&#x7235;&#x4F4D;&#x3002;&#x53EF;&#x6070;&#x6070;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5728;&#x559D;&#x9189;&#x9152;&#x4EE5;&#x540E;&#xFF0C;&#x8BC9;&#x8BF4;&#x671D;&#x9C9C;&#x5404;&#x79CD;&#x6B66;&#x88C5;&#x529B;&#x91CF;&#x5404;&#x81EA;&#x4E3A;&#x653F;&#x7684;&#x73B0;&#x5B9E;&#xFF0C;&#x5FCF;&#x6094;&#x628A;&#x6697;&#x6740;&#x4E09;&#x4EBA;&#x7EC4;&#x9001;&#x53BB;&#x9001;&#x6B7B;&#x3002;&#x5728;&#x4E25;&#x5211;&#x62F7;&#x6253;&#x9762;&#x524D;&#xFF0C;&#x4ED6;&#x505A;&#x4E86;&#x53DB;&#x5F92;&#xFF0C;&#x4E00;&#x5982;&#x6697;&#x6740;&#x7EC4;&#x6210;&#x5458;&#x5E72;&#x9769;&#x547D;&#x8981;&#x7ED9;&#x94B1;&#xFF0C;&#x8FD9;&#x4E9B;&#x6216;&#x8BB8;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x4F1F;&#x5149;&#x6B63;&#xFF0C;&#x53EF;&#x5B83;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x771F;&#x5B9E;&#x3002;</p>
<h1 id="&#x6F14;&#x6280;&#x4E0E;&#x989C;&#x503C;&#x540C;&#x65F6;&#x5728;&#x7EBF;&#x7684;&#x5168;&#x5973;&#x795E;"><a href="#&#x6F14;&#x6280;&#x4E0E;&#x989C;&#x503C;&#x540C;&#x65F6;&#x5728;&#x7EBF;&#x7684;&#x5168;&#x5973;&#x795E;" class="headerlink" title="&#x6F14;&#x6280;&#x4E0E;&#x989C;&#x503C;&#x540C;&#x65F6;&#x5728;&#x7EBF;&#x7684;&#x5168;&#x5973;&#x795E;"></a>&#x6F14;&#x6280;&#x4E0E;&#x989C;&#x503C;&#x540C;&#x65F6;&#x5728;&#x7EBF;&#x7684;&#x5168;&#x5973;&#x795E;</h1><p>&#x2003;&#x2003;&#x5168;&#x5973;&#x795E;&#x9970;&#x6F14;&#x7684;&#x5B89;&#x6C83;&#x5141;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6765;&#x81EA;&#x4E1C;&#x5317;&#x6297;&#x65E5;&#x6B66;&#x88C5;&#x7684;&#x72D9;&#x51FB;&#x624B;&#xFF0C;&#x4E00;&#x51FA;&#x573A;&#x5C31;&#x77AC;&#x95F4;&#x72D9;&#x6740;&#x56DB;&#x540D;&#x654C;&#x4EBA;&#xFF0C;&#x8EAB;&#x624B;&#x5F53;&#x771F;&#x662F;&#x662F;&#x4E0D;&#x51E1;&#x554A;&#xFF0C;&#x66F4;&#x4E0D;&#x5FC5;&#x8BF4;&#x7AEF;&#x7740;&#x6C64;&#x59C6;&#x751F;&#x51B2;&#x950B;&#x67AA;&#x7A9C;&#x623F;&#x9876;&#x8DE8;&#x5C4B;&#x810A;&#xFF0C;&#x5728;&#x8D1F;&#x4F24;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8DB4;&#x5728;&#x75BE;&#x9A76;&#x7684;&#x5361;&#x8F66;&#x5F15;&#x64CE;&#x76D6;&#x4E0A;&#x3002;&#x636E;&#x8BF4;&#x5168;&#x5973;&#x795E;&#x7535;&#x5F71;&#x4E2D;&#x7684;&#x52A8;&#x4F5C;&#x620F;&#x90FD;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x66FF;&#x8EAB;&#xFF0C;&#x4E00;&#x4E2A;&#x660E;&#x660E;&#x53EF;&#x4EE5;&#x9760;&#x989C;&#x503C;&#x7684;&#x4EBA;&#xFF0C;&#x5C1A;&#x4E14;&#x53EF;&#x4EE5;&#x5982;&#x6B64;&#x52AA;&#x529B;&#x5730;&#x53BB;&#x62FC;&#x640F;&#xFF0C;&#x90A3;&#x4E48;&#x8EAB;&#x4E3A;&#x666E;&#x901A;&#x4EBA;&#x7684;&#x4F60;&#x6211;&#xFF0C;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x7406;&#x7531;&#x4E0D;&#x52AA;&#x529B;&#x5462;&#xFF1F;&#x91CE;&#x86EE;&#x5973;&#x53CB;&#x65F6;&#x671F;&#x7684;&#x5168;&#x5973;&#x795E;&#xFF0C;&#x6216;&#x8BB8;&#x770B;&#x8D77;&#x6765;&#x53EA;&#x662F;&#x6F02;&#x4EAE;&#x800C;&#x5DF2;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x770B;&#x6765;&#x5219;&#x662F;&#x5B9E;&#x529B;&#x6D3E;&#x3002;&#x53EF;&#x5979;&#x540C;&#x6837;&#x662F;&#x4E00;&#x4E2A;&#x61A7;&#x61AC;&#x7740;&#x559D;&#x5496;&#x5561;&#x8C08;&#x604B;&#x7231;&#x7684;&#x5C11;&#x5973;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x770B;&#x5230;&#x59D0;&#x59D0;&#x6D01;&#x767D;&#x7684;&#x5AC1;&#x4F1A;&#x8863;&#x6CE3;&#x4E0D;&#x6210;&#x58F0;&#x7684;&#x59B9;&#x59B9;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9762;&#x5BF9;&#x4EB2;&#x751F;&#x7236;&#x4EB2;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x90FD;&#x4E0B;&#x4E0D;&#x53BB;&#x624B;&#x7684;&#x72D9;&#x51FB;&#x624B;&#x3002;&#x5728;&#x5047;&#x626E;&#x59D0;&#x59D0;&#x7F8E;&#x6D25;&#x5B50;&#x53C2;&#x52A0;&#x5A5A;&#x793C;&#x4EE5;&#x524D;&#xFF0C;&#x5979;&#x505A;&#x597D;&#x4E86;&#x6700;&#x574F;&#x7684;&#x6253;&#x7B97;&#xFF0C;&#x5C31;&#x50CF;&#x5979;&#x8111;&#x6D77;&#x4E2D;&#x6D6E;&#x73B0;&#x8FC7;&#x7684;&#x753B;&#x9762;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x654C;&#x4EBA;&#x4E71;&#x67AA;&#x626B;&#x5C04;&#x4E0B;&#xFF0C;&#x732E;&#x8840;&#x67D3;&#x7EA2;&#x4E86;&#x5979;&#x6D01;&#x767D;&#x7684;&#x5A5A;&#x7EB1;&#x2026;&#x2026;&#x8FD9;&#x6216;&#x8BB8;&#x662F;&#x201C;&#x590F;&#x5A01;&#x5937;&#x624B;&#x67AA;&#x201D;&#x8111;&#x8865;&#x7684;&#x753B;&#x9762;&#xFF1F;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x201C;&#x590F;&#x5A01;&#x5937;&#x624B;&#x67AA;&#x201D;&#x5C06;&#x5168;&#x5973;&#x795E;&#x9001;&#x5230;&#x533B;&#x9662;&#x4EE5;&#x540E;&#xFF0C;&#x201C;&#x590F;&#x5A01;&#x5937;&#x624B;&#x67AA;&#x201D;&#x8BA8;&#x8BBA;&#x8D77;&#x4ED6;&#x5BF9;&#x4E8E;&#x6697;&#x6740;&#x884C;&#x52A8;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x5168;&#x5973;&#x795E;&#x8BF4;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x8BDD;&#xFF0C;&#x5927;&#x610F;&#x662F;&#x201C;&#x6740;&#x6389;&#x65E5;&#x519B;&#x53F8;&#x4EE4;&#x548C;&#x6C49;&#x5978;&#x5EB7;&#x5BC5;&#x56FD;&#xFF0C;&#x5230;&#x5E95;&#x80FD;&#x4E0D;&#x80FD;&#x8BA9;&#x56FD;&#x5BB6;&#x72EC;&#x7ACB;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x5979;&#x5FC5;&#x987B;&#x8981;&#x8BA9;&#x4EBA;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5979;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x6218;&#x6597;&#x201D;&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x4E00;&#x523B;&#xFF0C;&#x8FD9;&#x4E2A;&#x5A07;&#x5F31;&#x800C;&#x575A;&#x5F3A;&#x7684;&#x5973;&#x6027;&#x5F62;&#x8C61;&#x5C31;&#x7ACB;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x5168;&#x5973;&#x795E;&#x5728;&#x672C;&#x7247;&#x4E2D;&#x5206;&#x9970;&#x4E24;&#x89D2;&#xFF0C;&#x5373;&#x59D0;&#x59D0;&#x7F8E;&#x6D25;&#x5B50;&#x548C;&#x59B9;&#x59B9;&#x5B89;&#x6C83;&#x5141;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x773C;&#x795E;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x59D0;&#x59D0;&#x8EAB;&#x4E0A;&#x6709;&#x90A3;&#x79CD;&#x4ECE;&#x5C0F;&#x751F;&#x6D3B;&#x5B89;&#x9038;&#x7684;&#x5A07;&#x6C14;&#xFF0C;&#x800C;&#x59B9;&#x59B9;&#x8EAB;&#x4E0A;&#x6709;&#x90A3;&#x79CD;&#x5185;&#x655B;&#x51B7;&#x9759;&#x7684;&#x5E05;&#x6C14;&#x3002;&#x6218;&#x4E89;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x6B8B;&#x9177;&#x7684;&#xFF0C;&#x5EB7;&#x5BC5;&#x56FD;&#x4E3A;&#x4E86;&#x4F9D;&#x9644;&#x65E5;&#x672C;&#x4EBA;&#xFF0C;&#x5C06;&#x7F8E;&#x6D25;&#x5B50;&#x8BEF;&#x8BA4;&#x4E3A;&#x5B89;&#x82E5;&#x5141;&#x5E76;&#x6740;&#x6B7B;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x5373;&#x4FBF;&#x6CA1;&#x6709;&#x8BA4;&#x9519;&#xFF0C;&#x4EE5;&#x5EB7;&#x5BC5;&#x56FD;&#x7684;&#x4E3A;&#x4EBA;&#xFF0C;&#x77E5;&#x9053;&#x5973;&#x513F;&#x548C;&#x72EC;&#x7ACB;&#x519B;&#x6709;&#x5173;&#x8054;&#xFF0C;&#x4ED6;&#x8FD8;&#x662F;&#x4F1A;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x56E0;&#x4E3A;&#x5973;&#x513F;&#x7684;&#x5E78;&#x798F;&#x4ED6;&#x5B8C;&#x5168;&#x4E0D;&#x5728;&#x4E4E;&#xFF0C;&#x548C;&#x65E5;&#x672C;&#x4EBA;&#x8054;&#x59FB;&#x65E0;&#x975E;&#x662F;&#x4E3A;&#x4E86;&#x62C9;&#x62E2;&#x65E5;&#x672C;&#x4EBA;&#x3002;&#x6B63;&#x5982;&#x5168;&#x5973;&#x795E;&#x6240;&#x8A00;&#xFF0C;&#x4ED6;&#x7528;&#x90A3;&#x53CC;&#x6740;&#x6B7B;&#x4E86;&#x6BCD;&#x4EB2;&#x7684;&#x624B;&#xFF0C;&#x6740;&#x6B7B;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5973;&#x513F;&#x3002;&#x4EBA;&#x7C7B;&#x7684;&#x60C5;&#x611F;&#x6709;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x8BE1;&#x5F02;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x81EA;&#x5DF1;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x517B;&#x80B2;&#x4E4B;&#x6069;&#x7684;&#x7236;&#x4EB2;&#xFF0C;&#x5BF9;&#x65B9;&#x53DB;&#x56FD;&#x6295;&#x654C;&#x52A9;&#x7EA3;&#x4E3A;&#x8650;&#xFF0C;&#x5373;&#x4F7F;&#x4E24;&#x8005;&#x95F4;&#x552F;&#x4E00;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x662F;&#x90A3;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#x8840;&#x7F18;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x201C;&#x590F;&#x5A01;&#x5937;&#x624B;&#x67AA;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x66FE;&#x7ECF;&#x662F;&#x201C;&#x6740;&#x7236;&#x8054;&#x76DF;&#x201D;&#x4E00;&#x5458;&#x7684;&#x4EBA;&#xFF0C;&#x66FF;&#x5979;&#x5F00;&#x51FA;&#x8FD9;&#x4E00;&#x67AA;&#x3002;</p>
<h1 id="&#x4E00;&#x4E2A;&#x8D85;&#x6709;&#x529B;&#x91CF;&#x611F;&#x7684;&#x6545;&#x4E8B;&#x7ED3;&#x5C3E;"><a href="#&#x4E00;&#x4E2A;&#x8D85;&#x6709;&#x529B;&#x91CF;&#x611F;&#x7684;&#x6545;&#x4E8B;&#x7ED3;&#x5C3E;" class="headerlink" title="&#x4E00;&#x4E2A;&#x8D85;&#x6709;&#x529B;&#x91CF;&#x611F;&#x7684;&#x6545;&#x4E8B;&#x7ED3;&#x5C3E;"></a>&#x4E00;&#x4E2A;&#x8D85;&#x6709;&#x529B;&#x91CF;&#x611F;&#x7684;&#x6545;&#x4E8B;&#x7ED3;&#x5C3E;</h1><p>&#x2003;&#x2003;&#x6545;&#x4E8B;&#x4ECE;&#x631F;&#x6301;&#x4EBA;&#x8D28;&#x8FD9;&#x91CC;&#x5F00;&#x59CB;&#xFF0C;&#x5C31;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x6577;&#x884D;&#x8D77;&#x6765;&#xFF0C;&#x53EF;&#x80FD;&#x8FD9;&#x91CC;&#x5C31;&#x9700;&#x8981;&#x611F;&#x60C5;&#x620F;&#x6765;&#x4F5C;&#x4E3A;&#x67D0;&#x79CD;&#x8FC7;&#x6E21;&#xFF0C;&#x5047;&#x5982;&#x4E24;&#x4E2A;&#x4EBA;&#x771F;&#x7684;&#x53BB;&#x4E86;&#x7C73;&#x62C9;&#x6CE2;&#xFF0C;&#x8FD9;&#x5C31;&#x771F;&#x7684;&#x53D8;&#x6210;&#x4E86;&#x7231;&#x60C5;&#x7535;&#x5F71;&#xFF0C;&#x53EF;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x4E0D;&#x5C31;&#x662F;&#xFF0C;&#x4E00;&#x90E8;&#x6253;&#x7740;&#x4E3B;&#x65CB;&#x5F8B;&#x5E4C;&#x5B50;&#x7684;&#x52A8;&#x4F5C;&#x7535;&#x5F71;&#x5417;&#xFF1F;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7535;&#x5F71;&#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x5A31;&#x4E50;&#x6027;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x5E7D;&#x9ED8;&#x548C;&#x7231;&#x60C5;&#x7684;&#x3002;&#x771F;&#x6B63;&#x5C06;&#x5F71;&#x7247;&#x63A8;&#x5411;&#x9AD8;&#x6F6E;&#x7684;&#x662F;&#x7ED3;&#x5C3E;&#x51FA;&#x7684;&#x5BA1;&#x5224;&#xFF0C;&#x8BC1;&#x4EBA;&#x5728;&#x5F00;&#x5EAD;&#x524D;&#x5C31;&#x88AB;&#x5EC9;&#x9521;&#x9547;&#x6D3E;&#x4EBA;&#x6740;&#x6B7B;&#xFF0C;&#x4E8E;&#x662F;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x518D;&#x8BC1;&#x660E;&#xFF0C;&#x5EC9;&#x9521;&#x9547;&#x66FE;&#x7ECF;&#x6295;&#x654C;&#x53DB;&#x56FD;&#x3001;&#x51FA;&#x5356;&#x540C;&#x5FD7;&#x7684;&#x7F6A;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6C38;&#x8FDC;&#x6709;&#x5927;&#x91CF;&#x7684;&#x65E0;&#x77E5;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x9009;&#x62E9;&#x7528;&#x66B4;&#x529B;&#x6765;&#x9762;&#x5BF9;&#x4E00;&#x540D;&#x201C;&#x97E9;&#x5978;&#x201D;&#xFF0C;&#x53EF;&#x5F53;&#x5EC9;&#x9521;&#x9547;&#x8131;&#x4E0B;&#x8863;&#x670D;&#xFF0C;&#x4E49;&#x6B63;&#x8A00;&#x8F9E;&#x5730;&#x8BB2;&#x8FF0;&#x81EA;&#x5DF1;&#x201C;&#x652F;&#x6301;&#x201D;&#x72EC;&#x7ACB;&#x8FD0;&#x52A8;&#x7684;&#x4E8B;&#x8FF9;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x7A81;&#x7136;&#x5F00;&#x59CB;&#x5BA3;&#x5E03;&#x8FD9;&#x540D;&#x201C;&#x97E9;&#x5978;&#x201D;&#x65E0;&#x7F6A;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x8BF4;&#x660E;&#x5927;&#x4F17;&#x90FD;&#x662F;&#x611A;&#x8822;&#x7684;&#xFF0C;&#x53EF;&#x6B63;&#x662F;&#x8FD9;&#x4E9B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5728;&#x5DE6;&#x53F3;&#x7740;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x8FD9;&#x548C;&#x90A3;&#x4E9B;&#x52AA;&#x529B;&#x5236;&#x9020;&#x201C;&#x7126;&#x8651;&#x201D;&#x7684;&#x4EBA;&#x6CA1;&#x6709;&#x533A;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#x771F;&#x76F8;&#xFF0C;&#x5B81;&#x613F;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x65E9;&#x5DF2;&#x56FA;&#x5316;&#x5730;&#x601D;&#x7EF4;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4EBA;&#x4E91;&#x4EA6;&#x4E91;&#xFF0C;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x5224;&#x65AD;&#xFF0C;&#x8FD9;&#x5B9E;&#x5728;&#x662F;&#x4EF6;&#x53EF;&#x6015;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6CD5;&#x5B98;&#x5931;&#x843D;&#x5730;&#x5BA3;&#x5E03;&#x8BC1;&#x636E;&#x4E0D;&#x8DB3;&#x3001;&#x5EC9;&#x9521;&#x9547;&#x65E0;&#x7F6A;&#x91CA;&#x653E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x6982;&#x5185;&#x5FC3;&#x4F1A;&#x6709;&#x67D0;&#x79CD;&#x65E0;&#x53EF;&#x5948;&#x4F55;&#x6216;&#x8005;&#x662F;&#x4E0D;&#x7518;&#x5FC3;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x8BA9;&#x6211;&#x60F3;&#x8D77;Unnatural&#x91CC;&#x9AD8;&#x6FD1;&#x8FD9;&#x4E2A;&#x6848;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8BC1;&#x660E;&#x5BF9;&#x65B9;&#x6740;&#x4EBA;&#xFF0C;&#x800C;&#x5173;&#x952E;&#x7684;&#x4FE1;&#x606F;&#x53C8;&#x88AB;&#x4E45;&#x90E8;&#x6CC4;&#x9732;&#x51FA;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E2A;&#x6848;&#x4EF6;&#x4E00;&#x5EA6;&#x5230;&#x4E86;&#x8981;&#x4FEE;&#x6539;&#x9274;&#x5B9A;&#x62A5;&#x544A;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x8FD9;&#x548C;&#x8EAB;&#x4E3A;&#x6CD5;&#x533B;&#x7684;&#x4E09;&#x6A59;&#x5FC3;&#x4E2D;&#x7684;&#x4F7F;&#x547D;&#x611F;&#x4E0D;&#x76F8;&#x7B26;&#x5408;&#xFF0C;&#x5173;&#x952E;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x795E;&#x4ED3;&#x6240;&#x957F;&#x575A;&#x6301;&#x9012;&#x4EA4;&#x4E86;&#x539F;&#x59CB;&#x7684;&#x9274;&#x5B9A;&#x62A5;&#x544A;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5236;&#x88C1;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x4F9D;&#x7136;&#x5BA2;&#x89C2;&#x5730;&#x53BB;&#x8BC1;&#x660E;&#x5BF9;&#x65B9;&#x6709;&#x7F6A;&#xFF0C;&#x4E0D;&#x51A4;&#x6789;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x56FA;&#x7136;&#x503C;&#x5F97;&#x8D5E;&#x8D4F;&#xFF0C;&#x53EF;&#x4E3A;&#x4E86;&#x8BA9;&#x5BF9;&#x65B9;&#x4F0F;&#x6CD5;&#x800C;&#x91C7;&#x7528;&#x975E;&#x6B63;&#x4E49;&#x7684;&#x624B;&#x6BB5;&#x662F;&#x5426;&#x662F;&#x6B63;&#x786E;&#x7684;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x8EAB;&#x4E3A;&#x6CD5;&#x533B;&#x7684;&#x4E09;&#x6A59;&#xFF0C;&#x7528;&#x4FEE;&#x6539;&#x9274;&#x5B9A;&#x62A5;&#x544A;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7ED9;&#x9AD8;&#x6FD1;&#x8FD9;&#x4E2A;&#x7F6A;&#x72AF;&#x5B9A;&#x5211;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4F1A;&#x5931;&#x671B;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x4E0D;&#x613F;&#x610F;&#x8F93;&#x7ED9;&#x975E;&#x6B63;&#x5E38;&#x6B7B;&#x4EA1;&#xFF0C;&#x4E0D;&#x613F;&#x610F;&#x6B63;&#x5E38;&#x7684;&#x4EBA;&#x88AB;&#x4E71;&#x5165;&#x975E;&#x6B63;&#x5E38;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x91C7;&#x7528;&#x975E;&#x6B63;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x4F24;&#x5BB3;&#x522B;&#x4EBA;&#x6216;&#x8005;&#x662F;&#x81EA;&#x5DF1;&#x3002;&#x76F8;&#x6BD4;&#x4E2D;&#x5802;&#x4F7F;&#x7528;&#x903C;&#x4F9B;&#x7684;&#x65B9;&#x5F0F;&#x67E5;&#x627E;&#x771F;&#x76F8;&#xFF0C;&#x5979;&#x66F4;&#x5E0C;&#x671B;&#x4E2D;&#x5802;&#x533B;&#x751F;&#x4EE5;&#x4E00;&#x540D;&#x6CD5;&#x533B;&#x5B66;&#x8005;&#x7684;&#x8EAB;&#x4EFD;&#x53BB;&#x6218;&#x6597;&#x3002;&#x81EA;&#x7136;&#xFF0C;&#x6545;&#x4E8B;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x6240;&#x8C13;&#x5584;&#x6076;&#x6709;&#x62A5;&#xFF0C;16&#x5E74;&#x524D;&#x7684;&#x6697;&#x6740;&#x4EFB;&#x52A1;&#xFF0C;&#x7EC8;&#x4E8E;&#x5728;&#x97E9;&#x56FD;&#x5149;&#x590D;&#x4EE5;&#x540E;&#xFF0C;&#x6709;&#x5B89;&#x6C83;&#x5141;&#x548C;&#x660E;&#x5B87;&#x91CD;&#x65B0;&#x6267;&#x884C;&#xFF0C;&#x7ED3;&#x5C3E;&#x5904;&#x88AB;&#x4E71;&#x67AA;&#x6253;&#x6B7B;&#x7684;&#x5EC9;&#x9521;&#x9547;&#xFF0C;&#x5728;&#x88AB;&#x95EE;&#x5230;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x51FA;&#x5356;&#x540C;&#x5FD7;&#x65F6;&#xFF0C;&#x8BF4;&#x4E86;&#x4E00;&#x53E5;&#x201C;&#x6211;&#x6CA1;&#x60F3;&#x5230;&#x4F1A;&#x89E3;&#x653E;&#x554A;&#x201D;&#xFF0C;&#x4E00;&#x53E5;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x5F00;&#x73A9;&#x7B11;&#x7684;&#x8BDD;&#xFF0C;&#x5176;&#x5B9E;&#x8BF4;&#x51FA;&#x4E86;&#x6218;&#x4E89;&#x5E74;&#x4EE3;&#x4EBA;&#x4EEC;&#x7684;&#x65E0;&#x5948;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6218;&#x4E89;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x5C31;&#x771F;&#x7684;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x53EF;&#x5F53;&#x6218;&#x4E89;&#x673A;&#x5668;&#x88AB;&#x53D1;&#x52A8;&#x65F6;&#xFF0C;&#x53C8;&#x6709;&#x8C01;&#x4F1A;&#x60F3;&#x5230;&#x8FD9;&#x4E9B;&#x5462;&#xFF1F;&#x88AB;&#x5377;&#x5165;&#x6218;&#x4E89;&#x91CC;&#x4EBA;&#x4EEC;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#xFF0C;&#x800C;&#x53D1;&#x52A8;&#x6218;&#x4E89;&#x7684;&#x4EBA;&#x4ECE;&#x6765;&#x4E0D;&#x8003;&#x8651;&#x4EE5;&#x540E;&#x3002;</p>
<h1 id="&#x5199;&#x5728;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x4EE5;&#x540E;"><a href="#&#x5199;&#x5728;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x4EE5;&#x540E;" class="headerlink" title="&#x5199;&#x5728;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x4EE5;&#x540E;"></a>&#x5199;&#x5728;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x4EE5;&#x540E;</h1><p>&#x2003;&#x2003;&#x65F7;&#x65E5;&#x6301;&#x4E45;&#x7684;&#x6218;&#x4E89;&#x7EC8;&#x4E8E;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x5F53;&#x753B;&#x9762;&#x5B9A;&#x683C;&#x5230;&#x5168;&#x5973;&#x795E;&#x90A3;&#x5F20;&#x8FD1;&#x4E4E;&#x7D20;&#x989C;&#x7684;&#x8138;&#x4E0A;&#x65F6;&#xFF0C;&#x5979;&#x7A81;&#x7136;&#x60F3;&#x8D77;&#x90A3;&#x4E9B;&#x66FE;&#x7ECF;&#x6700;&#x4E3A;&#x4EB2;&#x5207;&#x7684;&#x9762;&#x5B54;&#xFF0C;&#x60F3;&#x8D77;&#x201C;&#x70B8;&#x5F39;&#x4E13;&#x5BB6;&#x201D;&#x9EC4;&#x5FB7;&#x4E09;&#xFF0C;&#x60F3;&#x8D77;&#x201C;&#x901F;&#x5C04;&#x70AE;&#x201D;&#x90B1;&#x5C1A;&#x6C83;&#xFF0C;&#x60F3;&#x8D77;&#x9152;&#x9986;&#x8001;&#x677F;&#x5A18;&#x2026;&#x2026;&#x6218;&#x4E89;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x662F;&#x6C38;&#x8FDC;&#x7684;&#x4F24;&#x75DB;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x65E5;&#x672C;&#x8FD9;&#x4E2A;&#x56FD;&#x5BB6;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x4F1A;&#x5145;&#x6EE1;&#x62B5;&#x89E6;&#x60C5;&#x7EEA;&#xFF0C;&#x4F46;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x573A;&#x6218;&#x4E89;&#x5E76;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x91D1;&#x4E5D;&#x8BA4;&#x4E3A;&#x65E5;&#x672C;&#x4EBA;&#x5DF2;&#x7ECF;&#x6295;&#x964D;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x53EF;&#x4F9D;&#x9760;&#x6350;&#x52A9;&#x7EF4;&#x6301;&#xFF0C;&#x4EE5;&#x5149;&#x660E;&#x6B63;&#x5927;&#x5730;&#x56DE;&#x5230;&#x56FD;&#x5185;&#x641E;&#x5EFA;&#x8BBE;&#xFF0C;&#x53EF;&#x4E8B;&#x5B9E;&#x4E0A;&#x50CF;&#x5EC9;&#x9521;&#x9547;&#x8FD9;&#x6837;&#x6295;&#x65E5;&#x6D3E;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5F97;&#x5230;&#x6E05;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x91D1;&#x4E5D;&#x5728;&#x56DE;&#x56FD;&#x540E;&#x4E0D;&#x4E45;&#x5C31;&#x88AB;&#x97E9;&#x56FD;&#x6FC0;&#x8FDB;&#x5206;&#x5B50;&#x523A;&#x6740;&#xFF0C;&#x5EC9;&#x9521;&#x9547;&#x6240;&#x8BF4;&#x7684;&#x72EC;&#x7ACB;&#x8FD0;&#x52A8;&#x6D3E;&#x7CFB;&#x4E4B;&#x4E89;&#xFF0C;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#x662F;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x7740;&#x7684;&#xFF0C;&#x91D1;&#x4E5D;&#x5C31;&#x662F;&#x88AB;&#x5377;&#x5165;&#x5230;&#x8FD9;&#x573A;&#x653F;&#x6CBB;&#x6597;&#x4E89;&#x4E2D;&#x7684;&#x727A;&#x7272;&#x54C1;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x91D1;&#x5143;&#x51E4;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;&#x671D;&#x9C9C;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x6D3E;&#x7CFB;&#x4E4B;&#x4E89;&#xFF0C;&#x66F4;&#x662F;&#x52A0;&#x5267;&#x4E86;&#x6574;&#x4E2A;&#x671D;&#x9C9C;&#x534A;&#x5C9B;&#x7684;&#x5206;&#x88C2;&#xFF0C;&#x5728;&#x8FD9;&#x7247;&#x571F;&#x5730;&#x4E0A;&#xFF0C;&#x66FE;&#x7ECF;&#x4E00;&#x8D77;&#x6218;&#x6597;&#x8FC7;&#x7684;&#x5144;&#x5F1F;&#x3001;&#x670B;&#x53CB;&#xFF0C;&#x6700;&#x7EC8;&#x53D8;&#x6210;&#x5175;&#x620E;&#x76F8;&#x5411;&#x7684;&#x654C;&#x4EBA;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53EF;&#x8FD9;&#x771F;&#x7684;&#x662F;&#x548C;&#x5E73;&#x5417;&#xFF1F;&#x6218;&#x4E89;&#x771F;&#x7684;&#x7ED3;&#x675F;&#x4E86;&#x5417;&#xFF1F;&#x88AB;38&#x7EBF;&#x5206;&#x5272;&#x5F00;&#x7684;&#x8FD9;&#x4E24;&#x4E2A;&#x56FD;&#x5BB6;&#xFF0C;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#x97E9;&#x5267;&#x3001;&#x6599;&#x7406;&#x548C;&#x79D1;&#x6280;&#x4E3A;&#x4E16;&#x754C;&#x6240;&#x77E5;&#xFF0C;&#x4E00;&#x4E2A;&#x66F4;&#x50CF;&#x662F;&#x6539;&#x9769;&#x5F00;&#x653E;&#x521D;&#x671F;&#x7684;&#x4E2D;&#x56FD;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8FD8;&#x8BF4;&#x795E;&#x79D8;&#x8FD8;&#x662F;&#x843D;&#x540E;&#x3002;&#x4F55;&#x51B5;&#xFF0C;&#x8FD9;&#x6761;38&#x7EBF;&#x662F;&#x505C;&#x6218;&#x7EBF;&#xFF0C;&#x5E76;&#x975E;&#x67D0;&#x79CD;&#x548C;&#x5E73;&#x7684;&#x8C61;&#x5F81;&#xFF0C;&#x800C;&#x76F4;&#x81F3;&#x4ECA;&#x5929;&#xFF0C;&#x8FD9;&#x79CD;&#x523A;&#x6740;&#x7684;&#x9634;&#x5F71;&#x4E00;&#x76F4;&#x7B3C;&#x7F69;&#x5728;&#x97E9;&#x56FD;&#x653F;&#x575B;&#x4E0A;&#xFF0C;&#x97E9;&#x56FD;&#x73B0;&#x4EFB;&#x603B;&#x7EDF;&#x6734;&#x69FF;&#x60E0;&#x7684;&#x7236;&#x4EB2;&#x548C;&#x6BCD;&#x4EB2;&#x5148;&#x540E;&#x90FD;&#x6B7B;&#x4E8E;&#x523A;&#x6740;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5373;&#x4F7F;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x5C31;&#x80FD;&#x6362;&#x56DE;&#x548C;&#x5E73;&#x5417;&#xFF1F;&#x5C31;&#x80FD;&#x629A;&#x5E73;&#x4EBA;&#x4EEC;&#x5FC3;&#x4E2D;&#x7684;&#x4F24;&#x75DB;&#x5417;&#xFF1F;&#x671D;&#x9C9C;&#x4E0E;&#x97E9;&#x56FD;&#xFF0C;&#x4E5F;&#x8BB8;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x751F;&#x4E4B;&#x5E74;&#x91CC;&#xFF0C;&#x90FD;&#x96BE;&#x4EE5;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x771F;&#x6B63;&#x5730;&#x63E1;&#x624B;&#x8A00;&#x548C;&#xFF0C;&#x5C31;&#x50CF;&#x82CF;&#x8054;&#x89E3;&#x4F53;&#x4EE5;&#x540E;&#x4E0D;&#x4F1A;&#x518D;&#x8054;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6B27;&#x76DF;&#x5E76;&#x975E;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x7262;&#x4E0D;&#x53EF;&#x7834;&#xFF0C;&#x7231;&#x5C14;&#x5170;&#x548C;&#x5317;&#x7231;&#x5C14;&#x5170;&#x539F;&#x672C;&#x5C31;&#x662F;&#x4E00;&#x5BB6;&#xFF0C;&#x5370;&#x5EA6;&#x548C;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x662F;&#x6B96;&#x6C11;&#x6218;&#x4E89;&#x7684;&#x9057;&#x7559;&#x95EE;&#x9898;&#x2026;&#x2026;&#x6218;&#x4E89;&#xFF0C;&#x5E26;&#x6765;&#x7684;&#x574F;&#x5904;&#xFF0C;&#x6C38;&#x8FDC;&#x6BD4;&#x597D;&#x5904;&#x8981;&#x591A;&#x3002;&#x6211;&#x4EEC;&#x5411;&#x5F80;&#x94F8;&#x5251;&#x4E3A;&#x7281;&#x7684;&#x548C;&#x5E73;&#x751F;&#x6D3B;&#xFF0C;&#x53EF;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x4EE5;&#x540E;&#xFF0C;&#x662F;&#x5426;&#x771F;&#x7684;&#x80FD;&#x5E26;&#x6765;&#x548C;&#x5E73;&#xFF0C;&#x4EBA;&#x5FC3;&#x4E2D;&#x7684;&#x4F24;&#x75DB;&#x9700;&#x8981;&#x591A;&#x4E45;&#x53EF;&#x4EE5;&#x6108;&#x5408;&#xFF0C;&#x4EBA;&#x4E0E;&#x4EBA;&#x7684;&#x76F8;&#x4E89;&#x9010;&#x5229;&#x4E4B;&#x5FC3;&#x9700;&#x8981;&#x591A;&#x4E45;&#x53EF;&#x4EE5;&#x5E73;&#x606F;&#x3002;</p>
<p>&#x2003;&#x2003;2018&#x5E74;&#x7684;&#x513F;&#x7AE5;&#x8282;&#xFF0C;&#x540C;&#x5F80;&#x5E74;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x8BB8;&#x5D69;&#x4E3A;&#x70AE;&#x706B;&#x4E2D;&#x7684;&#x53D9;&#x5229;&#x4E9A;&#x5B69;&#x5B50;&#x4EEC;&#xFF0C;&#x521B;&#x4F5C;&#x4E86;&#x4E00;&#x9996;&#x65B0;&#x6B4C;&#x300A;&#x5927;&#x5343;&#x4E16;&#x754C;&#x300B;&#xFF0C;&#x8FD9;&#x9996;&#x6B4C;&#x4EE5;2017&#x5E74;4&#x6708;15&#x65E5;&#x53D9;&#x5229;&#x4E9A;&#x70B8;&#x5F39;&#x88AD;&#x51FB;&#x4E8B;&#x4EF6;&#x4E3A;&#x80CC;&#x666F;&#xFF0C;&#x547C;&#x5524;&#x7231;&#x4E0E;&#x548C;&#x5E73;&#xFF0C;&#x63A7;&#x8BC9;&#x90A3;&#x4E9B;&#x8086;&#x610F;&#x53D1;&#x52A8;&#x6218;&#x4E89;&#xFF0C;&#x800C;&#x5C06;&#x65E0;&#x8F9C;&#x5B69;&#x7AE5;&#x5377;&#x5165;&#x6218;&#x706B;&#x7684;&#x4EBA;&#x4EEC;&#x3002;&#x5927;&#x5343;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x5927;&#x4EBA;&#x4EEC;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x4F60;&#x4EEC;&#x66FE;&#x7ECF;&#x90FD;&#x662F;&#x5B69;&#x5B50;&#xFF0C;&#x5F53;&#x4EBA;&#x4EEC;&#x90FD;&#x5728;&#x901A;&#x8FC7;&#x6652;&#x5A03;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5EA6;&#x8FC7;&#x513F;&#x7AE5;&#x8282;&#x65F6;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x4F1A;&#x60F3;&#x5230;&#x5728;&#x4E16;&#x754C;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x6709;&#x4EBA;&#x5728;&#x7A7F;&#x7740;&#x6350;&#x52A9;&#x7684;&#x8863;&#x670D;&#x548C;&#x73A9;&#x5177;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x66F4;&#x662F;&#x88AB;&#x8FEB;&#x4EAB;&#x53D7;&#x7740;&#x6E29;&#x67D4;&#x7684;&#x66B4;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5C0F;&#x7ED9;&#x5C0F;&#x5B69;&#x5B50;&#x7684;&#x73A9;&#x5177;&#x67AA;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x771F;&#x7684;&#x53D8;&#x6210;&#x8377;&#x67AA;&#x5B9E;&#x5F39;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5728;&#x76DB;&#x4E16;&#x4E4B;&#x5E74;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8D2B;&#x5BCC;&#x4E4B;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x865A;&#x5B9E;&#x4EA4;&#x9519;&#x8DEF;&#x53E3;&#xFF0C;&#x4E0D;&#x65AD;&#x627E;&#x5BFB;&#xFF0C;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x76F8;&#x9047;&#x3002;&#x613F;&#x5927;&#x5343;&#x4E16;&#x754C;&#xFF0C;&#x518D;&#x65E0;&#x6218;&#x4E89;&#xFF0C;&#x518D;&#x65E0;&#x66B4;&#x529B;&#xFF0C;&#x613F;&#x6BCF;&#x4E2A;&#x6DF1;&#x7231;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x80FD;&#x88AB;&#x6E29;&#x67D4;&#x5BF9;&#x5F85;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2941880815/">米花之味：永远相信美好的事情</a></li><li><a href="https://qinyuanpei.github.io/posts/2613006280/">一念执着，千山无阻</a></li><li><a href="https://qinyuanpei.github.io/posts/1933583281/">愿你和我一样喜欢蛋炒饭</a></li><li><a href="http://www.davidfnck.com/talkshow/no_surprise_in_the_end.html/">预告片好过正片的电影</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2462008667/" rel="external">关于电影《暗杀》背后的故事和想法</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2462008667/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2462008667/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/全智贤/">全智贤</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/和平/">和平</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/影评/">影评</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2462008667/&title=《关于电影《暗杀》背后的故事和想法》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2462008667/&title=《关于电影《暗杀》背后的故事和想法》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2462008667/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《关于电影《暗杀》背后的故事和想法》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2462008667/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2462008667/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/172426938/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">一个由服务器时区引发的Bug</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3782208845/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">爱情像一场霍乱</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2462008667/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2462008667/&title=《关于电影《暗杀》背后的故事和想法》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2462008667/&title=《关于电影《暗杀》背后的故事和想法》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2462008667/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《关于电影《暗杀》背后的故事和想法》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2462008667/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2462008667/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2462008667/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
