<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        像诗人一样睿智，像天才一样疯狂 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;我不知道大家如何定义程序员这个工作，在我看来，在某种意义上，程序员和艺术家们具有相同之处，我们都是创作者，和诗人、画家、作家等等这些职业相近，我们都在试图创作出优秀的作品，我们借助编程语言来重构我们对这个世界的认识、借助抽象的概念来创造这个世界上不存在的东西，所以我们对自由和创造的渴望，来源自我们在这个世界上写下的第一行代码，或许这像是一个充满理想主义的臆想，可这并不重要，">
<meta name="keywords" content="黑客,画家,诗人">
<meta property="og:type" content="article">
<meta property="og:title" content="像诗人一样睿智，像天才一样疯狂">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/3653716295/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;我不知道大家如何定义程序员这个工作，在我看来，在某种意义上，程序员和艺术家们具有相同之处，我们都是创作者，和诗人、画家、作家等等这些职业相近，我们都在试图创作出优秀的作品，我们借助编程语言来重构我们对这个世界的认识、借助抽象的概念来创造这个世界上不存在的东西，所以我们对自由和创造的渴望，来源自我们在这个世界上写下的第一行代码，或许这像是一个充满理想主义的臆想，可这并不重要，">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="像诗人一样睿智，像天才一样疯狂">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;我不知道大家如何定义程序员这个工作，在我看来，在某种意义上，程序员和艺术家们具有相同之处，我们都是创作者，和诗人、画家、作家等等这些职业相近，我们都在试图创作出优秀的作品，我们借助编程语言来重构我们对这个世界的认识、借助抽象的概念来创造这个世界上不存在的东西，所以我们对自由和创造的渴望，来源自我们在这个世界上写下的第一行代码，或许这像是一个充满理想主义的臆想，可这并不重要，">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">像诗人一样睿智，像天才一样疯狂</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">像诗人一样睿智，像天才一样疯狂</h1>
        <h5 class="subtitle">
            
                <time datetime="2016-10-01T17:12:43.000Z" itemprop="datePublished" class="page-time">
  2016-10-01
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-像诗人一样睿智，像天才一样疯狂" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">像诗人一样睿智，像天才一样疯狂</h1>
        <div class="post-meta">
            <time class="post-time" title="2016-10-01 17:12:43" datetime="2016-10-01T17:12:43.000Z" itemprop="datePublished">2016-10-01</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        24 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x548C;&#x827A;&#x672F;&#x5BB6;&#x4EEC;&#x5177;&#x6709;&#x76F8;&#x540C;&#x4E4B;&#x5904;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x521B;&#x4F5C;&#x8005;&#xFF0C;&#x548C;&#x8BD7;&#x4EBA;&#x3001;&#x753B;&#x5BB6;&#x3001;&#x4F5C;&#x5BB6;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x804C;&#x4E1A;&#x76F8;&#x8FD1;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5728;&#x8BD5;&#x56FE;&#x521B;&#x4F5C;&#x51FA;&#x4F18;&#x79C0;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x6211;&#x4EEC;&#x501F;&#x52A9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x91CD;&#x6784;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x8BA4;&#x8BC6;&#x3001;&#x501F;&#x52A9;&#x62BD;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x6765;&#x521B;&#x9020;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5BF9;&#x81EA;&#x7531;&#x548C;&#x521B;&#x9020;&#x7684;&#x6E34;&#x671B;&#xFF0C;&#x6765;&#x6E90;&#x81EA;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x5199;&#x4E0B;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x7684;&#x81C6;&#x60F3;&#xFF0C;&#x53EF;&#x8FD9;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4F60;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3001;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x4F60;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x5C06;&#x7A0B;&#x5E8F;&#x5458;&#x89C6;&#x4E3A;&#x9020;&#x68A6;&#x8005;&#xFF0C;&#x5C31;&#x50CF;&#x6BCF;&#x4E00;&#x4E2A;&#x5B69;&#x5B50;&#x5728;&#x642D;&#x79EF;&#x6728;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5EFA;&#x7B51;&#x5E08;&#x7684;&#x68A6;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8BA9;&#x4EE3;&#x7801;&#x7B80;&#x6D01;&#x3001;&#x4F18;&#x96C5;&#xFF0C;&#x4F60;&#x540C;&#x6837;&#x9009;&#x62E9;&#x8BA9;&#x4EE3;&#x7801;&#x80AE;&#x810F;&#x3001;&#x4E11;&#x964B;&#xFF0C;&#x4F60;&#x76F8;&#x4FE1;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x6267;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7ED9;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x66F4;&#x591A;&#x521B;&#x9020;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x4F1F;&#x5927;&#x7684;&#x827A;&#x672F;&#x5BB6;&#x90FD;&#x662F;&#x5B64;&#x72EC;&#x7684;&#x3002;&#x4ECE;&#x68B5;&#x9AD8;&#x90A3;&#x5FE7;&#x90C1;&#x800C;&#x72C2;&#x91CE;&#x7684;&#x7ED8;&#x753B;&#x4F5C;&#x54C1;&#xFF0C;&#x5230;&#x6C38;&#x8FDC;&#x5982;&#x7AE5;&#x8BDD;&#x738B;&#x56FD;&#x91CC;&#x5929;&#x771F;&#x5B69;&#x5B50;&#x4E00;&#x822C;&#x7684;&#x987E;&#x57CE;&#x2026;&#x2026;&#x6216;&#x8BB8;&#x8FD9;&#x79CD;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x5B64;&#x72EC;&#x611F;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x5BBF;&#x547D;&#x822C;&#x7684;&#x8BC5;&#x5492;&#x5427;&#xFF01;&#x7A0B;&#x5E8F;&#x5458;&#x540C;&#x6837;&#x662F;&#x5B64;&#x72EC;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x7684;&#x73B0;&#x4EE3;&#x6587;&#x660E;&#xFF0C;&#x9AD8;&#x5EA6;&#x4F9D;&#x8D56;&#x7740;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x521B;&#x4F5C;&#x7684;&#x5404;&#x79CD;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x88AB;&#x9690;&#x85CF;&#x5728;&#x5E55;&#x540E;&#x7684;&#x9B54;&#x672F;&#x5E08;&#xFF0C;&#x6C38;&#x8FDC;&#x88AB;&#x4EBA;&#x4EEC;&#x5FFD;&#x7565;&#x751A;&#x81F3;&#x662F;&#x9057;&#x5FD8;&#xFF0C;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x6837;&#x5B64;&#x72EC;&#xFF0C;&#x5F53;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7ECF;&#x8FC7;&#x94FE;&#x63A5;&#x548C;&#x7F16;&#x8BD1;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x5316;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4EE5;&#x540E;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x518D;&#x8BB0;&#x5F97;&#x5B83;&#x4EEC;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x4EBA;&#x4EEC;&#x9700;&#x8981;&#x4F60;&#xFF0C;&#x53EF;&#x662F;&#x4EBA;&#x4EEC;&#x4ECE;&#x6765;&#x4E0D;&#x60F3;&#x4E86;&#x89E3;&#x4F60;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x5B64;&#x72EC;&#x4F1A;&#x4ECE;&#x5FC3;&#x7075;&#x4E0A;&#x6467;&#x6BC1;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x201C;&#x53E4;&#x6765;&#x5723;&#x8D24;&#x7686;&#x5BC2;&#x5BDE;&#xFF0C;&#x552F;&#x6709;&#x996E;&#x8005;&#x7559;&#x5176;&#x540D;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x609F;&#x5728;&#x53F8;&#x9A6C;&#x8FC1;&#x7684;&#x300A;&#x62A5;&#x4EFB;&#x5B89;&#x4E66;&#x300B;&#x91CC;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x52A0;&#x73B2;&#x79BB;&#x5C3D;&#x81F4;&#xFF1A;&#x76D6;&#x6587;&#x738B;&#x62D8;&#x800C;&#x6F14;&#x5468;&#x6613;&#xFF1B;&#x4EF2;&#x5C3C;&#x5384;&#x800C;&#x4F5C;&#x6625;&#x79CB;&#xFF1B;&#x5C48;&#x539F;&#x653E;&#x9010;&#xFF0C;&#x4E43;&#x8D4B;&#x79BB;&#x9A9A;&#xFF1B;&#x5DE6;&#x4E18;&#x5931;&#x660E;&#xFF0C;&#x53A5;&#x6709;&#x56FD;&#x8BED;&#xFF1B;&#x5B59;&#x5B50;&#x8191;&#x811A;&#xFF0C;&#x5175;&#x6CD5;&#x4FEE;&#x5217;&#xFF1B;&#x4E0D;&#x97E6;&#x8FC1;&#x8700;&#xFF0C;&#x4E16;&#x4F20;&#x5415;&#x89C8;&#xFF1B;&#x97E9;&#x975E;&#x56DA;&#x79E6;&#xFF0C;&#x5B64;&#x6124;&#x8BF4;&#x96BE;&#xFF1B;&#x8BD7;&#x4E09;&#x767E;&#x7BC7;&#xFF0C;&#x5927;&#x62B5;&#x5723;&#x8D24;&#x53D1;&#x594B;&#x4E4B;&#x6240;&#x4E3A;&#x4F5C;&#x4E5F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x591F;&#x5C06;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x90FD;&#x5F53;&#x505A;&#x8BD7;&#x6B4C;&#x4E00;&#x6837;&#x7684;&#x827A;&#x672F;&#x54C1;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5728;&#x5B57;&#x91CC;&#x884C;&#x95F4;&#x6298;&#x5C04;&#x51FA;&#x660E;&#x663E;&#x7684;&#x4E2A;&#x4EBA;&#x6C14;&#x8D28;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x771F;&#x6B63;&#x5728;&#x4E4E;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5B83;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x6C38;&#x8FDC;&#x6CA1;&#x6709;&#x4EBA;&#x5173;&#x5FC3;&#x3002;&#x6211;&#x4EEC;&#x6574;&#x5929;&#x9762;&#x5BF9;&#x7740;&#x51B7;&#x51B0;&#x51B0;&#x5730;&#x6DB2;&#x6676;&#x5C4F;&#x5E55;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7406;&#x6240;&#x5F53;&#x7136;&#x5730;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x8BBE;&#x5907;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x6CA1;&#x6709;&#x611F;&#x60C5;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x5E94;&#x8BE5;&#x662F;&#x88AB;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x65E0;&#x60C5;&#x5632;&#x5F04;&#x7684;&#x6570;&#x5B57;&#x5316;&#x5DE5;&#x5177;&#x3002;&#x53EF;&#x8BBD;&#x523A;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x624B;&#x673A;&#x7684;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x79D8;&#x5BC6;&#x90FD;&#x9690;&#x85CF;&#x5728;&#x8FD9;&#x4E2A;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x7406;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#x91CC;&#xFF0C;&#x8FD9;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x4EEC;&#x5C06;&#x6211;&#x4EEC;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x4EA4;&#x7ED9;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x7684;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x4E2A;&#x7B11;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x518D;&#x90A3;&#x4E48;&#x5B64;&#x72EC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x5B83;&#x4EEC;&#x6210;&#x4E3A;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x70D9;&#x5370;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6CE8;&#x91CA;&#x5E2E;&#x52A9;&#x4EBA;&#x7C7B;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x3001;&#x7406;&#x89E3;&#x4F60;&#x81EA;&#x5DF1;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x51FA;&#x4E00;&#x79CD;&#x65E0;&#x9650;&#x63A5;&#x8FD1;&#x771F;&#x76F8;&#x6216;&#x8005;&#x771F;&#x7406;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E00;&#x884C;&#x884C;&#x4EE3;&#x7801;&#x5F71;&#x54CD;&#x5386;&#x53F2;&#x6216;&#x8005;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x4E3A;&#x4E86;&#x6D3B;&#x7740;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E54;&#x5E03;&#x65AF;&#x66FE;&#x7ECF;&#x5F15;&#x7528;&#x6BD5;&#x52A0;&#x7D22;&#x7684;&#x540D;&#x8A00;&#xFF1A;&#x4F18;&#x79C0;&#x7684;&#x827A;&#x672F;&#x5BB6;&#x590D;&#x5236;&#xFF0C;&#x4F1F;&#x5927;&#x7684;&#x827A;&#x672F;&#x5BB6;&#x5077;&#x7A83;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x4F5C;&#x4E3A;&#x7406;&#x7531;&#x5BF9;&#x65BD;&#x4E50;&#x516C;&#x53F8;&#x8FDB;&#x884C;&#x4E86;&#x75AF;&#x72C2;&#x7684;&#x201C;&#x76D7;&#x7A83;&#x201D;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x8EAB;&#x4E0A;&#x6700;&#x8BA9;&#x6211;&#x7740;&#x8FF7;&#x7684;&#x662F;&#x90A3;&#x7075;&#x9B42;&#x6DF1;&#x5904;&#x90A3;&#x79CD;&#x827A;&#x672F;&#x5BB6;&#x7684;&#x6C14;&#x8D28;&#xFF0C;&#x4ED6;&#x59CB;&#x7EC8;&#x76F8;&#x4FE1;&#x4EFB;&#x4F55;&#x4EA7;&#x54C1;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4EBA;&#x7684;&#x4E00;&#x79CD;&#x81EA;&#x7136;&#x5EF6;&#x4F38;&#xFF0C;&#x800C;&#x6B63;&#x662F;&#x8FD9;&#x79CD;&#x5BF9;&#x8D28;&#x91CF;&#x3001;&#x7406;&#x60F3;&#x548C;&#x5FC3;&#x7075;&#x7684;&#x4E13;&#x6CE8;&#xFF0C;&#x8BA9;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x7684;&#x4EA7;&#x54C1;&#x5728;&#x8BBE;&#x8BA1;&#x548C;&#x54C1;&#x5473;&#x4E0A;&#x663E;&#x5F97;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3002;&#x5728;&#x9EA6;&#x91D1;&#x5854;&#x7535;&#x8111;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E0A;&#xFF0C;&#x4ED6;&#x5BF9;&#x5B8C;&#x7F8E;&#x7684;&#x6781;&#x81F4;&#x8FFD;&#x6C42;&#xFF0C;&#x8BA9;&#x4ED6;&#x5BF9;&#x827A;&#x672F;&#x548C;&#x8BBE;&#x8BA1;&#x7684;&#x90A3;&#x79CD;&#x5929;&#x6027;&#x5F97;&#x5230;&#x91CA;&#x653E;&#xFF0C;&#x53EF;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x4ED6;&#x88AB;&#x65AF;&#x5361;&#x5229;&#x6392;&#x6324;&#x51FA;&#x82F9;&#x679C;&#x516C;&#x53F8;&#xFF0C;&#x6216;&#x8BB8;&#x5728;&#x8FD9;&#x4E2A;&#x4EE5;&#x6210;&#x8D25;&#x8BBA;&#x82F1;&#x96C4;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x662F;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x8005;&#xFF0C;&#x53EF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4F9D;&#x7136;&#x9700;&#x8981;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#xFF0C;&#x591A;&#x5E74;&#x540E;&#xFF0C;&#x5F53;&#x4EBA;&#x4EEC;&#x63D0;&#x5230;&#x82F9;&#x679C;&#x7535;&#x8111;&#x603B;&#x4F1A;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x5730;&#x60F3;&#x5230;Mac&#x8FD9;&#x4E2A;&#x54C1;&#x724C;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#x8FD9;&#x662F;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x7684;&#x80DC;&#x5229;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5929;&#x624D;&#x4E0E;&#x666E;&#x901A;&#x4EBA;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x505A;&#x51FA;&#x5728;&#x6211;&#x4EEC;&#x666E;&#x901A;&#x4EBA;&#x773C;&#x4E2D;&#x663E;&#x5F97;&#x201C;&#x75AF;&#x72C2;&#x201D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x7535;&#x5F71;&#x300A;&#x4E54;&#x5E03;&#x65AF;&#x300B;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x8BF4;&#xFF1A;&#x201C;&#x53EA;&#x6709;&#x75AF;&#x72C2;&#x5230;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x80FD;&#x6539;&#x53D8;&#x4E16;&#x754C;&#x7684;&#x4EBA;&#xFF0C;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x6539;&#x53D8;&#x4E16;&#x754C;&#x201D;&#xFF0C;&#x800C;&#x8FD9;&#x91CC;&#x5BF9;&#x5929;&#x624D;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4ED6;&#x4EEC;&#x7279;&#x7ACB;&#x72EC;&#x884C;&#x3001;&#x6840;&#x9A9C;&#x4E0D;&#x9A6F;&#x3001;&#x9EBB;&#x70E6;&#x5236;&#x9020;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x683C;&#x683C;&#x4E0D;&#x5165;&#x7684;&#x4E00;&#x7FA4;&#x4EBA;&#xFF0C;&#x4E60;&#x60EF;&#x7528;&#x4E0D;&#x540C;&#x773C;&#x5149;&#x770B;&#x4E8B;&#x60C5;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x53D7;&#x89C4;&#x5219;&#x7EA6;&#x675F;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x65E2;&#x6210;&#x4E8B;&#x5B9E;&#x4E0D;&#x5C51;&#x4E00;&#x987E;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x4ED6;&#x4EEC;&#xFF0C;&#x4EA6;&#x53EF;&#x53CD;&#x9A73;&#x4ED6;&#x4EEC;&#xFF0C;&#x6216;&#x8D5E;&#x9882;&#x6216;&#x8BCB;&#x6BC1;&#x4ED6;&#x4EEC;&#xFF0C;&#x4F60;&#x552F;&#x4E00;&#x505A;&#x4E0D;&#x5230;&#x7684;&#x5C31;&#x662F;&#x5FFD;&#x89C6;&#x4ED6;&#x4EEC;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5E26;&#x6765;&#x53D8;&#x9769;&#xFF0C;&#x4ED6;&#x4EEC;&#x63A8;&#x52A8;&#x4EBA;&#x7C7B;&#x5411;&#x524D;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x4E9B;&#x4EBA;&#x5C06;&#x4ED6;&#x4EEC;&#x89C6;&#x4F5C;&#x75AF;&#x5B50;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x5929;&#x624D;&#x3002;&#x5BF9;&#x5927;&#x90E8;&#x5206;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x53EF;&#x8FD9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x505C;&#x6B62;&#x52AA;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x7684;&#x52AA;&#x529B;&#x90FD;&#x5C1A;&#x672A;&#x8FBE;&#x5230;&#x62FC;&#x5929;&#x8D4B;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x4F55;&#x51B5;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x8FDE;&#x5929;&#x8D4B;&#x90FD;&#x6CA1;&#x6709;&#x5462;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x53BB;&#x505A;&#x4E9B;&#x75AF;&#x72C2;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x548C;&#x5B8C;&#x7F8E;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x7559;&#x4E0B;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5370;&#x8BB0;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x660E;&#x767D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E54;&#x5E03;&#x65AF;&#x5929;&#x751F;&#x5C31;&#x6709;&#x4E00;&#x79CD;&#x60F3;&#x8981;&#x548C;IBM&#x6297;&#x8861;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x4FC3;&#x6210;&#x4E86;&#x8BA9;&#x4EBA;&#x4EEC;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x201D;1984&#x201D;&#x5E7F;&#x544A;&#xFF0C;&#x5176;&#x521B;&#x610F;&#x6765;&#x81EA;&#x4E54;&#x6CBB;&#xB7;&#x5965;&#x5A01;&#x5C14;&#x7684;&#x5C0F;&#x8BF4;&#x300A;&#x4E00;&#x4E5D;&#x516B;&#x56DB;&#x300B;&#xFF0C;&#x5E76;&#x501F;&#x52A9;&#x5C0F;&#x8BF4;&#x4E2D;&#x7684;&#x201C;&#x5927;&#x4F6C;&#x201D;&#x6620;&#x5C04;&#x5F53;&#x65F6;&#x7684;&#x84DD;&#x8272;&#x5DE8;&#x4EBA;IBM&#xFF0C;&#x8FD9;&#x4E2A;&#x4E3E;&#x52A8;&#x8BA9;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x3001;&#x8BA9;Mac&#x6210;&#x4E3A;&#x4EBA;&#x4EEC;&#x5FC3;&#x4E2D;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x7684;&#x5316;&#x8EAB;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E3E;&#x52A8;&#x76F8;&#x5F53;&#x5730;&#x75AF;&#x72C2;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x751A;&#x81F3;&#x5728;&#x300A;&#x7845;&#x8C37;&#x4F20;&#x5947;&#x300B;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x75AF;&#x72C2;&#x88AB;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x52A0;&#x6DCB;&#x6F13;&#x5C3D;&#x81F4;&#xFF1A;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#x6765;&#x8BA4;&#x8BC6;&#xFF0C;&#x50CF;&#x827A;&#x672F;&#x5BB6;&#x6216;&#x8005;&#x8BD7;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x6B63;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x7684;&#x6240;&#x4F5C;&#x6240;&#x4E3A;&#xFF0C;&#x91CD;&#x5199;&#x4EBA;&#x7C7B;&#x601D;&#x60F3;&#x7684;&#x5386;&#x53F2;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x6781;&#x529B;&#x8FFD;&#x6C42;&#x4EE3;&#x7801;&#x7684;&#x4F18;&#x96C5;&#x3001;&#x6027;&#x80FD;&#x7684;&#x51FA;&#x4F17;&#x4EE5;&#x53CA;&#x67B6;&#x6784;&#x7684;&#x826F;&#x597D;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x505A;&#x4E9B;&#xFF0C;&#x771F;&#x6B63;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x4E4E;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x5E38;&#x5E38;&#x88AB;&#x9700;&#x6C42;&#x548C;&#x95EE;&#x9898;&#x5DE6;&#x53F3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x90FD;&#x4E0D;&#x5728;&#x4E4E;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x4E0D;&#x4F1A;&#x6709;&#x7B2C;&#x4E8C;&#x4E2A;&#x4EBA;&#x66F4;&#x52A0;&#x5728;&#x4E4E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5929;&#x624D;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BB2;&#x662F;&#x5B64;&#x72EC;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5929;&#x624D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6CE8;&#x5B9A;&#x4F1A;&#x8D85;&#x8D8A;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x3002;&#x53E4;&#x5F80;&#x4ECA;&#x6765;&#xFF0C;&#x65E0;&#x6570;&#x4EC1;&#x4EBA;&#x5FD7;&#x58EB;&#xFF0C;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6240;&#x4ED8;&#x8BF8;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x7684;&#x8BA4;&#x8BC6;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x800C;&#x5DF2;&#x3002;&#x9065;&#x60F3;&#x592A;&#x53E4;&#x65F6;&#x671F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x5C1A;&#x6D41;&#x4F20;&#x7740;&#x8BF8;&#x795E;&#x521B;&#x9020;&#x4E16;&#x754C;&#x7684;&#x4F20;&#x8BF4;&#xFF0C;&#x5730;&#x7403;&#x4E0A;&#x6216;&#x8BB8;&#x8FD8;&#x6CA1;&#x6709;&#x4EBA;&#x7C7B;&#x51FA;&#x73B0;&#xFF0C;&#x6700;&#x65E9;&#x7684;&#x53E4;&#x733F;&#x8FD8;&#x6CA1;&#x6709;&#x5B66;&#x4F1A;&#x76F4;&#x7ACB;&#x884C;&#x8D70;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5BF9;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x6F2B;&#x957F;&#xFF0C;&#x53EF;&#x5B83;&#x5BF9;&#x6574;&#x4E2A;&#x5B87;&#x5B99;&#x3001;&#x6574;&#x4E2A;&#x5730;&#x7403;&#x6765;&#x8BB2;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x77ED;&#x6682;&#x5230;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x751A;&#x81F3;&#x5F53;&#x6211;&#x4EEC;&#x5C06;&#x89C6;&#x91CE;&#x653E;&#x5927;&#x5230;&#x6574;&#x4E2A;&#x5B87;&#x5B99;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x7A81;&#x7136;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x5904;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;&#x5B87;&#x5B99;&#x4E2D;&#x7684;&#x65F6;&#x5149;&#xFF0C;&#x66FE;&#x7ECF;&#x9A7B;&#x8DB3;&#x8FC7;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x5C0F;&#x57CE;&#x9547;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x65E2;&#x719F;&#x6089;&#x53C8;&#x964C;&#x751F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6709;&#x4EC0;&#x4E48;&#x7406;&#x7531;&#x4E0D;&#x53BB;&#x53D1;&#x73B0;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x5462;&#xFF1F;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6C38;&#x8FDC;&#x4FDD;&#x7559;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x662F;&#x5929;&#x624D;&#x7684;&#x57FA;&#x672C;&#x8981;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x76F8;&#x5BF9;&#x6574;&#x4E2A;&#x5B87;&#x5B99;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x663E;&#x5F97;&#x72ED;&#x9698;&#x800C;&#x65E0;&#x77E5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6709;&#x4EC0;&#x4E48;&#x7406;&#x7531;&#x4E0D;&#x53BB;&#x63A2;&#x7D22;&#x8FD9;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x4E16;&#x754C;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x5904;&#x7684;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x548C;&#x7B2C;&#x4E09;&#x65B9;SDK&#xFF0C;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x524D;&#x4EBA;&#x6240;&#x4E0D;&#x80FD;&#x60F3;&#x8C61;&#x7684;&#x4E30;&#x5BCC;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x65E0;&#x7591;&#x6211;&#x4EEC;&#x662F;&#x5E78;&#x798F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x518D;&#x52AA;&#x529B;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E00;&#x4F4D;&#x540C;&#x4E8B;&#x7ED9;&#x6211;&#x63A8;&#x8350;&#x4E86;&#x300A;&#x6A21;&#x4EFF;&#x6E38;&#x620F;&#x300B;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#xFF0C;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x6211;&#x5BF9;&#x56FE;&#x7075;&#x8FD9;&#x4E2A;&#x4EBA;&#x7269;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x65E0;&#x5916;&#x4E4E;&#x4ED6;&#x5BF9;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x884C;&#x4E1A;&#x505A;&#x51FA;&#x7684;&#x9769;&#x547D;&#x6027;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x50CF;&#x8C1C;&#x4E00;&#x6837;&#x7684;&#x4EBA;&#x751F;&#x7ECF;&#x5386;&#xFF0C;&#x53EF;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x5929;&#x624D;&#x822C;&#x7684;&#x75AF;&#x72C2;&#x548C;&#x6267;&#x8457;&#xFF0C;&#x56FE;&#x7075;&#x5728;&#x88AB;&#x901A;&#x77E5;&#x53BB;&#x63A5;&#x53D7;&#x7834;&#x89E3;&#x5FB7;&#x56FD;&#x52A0;&#x5BC6;&#x88C5;&#x7F6E;&#x201C;&#x6069;&#x5C3C;&#x683C;&#x739B;&#x201D;&#x7684;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x519B;&#x65B9;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9762;&#x8BD5;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x56FE;&#x7075;&#x6216;&#x8BB8;&#x4E0D;&#x61C2;&#x5F97;&#x4EC0;&#x4E48;&#x662F;&#x5E7D;&#x9ED8;&#xFF0C;&#x8FD9;&#x79CD;&#x88AB;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x4E66;&#x5446;&#x5B50;&#x201D;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x751F;&#x6D3B;&#x4E2D;&#x662F;&#x4E0D;&#x8BA8;&#x559C;&#x7684;&#xFF0C;&#x5728;&#x300A;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x300B;&#x4E2D;&#x4F5C;&#x8005;&#x660E;&#x786E;&#x5730;&#x6307;&#x51FA;&#xFF0C;&#x201C;&#x4E66;&#x5446;&#x5B50;&#x201D;&#x4E0D;&#x53D7;&#x6B22;&#x8FCE;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6BD4;&#x666E;&#x901A;&#x4EBA;&#x806A;&#x660E;&#xFF0C;&#x53EF;&#x662F;&#x56FE;&#x7075;&#x5F88;&#x5FEB;&#x5C31;&#x80FD;&#x53D1;&#x73B0;&#xFF0C;&#x56E2;&#x961F;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x4EBA;&#x662F;&#x4E0D;&#x5408;&#x683C;&#x7684;&#x89E3;&#x5BC6;&#x8005;&#xFF0C;&#x800C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4ED6;&#x56E0;&#x4E3A;&#x4E0D;&#x592A;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x548C;&#x522B;&#x4EBA;&#x76F8;&#x5904;&#xFF0C;&#x800C;&#x88AB;&#x56E2;&#x961F;&#x91CC;&#x7684;&#x6210;&#x5458;&#x6307;&#x8D23;&#x548C;&#x8C29;&#x9A82;&#xFF0C;&#x53EF;&#x4ED6;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x653E;&#x5F03;&#x8FC7;&#x5236;&#x9020;&#x4ED6;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x800C;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x786E;&#x662F;&#x4F9D;&#x9760;&#x4ED6;&#x7684;&#x673A;&#x5668;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x5929;&#x624D;&#x7684;&#x5B64;&#x72EC;&#x5728;&#x4E8E;&#x5E38;&#x5E38;&#x4E0D;&#x88AB;&#x5E38;&#x4EBA;&#x7406;&#x89E3;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x56FE;&#x7075;&#x88AB;&#x5F3A;&#x8FEB;&#x5173;&#x95ED;&#x4ED6;&#x7684;&#x673A;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x6210;&#x5458;&#x613F;&#x610F;&#x7AD9;&#x5728;&#x8FD9;&#x4E00;&#x8FB9;&#xFF0C;&#x8FD9;&#x4E00;&#x5E55;&#x662F;&#x8BA9;&#x6211;&#x611F;&#x53D7;&#x5230;&#x6E29;&#x60C5;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x8D70;&#x8FDB;&#x4ED6;&#x751F;&#x547D;&#x4E2D;&#x7684;&#x5973;&#x5B69;&#x5B50;&#xFF1A;&#x743C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x666E;&#x901A;&#x4EBA;&#x7A77;&#x5C3D;&#x4E00;&#x751F;&#x90FD;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x5929;&#x624D;&#x7684;&#x4E07;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x4EBA;&#x60F3;&#x8981;&#x544A;&#x8BEB;&#x6211;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E0A;&#x6295;&#x5165;&#x5927;&#x91CF;&#x7684;&#x70ED;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x90FD;&#x671F;&#x671B;&#x83B7;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x53EF;&#x73B0;&#x5B9E;&#x96BE;&#x514D;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x65E0;&#x60C5;&#x5730;&#x4E3A;&#x6211;&#x4EEC;&#x6D47;&#x4E0B;&#x4E00;&#x76C6;&#x51C9;&#x6C34;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x5973;&#x5B69;&#x5B50;&#x6295;&#x5165;&#x4E86;&#x5927;&#x91CF;&#x611F;&#x60C5;&#xFF0C;&#x7ED3;&#x679C;&#x6700;&#x540E;&#x88AB;&#x5979;&#x4F24;&#x5FC3;&#x5230;&#x5FC3;&#x7070;&#x610F;&#x51B7;&#x2026;&#x2026;&#x53EF;&#x662F;&#x4EBA;&#x751F;&#x5176;&#x5B9E;&#x672C;&#x6765;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x4F60;&#x4ECE;&#x51FA;&#x751F;&#x5230;&#x8D70;&#x5411;&#x6B7B;&#x4EA1;&#x65E9;&#x5DF2;&#x5B89;&#x6392;&#x597D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x201C;&#x91CD;&#x5199;&#x201D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x60F3;&#x8981;&#x8BA4;&#x8BC6;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x4EBA;&#x3001;&#x7ECF;&#x5386;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x6210;&#x4E0E;&#x8D25;&#x3001;&#x4E00;&#x4EF6;&#x4E1C;&#x897F;&#x5F97;&#x4E0E;&#x5931;&#xFF0C;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x5766;&#x7136;&#x5904;&#x4E4B;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x5C31;&#x4E0D;&#x4F1A;&#x518D;&#x754F;&#x60E7;&#x5931;&#x8D25;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x613F;&#x610F;&#x4E3A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x6295;&#x5165;&#x70ED;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x61D2;&#x60F0;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x501F;&#x53E3;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x76F8;&#x4FE1;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x6700;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x4E00;&#x79CD;&#x6562;&#x4E8E;&#x7A81;&#x7834;&#x81EA;&#x6211;&#x7684;&#x6FC0;&#x60C5;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x6CE8;&#x5B9A;&#x53EA;&#x80FD;&#x505A;&#x51FA;&#x5E73;&#x5EB8;&#x800C;&#x666E;&#x901A;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x6BD4;&#x522B;&#x4EBA;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x52AA;&#x529B;&#x548C;&#x522B;&#x4EBA;&#x505A;&#x5F97;&#x4E0D;&#x540C;;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x548C;&#x522B;&#x4EBA;&#x505A;&#x5F97;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x52AA;&#x529B;&#x6BD4;&#x522B;&#x4EBA;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x5373;&#x4F7F;&#x666E;&#x901A;&#x5982;&#x4F60;&#x6211;&#x4E00;&#x822C;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x50CF;&#x5929;&#x624D;&#x4E00;&#x6837;&#x75AF;&#x72C2;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x300A;&#x6A21;&#x4EFF;&#x6E38;&#x620F;&#x300B;&#x91CC;&#xFF0C;&#x827E;&#x4F26;&#x7684;&#x201C;&#x521D;&#x604B;&#x201D;&#x514B;&#x91CC;&#x65AF;&#x6258;&#x5F17;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6B63;&#x662F;&#x4EBA;&#x4EEC;&#x4EE5;&#x4E3A;&#x7684;&#x65E0;&#x7528;&#x4E4B;&#x4EBA;&#xFF0C;&#x6210;&#x5C31;&#x4E86;&#x65E0;&#x4EBA;&#x611F;&#x60F3;&#x4E4B;&#x4E8B;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5728;&#x529D;&#x8BF4;&#x743C;&#x53C2;&#x4E0E;&#x5230;&#x89E3;&#x5BC6;&#x5DE5;&#x4F5C;&#x4E2D;&#x65F6;&#xFF0C;&#x4ED6;&#x540C;&#x6837;&#x5BF9;&#x743C;&#x8BF4;&#x51FA;&#x4E86;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x743C;&#x56E0;&#x4E3A;&#x8FDF;&#x5230;&#x800C;&#x65E0;&#x6CD5;&#x53C2;&#x52A0;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x5979;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x6F2B;&#x4E0D;&#x7ECF;&#x5FC3;&#x7684;&#x8BDD;&#x201C;&#x4F60;&#x51ED;&#x4EC0;&#x4E48;&#x8BA4;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x4E0D;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5462;&#x201D;&#xFF0C;&#x8BA9;&#x56FE;&#x7075;&#x60F3;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x7834;&#x4F8B;&#x8BA9;&#x8FDF;&#x5230;&#x7684;&#x743C;&#x53C2;&#x52A0;&#x6D4B;&#x8BD5;&#xFF0C;&#x867D;&#x7136;&#x56FE;&#x7075;&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x6027;&#x604B;&#xFF0C;&#x53EF;&#x4ED6;&#x548C;&#x743C;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x611F;&#x60C5;&#x4F9D;&#x7136;&#x8BA9;&#x4EBA;&#x52A8;&#x5BB9;&#xFF0C;&#x5373;&#x4F7F;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x4E0D;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x5F7C;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x6309;&#x7167;&#x5404;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#x751F;&#x6D3B;&#xFF0C;&#x53EF;&#x4ED6;&#x4EEC;&#x540C;&#x6837;&#x80FD;&#x6309;&#x7167;&#x5404;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x7231;&#x5BF9;&#x65B9;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x5F62;&#x4E0B;&#xFF0C;&#x4E16;&#x4FD7;&#x4E2D;&#x7406;&#x89E3;&#x7684;&#x7231;&#x662F;&#x5426;&#x4F1A;&#x663E;&#x5F97;&#x5E73;&#x6DE1;&#x65E0;&#x5947;&#xFF1F;&#x56FE;&#x7075;&#x7684;&#x6B7B;&#x4EA1;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#x662F;&#x4E00;&#x4E2A;&#x56FD;&#x5BB6;&#x751A;&#x81F3;&#x6574;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x5DE8;&#x5927;&#x635F;&#x5931;&#xFF0C;&#x4ECE;&#x4F3D;&#x5229;&#x7565;&#x3001;&#x5E03;&#x9C81;&#x8BFA;&#x518D;&#x5230;&#x56FE;&#x7075;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x4EBA;&#x7C7B;&#x81EA;&#x4EE5;&#x4E3A;&#x662F;&#x5730;&#x521B;&#x9020;&#x4E86;&#x5404;&#x79CD;&#x201C;&#x6559;&#x6761;&#x201D;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x6765;&#x4F24;&#x5BB3;&#x8FD9;&#x4E9B;&#x672C;&#x5E94;&#x8BE5;&#x5728;&#x5386;&#x53F2;&#x4E2D;&#x7EFD;&#x653E;&#x5F02;&#x5F69;&#x7684;&#x5929;&#x624D;&#x4EEC;&#xFF0C;&#x56FE;&#x7075;&#x63D0;&#x51FA;&#x7684;&#x201C;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#x201D;&#x662F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x6700;&#x9AD8;&#x7684;&#x5956;&#x9879;&#x4EE5;&#x4ED6;&#x7684;&#x540D;&#x5B57;&#x5B9A;&#x4E49;&#xFF0C;&#x751A;&#x81F3;&#x82F1;&#x56FD;&#x5973;&#x738B;&#x90FD;&#x66FE;&#x7ECF;&#x516C;&#x5F00;&#x4E3A;&#x5176;&#x6062;&#x590D;&#x540D;&#x8A89;&#xFF0C;&#x6240;&#x4EE5;&#x540C;&#x6837;&#x90FD;&#x662F;&#x6D3B;&#x7740;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x9009;&#x62E9;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x4F60;&#x6211;&#x7684;&#x52AA;&#x529B;&#x4E0D;&#x4F1A;&#x4E3A;&#x4EBA;&#x4EEC;&#x6240;&#x6B4C;&#x9882;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x6211;&#x7684;&#x575A;&#x6301;&#x4E0D;&#x4F1A;&#x4E3A;&#x4EBA;&#x4EEC;&#x6240;&#x7406;&#x89E3;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7559;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x5370;&#x8BB0;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x4EEC;&#x6765;&#x8FD9;&#x91CC;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x4F60;&#x8981;&#x76F8;&#x4FE1;&#xFF0C;&#x4F60;&#x5B66;&#x8FC7;&#x7684;&#x6BCF;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x906D;&#x53D7;&#x8FC7;&#x7684;&#x6BCF;&#x4E00;&#x6B21;&#x82E6;&#x96BE;&#xFF0C;&#x90FD;&#x4F1A;&#x5728;&#x4F60;&#x4E00;&#x751F;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x3002;&#x5176;&#x5B9E;&#x4F60;&#x6211;&#x7684;&#x751F;&#x547D;&#x90FD;&#x5F88;&#x77ED;&#x6682;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x503C;&#x5F97;&#x53BB;&#x6D6A;&#x8D39;&#x3002;&#x50CF;&#x8BD7;&#x4EBA;&#x4E00;&#x6837;&#x777F;&#x667A;&#xFF0C;&#x53BB;&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#xFF1B;&#x50CF;&#x5929;&#x624D;&#x4E00;&#x6837;&#x75AF;&#x72C2;&#xFF0C;&#x53BB;&#x638C;&#x63A7;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/4205536912/">当黑客遇见画家</a></li><li><a href="https://blog.yuanpei.me/posts/3653716295/">像诗人一样睿智，像天才一样疯狂</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/3653716295/" rel="external">像诗人一样睿智，像天才一样疯狂</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/3653716295/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/3653716295/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/画家/">画家</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/诗人/">诗人</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/黑客/">黑客</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3653716295/&title=《像诗人一样睿智，像天才一样疯狂》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3653716295/&title=《像诗人一样睿智，像天才一样疯狂》 — PayneQinのBlog&source=&emsp;&emsp;我不知道大家如何定义程序员这个工作，在我看来，在某种意义上，程序员和艺术家们具有相同之处，我们都是创作者，和诗人、画家、作家等等这..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3653716295/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《像诗人一样睿智，像天才一样疯狂》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3653716295/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3653716295/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/4205536912/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">当黑客遇见画家</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/2275646954/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">你了解爱的艺术吗？</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/3653716295/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3653716295/&title=《像诗人一样睿智，像天才一样疯狂》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3653716295/&title=《像诗人一样睿智，像天才一样疯狂》 — PayneQinのBlog&source=&emsp;&emsp;我不知道大家如何定义程序员这个工作，在我看来，在某种意义上，程序员和艺术家们具有相同之处，我们都是创作者，和诗人、画家、作家等等这..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3653716295/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《像诗人一样睿智，像天才一样疯狂》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3653716295/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3653716295/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/3653716295/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
