<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        致前任：愿余生各自安好 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x4E5F;&amp;#x8BB8;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x5E74;&amp;#x7EAA;&amp;#x5927;&amp;#x4E86;&amp;#x7684;&amp;#x7F18;&amp;#x6545;&amp;#xFF0C;&amp;#x6E10;&amp;#x6E10;&amp;#x5730;&amp;#x5982;&amp;#x540C;&amp;#x4E0A;&amp;#x763E;&amp;#x4E00;&amp;#x822C;&amp;#x559C;&amp;#x6B22;&amp;#x4E0A;">
<meta name="keywords" content="电影,前任,公众号">
<meta property="og:type" content="article">
<meta property="og:title" content="致前任：愿余生各自安好">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1358971951/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x4E5F;&amp;#x8BB8;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x5E74;&amp;#x7EAA;&amp;#x5927;&amp;#x4E86;&amp;#x7684;&amp;#x7F18;&amp;#x6545;&amp;#xFF0C;&amp;#x6E10;&amp;#x6E10;&amp;#x5730;&amp;#x5982;&amp;#x540C;&amp;#x4E0A;&amp;#x763E;&amp;#x4E00;&amp;#x822C;&amp;#x559C;&amp;#x6B22;&amp;#x4E0A;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="致前任：愿余生各自安好">
<meta name="twitter:description" content="&amp;#x4E5F;&amp;#x8BB8;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x5E74;&amp;#x7EAA;&amp;#x5927;&amp;#x4E86;&amp;#x7684;&amp;#x7F18;&amp;#x6545;&amp;#xFF0C;&amp;#x6E10;&amp;#x6E10;&amp;#x5730;&amp;#x5982;&amp;#x540C;&amp;#x4E0A;&amp;#x763E;&amp;#x4E00;&amp;#x822C;&amp;#x559C;&amp;#x6B22;&amp;#x4E0A;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">致前任：愿余生各自安好</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">致前任：愿余生各自安好</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-01-12T00:39:39.000Z" itemprop="datePublished" class="page-time">
  2018-01-12
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-致前任：愿余生各自安好" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">致前任：愿余生各自安好</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-01-12 00:39:39" datetime="2018-01-12T00:39:39.000Z" itemprop="datePublished">2018-01-12</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        12 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x5E74;&#x7EAA;&#x5927;&#x4E86;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x6E10;&#x6E10;&#x5730;&#x5982;&#x540C;&#x4E0A;&#x763E;&#x4E00;&#x822C;&#x559C;&#x6B22;&#x4E0A;&#x6000;&#x65E7;&#xFF0C;&#x559C;&#x6B22;&#x6000;&#x65E7;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x5462;&#xFF1F;&#x60F3;&#x7740;&#x518D;&#x6B21;&#x91CD;&#x6E29;&#x4E0B;&#x5C0F;&#x9A6C;&#x54E5;&#x7684;&#x82F1;&#x96C4;&#x672C;&#x8272;&#xFF0C;&#x60F3;&#x7740;&#x518D;&#x6B21;&#x611F;&#x53D7;&#x4E0B;&#x661F;&#x7403;&#x5927;&#x6218;&#x91CC;&#x7684;&#x5200;&#x5149;&#x5251;&#x5F71;&#x2026;&#x2026;&#x53EF;&#x662F;&#x6BCF;&#x6B21;&#x90FD;&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x56E0;&#x800C;&#x843D;&#x7A7A;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x53BB;&#x770B;&#x300A;&#x82F1;&#x96C4;&#x672C;&#x8272;&#x300B;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x9644;&#x8FD1;&#x7684;&#x7535;&#x5F71;&#x9662;&#x90FD;&#x6CA1;&#x6709;&#x6392;&#x7247;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E00;&#x6B21;&#x5462;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x90E8;&#x548C;&#x524D;&#x4EFB;&#x6709;&#x5173;&#x7684;&#x7535;&#x5F71;&#x300A;&#x524D;&#x4EFB;&#x653B;&#x7565;3&#xFF1A;&#x518D;&#x89C1;&#x524D;&#x4EFB;&#x300B;&#x3002;</p>
<p>&#x6216;&#x8BB8;&#x524D;&#x4EFB;&#x4E0E;&#x73B0;&#x4EFB;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x4E00;&#x9053;&#x65E0;&#x89E3;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x7F51;&#x4E0A;&#x6D41;&#x4F20;&#x7740;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x201C;&#x6211;&#x548C;&#x4F60;&#x5988;&#x540C;&#x65F6;&#x6389;&#x6C34;&#x91CC;&#x4F60;&#x4F1A;&#x5148;&#x6551;&#x54EA;&#x4E00;&#x4E2A;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x800C;&#x8A00;&#xFF0C;&#x5373;&#x4F7F;&#x4EE3;&#x5165;&#x73B0;&#x4EFB;&#x548C;&#x524D;&#x4EFB;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x5B9A;&#xFF0C;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x4F9D;&#x7136;&#x662F;&#x8BF4;&#x5F97;&#x901A;&#x7684;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x5FC3;&#x91CC;&#x662F;&#x5982;&#x4F55;&#x5BF9;&#x5F85;&#x73B0;&#x4EFB;&#x548C;&#x524D;&#x4EFB;&#x7684;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x6F5C;&#x610F;&#x8BC6;&#x91CC;&#xFF0C;&#x524D;&#x4EFB;&#x4EE3;&#x8868;&#x4E86;&#x90A3;&#x4E2A;&#x4F60;&#x66FE;&#x7ECF;&#x8BA4;&#x5B9A;&#x8981;&#x4E00;&#x76F4;&#x8D70;&#x4E0B;&#x53BB;&#x7684;&#x4EBA;&#x3002;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x7528;&#x5929;&#x771F;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x597D;&#xFF0C;&#x53D1;&#x81EA;&#x5185;&#x5FC3;&#x5730;&#x53BB;&#x7231;&#xFF0C;&#x6700;&#x7EC8;&#x5374;&#x7528;&#x5C3D;&#x5168;&#x529B;&#x53BB;&#x9057;&#x5FD8;&#x91CA;&#x6000;&#x3002;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x6240;&#x8BB2;&#x8FF0;&#x7684;&#x6070;&#x597D;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5199;&#x5B9E;&#x7684;&#x573A;&#x666F;&#x3002;&#x6700;&#x8FD1;&#x770B;&#x5230;&#x4E00;&#x6BB5;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x7528;&#x524D;&#x4EFB;&#x7684;&#x9519;&#x8BEF;&#x60E9;&#x7F5A;&#x4E0B;&#x4E00;&#x4EFB;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x7528;&#x5BF9;&#x524D;&#x4EFB;&#x7684;&#x4E8F;&#x6B20;&#x5F25;&#x8865;&#x4E0B;&#x4E00;&#x4EFB;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x505A;&#x6CD5;&#x5747;&#x65E0;&#x53EF;&#x539A;&#x975E;&#xFF0C;&#x751A;&#x81F3;&#x542C;&#x8D77;&#x6765;&#x7B2C;&#x4E8C;&#x79CD;&#x505A;&#x6CD5;&#x66F4;&#x597D;&#xFF0C;&#x53EF;&#x5982;&#x679C;&#x626A;&#x5FC3;&#x81EA;&#x95EE;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x7231;&#x524D;&#x4EFB;&#x591A;&#x4E9B;&#xFF0C;&#x8FD8;&#x662F;&#x7231;&#x73B0;&#x4EFB;&#x591A;&#x4E9B;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7535;&#x5F71;&#x91CC;&#x7684;&#x4E24;&#x5BF9;&#x60C5;&#x4FA3;&#xFF0C;&#x5B5F;&#x4E91;&#x548C;&#x6797;&#x4F73;&#xFF0C;&#x4F59;&#x98DE;&#x548C;&#x4E01;&#x70B9;&#xFF0C;&#x540C;&#x65F6;&#x56E0;&#x4E3A;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x77DB;&#x76FE;&#x5206;&#x624B;&#xFF0C;&#x597D;&#x5144;&#x5F1F;&#x548C;&#x597D;&#x95FA;&#x871C;&#x518D;&#x5EA6;&#x8D70;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x5931;&#x604B;&#x5E94;&#x8BE5;&#x662F;&#x75DB;&#x82E6;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6CA1;&#x6709;&#x559D;&#x9189;&#x5230;&#x4E0D;&#x7701;&#x4EBA;&#x4E8B;&#xFF0C;&#x6CA1;&#x6709;&#x60B2;&#x4F24;&#x5230;&#x6B47;&#x65AF;&#x5E95;&#x91CC;&#xFF0C;&#x8FD9;&#x90FD;&#x4E0D;&#x7B97;&#x505A;&#x5931;&#x604B;&#x5427;&#x3002;</p>
<p>&#x53EF;&#x6216;&#x8BB8;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x591A;&#x4E86;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E24;&#x4E2A;&#x4EBA;&#x5206;&#x5F00;&#x4EE5;&#x540E;&#xFF0C;&#x96BE;&#x8FC7;&#x7684;&#x53EA;&#x6709;&#x81EA;&#x5DF1;&#xFF0C;&#x5BF9;&#x5BF9;&#x65B9;&#x800C;&#x8A00;&#x6216;&#x8BB8;&#x662F;&#x79CD;&#x89E3;&#x8131;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x7535;&#x5F71;&#x91CC;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x5E55;&#x5E55;&#x5355;&#x8EAB;&#x7537;&#x5973;&#x55E8;&#x7FFB;&#x5929;&#x7684;&#x666F;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x542C;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x4E0D;&#x5408;&#x9002;&#x5C31;&#x5206;&#x624B;&#x5457;&#xFF0C;&#x8BBD;&#x523A;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8FB9;&#x6E34;&#x671B;&#x7740;&#x7F8E;&#x597D;&#x7684;&#x7231;&#x60C5;&#xFF0C;&#x4E00;&#x8FB9;&#x5BF9;&#x5F85;&#x611F;&#x60C5;&#x5F03;&#x82E5;&#x655D;&#x5C65;&#xFF0C;&#x6211;&#x4EEC;&#x8C08;&#x604B;&#x7231;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x6765;&#x8D8A;&#x77ED;&#xFF0C;&#x5BF9;&#x5F7C;&#x6B64;&#x8D8A;&#x6765;&#x8D8A;&#x6CA1;&#x6709;&#x8010;&#x5FC3;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x957F;&#x5927;&#x4E86;&#xFF0C;&#x77E5;&#x9053;20&#x591A;&#x5C81;&#x7684;&#x5E74;&#x9F84;&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x50CF;10&#x591A;&#x5C81;&#x4E00;&#x6837;&#x6325;&#x970D;&#xFF0C;&#x50CF;&#x5B5F;&#x4E91;&#x548C;&#x6797;&#x4F73;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x4FA3;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#x4E3E;&#x4E0D;&#x80DC;&#x4E3E;&#xFF0C;&#x4E3A;&#x4E86;&#x5F7C;&#x6B64;&#x4E00;&#x70B9;&#x53EF;&#x601C;&#x7684;&#x81EA;&#x5C0A;&#xFF0C;&#x8C01;&#x90FD;&#x4E0D;&#x80AF;&#x5148;&#x653E;&#x4E0B;&#x8EAB;&#x6BB5;&#x540C;&#x5BF9;&#x65B9;&#x548C;&#x89E3;&#xFF0C;&#x7B49;&#x5230;&#x77DB;&#x76FE;&#x79EF;&#x7D2F;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#xFF0C;&#x538B;&#x6B7B;&#x9A86;&#x9A7C;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6839;&#x7A3B;&#x8349;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x8981;&#x8BD5;&#x56FE;&#x7528;&#x626E;&#x6F14;&#x81F3;&#x5C0A;&#x5B9D;&#x8BF4;&#x201C;&#x6211;&#x7231;&#x4F60;&#x201D;&#x548C;&#x75AF;&#x72C2;&#x5403;&#x8292;&#x679C;&#x5403;&#x5230;&#x8FC7;&#x654F;&#xFF0C;&#x8FD9;&#x6837;&#x5E7C;&#x7A1A;&#x53EF;&#x7B11;&#x7684;&#x4E8B;&#x60C5;&#x6765;&#x6EE1;&#x8DB3;&#x5404;&#x81EA;&#x7684;&#x865A;&#x8363;&#x5FC3;&#xFF0C;&#x597D;&#x50CF;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x5BF9;&#x5F7C;&#x6B64;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x771F;&#x6B63;&#x7231;&#x4F60;&#x7684;&#x4EBA;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x820D;&#x5F97;&#x79BB;&#x5F00;&#x4F60;&#x5462;&#xFF0C;&#x660E;&#x660E;&#x662F;&#x81EA;&#x79C1;&#x5F97;&#x53EA;&#x61C2;&#x5F97;&#x7231;&#x81EA;&#x5DF1;&#xFF0C;&#x975E;&#x8981;&#x575A;&#x6301;&#x8BF4;&#x662F;&#x5BF9;&#x65B9;&#x4E0D;&#x591F;&#x7231;&#x81EA;&#x5DF1;&#xFF0C;&#x771F;&#x6B63;&#x7231;&#x4F60;&#x7684;&#x4EBA;&#xFF0C;&#x7231;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x5FC3;&#x91CC;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x662F;&#x5982;&#x4F55;&#x8BA9;&#x5927;&#x5BB6;&#x4EA7;&#x751F;&#x5171;&#x9E23;&#xFF0C;&#x5728;&#x89C2;&#x5F71;&#x7684;&#x65F6;&#x5019;&#x54ED;&#x5F97;&#x7A00;&#x91CC;&#x54D7;&#x5566;&#x7684;&#xFF0C;&#x7535;&#x5F71;&#x4E2D;&#x4E24;&#x4F4D;&#x7537;&#x4E3B;&#x5728;&#x201C;&#x9694;&#x58C1;&#x8001;&#x738B;&#x201D;&#xFF0C;&#x8BA8;&#x8BBA;&#x662F;&#x751F;&#x7537;&#x5B69;&#x597D;&#x8FD8;&#x662F;&#x751F;&#x5973;&#x5B69;&#x597D;&#xFF0C;&#x8BA8;&#x8BBA;&#x548C;&#x53CC;&#x80DE;&#x80CE;&#x59D0;&#x59B9;&#x7EA6;&#x4F1A;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x548C;&#x4E00;&#x4F17;&#x957F;&#x7740;&#x7F51;&#x7EA2;&#x8138;&#x7684;95&#x540E;&#x5728;Party&#x4E0A;&#x72C2;&#x55E8;&#x2026;&#x2026;&#x5404;&#x79CD;&#x6BB5;&#x5B50;&#x8BA9;&#x5206;&#x624B;&#x53D8;&#x6210;&#x4E00;&#x573A;&#x72C2;&#x6B22;&#xFF0C;&#x800C;&#x72C2;&#x6B22;&#x4E0B;&#x7684;&#x4E24;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x6709;&#x4F59;&#x98DE;&#x548C;&#x4E01;&#x70B9;&#x8FD9;&#x79CD;&#x201C;&#x4EE5;&#x5206;&#x624B;&#x7684;&#x540D;&#x4E49;&#xFF0C;&#x6492;&#x7740;&#x601D;&#x5FF5;&#x7684;&#x5A07;&#x201D;&#x7684;&#xFF0C;&#x6709;&#x5B5F;&#x4E91;&#x548C;&#x6797;&#x4F73;&#x8FD9;&#x79CD;&#x56E0;&#x4E3A;&#x6C9F;&#x901A;&#x4E0D;&#x5584;&#x800C;&#x6E10;&#x884C;&#x6E10;&#x8FDC;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x542C;&#x5230;&#x4E00;&#x4E2A;&#x8BCD;&#x53EB;&#x505A;&#x5408;&#x9002;&#xFF0C;&#x5176;&#x5B9E;&#x4EE5;&#x4EBA;&#x7C7B;&#x8FD9;&#x79CD;&#x5947;&#x8469;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x4F1A;&#x627E;&#x5230;&#x5B8C;&#x5168;&#x5408;&#x9002;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#x5462;&#xFF1F;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x9700;&#x8981;&#x53BB;&#x4E0D;&#x65AD;&#x78E8;&#x5408;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5F85;&#x611F;&#x60C5;&#x7684;&#x89D2;&#x5EA6;&#x662F;&#x529F;&#x5229;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4EBA;&#x8D70;&#x5230;&#x4E00;&#x8D77;&#x751A;&#x81F3;&#x7ED3;&#x5A5A;&#xFF0C;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x8FD9;&#x5C31;&#x662F;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x50CF;&#x5B5F;&#x4E91;&#x548C;&#x6797;&#x4F73;&#x8FD9;&#x79CD;&#x76F8;&#x7231;&#x4E94;&#x5E74;&#x7684;&#x60C5;&#x4FA3;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x7528;&#x4E00;&#x53E5;&#x5408;&#x9002;&#x6216;&#x8005;&#x4E0D;&#x5408;&#x9002;&#x6765;&#x8BF4;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x4E00;&#x5B9A;&#x8981;&#x591A;&#x6C9F;&#x901A;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x4E0D;&#x8981;&#x60F3;&#x7740;&#x7B2C;&#x4E8C;&#x5929;&#x518D;&#x89E3;&#x51B3;&#x3002;&#x5728;&#x611F;&#x60C5;&#x4E2D;&#x4E0D;&#x8981;&#x7528;&#x201C;&#x4F5C;&#x201D;&#x8FD9;&#x79CD;&#x624B;&#x6BB5;&#x53BB;&#x6D4B;&#x8BD5;&#x5BF9;&#x65B9;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x613F;&#x610F;&#x5FCD;&#x8BA9;&#x4F60;&#xFF0C;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x4F60;&#x53EF;&#x4EE5;&#x6BEB;&#x65E0;&#x5E95;&#x7EBF;&#x3002;&#x4E5F;&#x8BB8;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x559C;&#x6B22;&#x628A;&#x8BDD;&#x57CB;&#x5728;&#x5FC3;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x89C9;&#x5F97;&#x8C01;&#x5148;&#x4E3B;&#x52A8;&#x8C01;&#x5C31;&#x8F93;&#x5566;&#xFF0C;&#x5373;&#x4F7F;&#x6B64;&#x523B;&#x8D62;&#x5F97;&#x4E86;&#x9762;&#x5B50;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4F1A;&#x8F93;&#x6389;&#x4E86;&#x91CC;&#x5B50;&#x3002;</p>
<p>&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x53EF;&#x8C13;&#x662F;&#x4E3A;&#x201C;&#x524D;&#x4EFB;&#x7CFB;&#x5217;&#x201D;&#x753B;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x7ED3;&#x5C40;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x6837;&#x4E00;&#x90E8;&#x540D;&#x4E0D;&#x89C1;&#x7ECF;&#x4F20;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x732B;&#x773C;&#x7535;&#x5F71;&#x4E0A;&#x83B7;&#x5F97;9.2&#x5206;&#x7684;&#x9AD8;&#x5206;&#xFF0C;&#x4E00;&#x5EA6;&#x8D85;&#x8D8A;&#x8FD1;&#x671F;&#x53E3;&#x7891;&#x6781;&#x4F73;&#x7684;&#x300A;&#x82B3;&#x534E;&#x300B;&#xFF0C;&#x8FD9;&#x79CD;&#x524D;&#x534A;&#x6BB5;&#x8D70;&#x80BE;&#x540E;&#x534A;&#x6BB5;&#x8D70;&#x5FC3;&#x7684;&#x7F16;&#x6392;&#x65B9;&#x5F0F;&#xFF0C;&#x6210;&#x529F;&#x5730;&#x5C06;&#x89C2;&#x4F17;&#x7684;&#x60C5;&#x7EEA;&#x5E26;&#x5411;&#x9AD8;&#x6F6E;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#x5728;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x91CC;&#x627E;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x5B50;&#xFF0C;&#x53EF;&#x5728;&#x6211;&#x770B;&#x6765;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x52AA;&#x529B;&#x7ED9;&#x81EA;&#x5DF1;&#x52A0;&#x620F;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x4F1A;&#x5206;&#x5F00;&#x4E00;&#x5B9A;&#x662F;&#x6709;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x5E7B;&#x60F3;&#x7740;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x4F55;&#x60CA;&#x5929;&#x5730;&#x6CE3;&#x9B3C;&#x795E;&#x4E00;&#x822C;&#x8F70;&#x8F70;&#x70C8;&#x70C8;&#xFF0C;&#x53EF;&#x771F;&#x6B63;&#x7684;&#x79BB;&#x5F00;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x6084;&#x65E0;&#x58F0;&#x606F;&#x7684;&#x3002;&#x4E00;&#x573A;&#x4F53;&#x9762;&#x7684;&#x5206;&#x624B;&#xFF0C;&#x662F;&#x4E24;&#x4E2A;&#x5F7C;&#x6B64;&#x4F24;&#x75D5;&#x7D2F;&#x7D2F;&#x7684;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x9762;&#x5BF9;&#x8FD9;&#x6BB5;&#x611F;&#x60C5;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x77E5;&#x9053;&#x5176;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x73B0;&#x4E00;&#x5207;&#x518D;&#x65E0;&#x6CD5;&#x56DE;&#x5230;&#x4EE5;&#x524D;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x6210;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x611F;&#x60C5;&#x65E9;&#x5DF2;&#x88AB;&#x5F53;&#x4F5C;&#x71C3;&#x6599;&#x7684;&#x6D88;&#x8017;&#x6B86;&#x5C3D;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#xFF1A;&#x6211;&#x4F9D;&#x7136;&#x7231;&#x4F60;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x518D;&#x559C;&#x6B22;&#x4F60;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x8D70;&#x5230;&#x8FD9;&#x91CC;&#x4E86;&#x3002;&#x4F53;&#x9762;&#x7684;&#x5206;&#x624B;&#xFF0C;&#x6216;&#x8BB8;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x5207;&#x5927;&#x5F7B;&#x5927;&#x609F;&#x4EE5;&#x540E;&#x7684;&#x6148;&#x60B2;&#xFF0C;&#x662F;&#x7528;&#x5C3D;&#x4E86;&#x529B;&#x6C14;&#x540E;&#x7684;&#x5E73;&#x9759;&#xFF0C;&#x662F;&#x867D;&#x7136;&#x7ED3;&#x5C40;&#x4E0D;&#x5982;&#x610F;&#xFF0C;&#x4F46;&#x6211;&#x6CA1;&#x6709;&#x540E;&#x6094;&#x9047;&#x89C1;&#x4F60;&#xFF0C;&#x662F;&#x63A5;&#x53D7;&#x6210;&#x957F;&#x5E26;&#x6765;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x662F;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x5730;&#x7231;&#x81EA;&#x5DF1;&#x3001;&#x7231;&#x522B;&#x4EBA;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x524D;&#x4EFB;&#x5C31;&#x50CF;&#x9ED1;&#x591C;&#x4E2D;&#x6447;&#x66F3;&#x7740;&#x7684;&#x70DB;&#x706B;&#xFF0C;&#x574D;&#x584C;&#x5728;&#x65E0;&#x8FB9;&#x7684;&#x591C;&#x8272;&#x4E2D;&#x3002;&#x6216;&#x8BB8;&#x4F1A;&#x6709;&#x65E0;&#x6570;&#x6839;&#x7684;&#x8721;&#x70DB;&#xFF0C;&#x80FD;&#x7167;&#x4EAE;&#x4F60;&#x7684;&#x9ED1;&#x6697;&#xFF0C;&#x4F46;&#x518D;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x80FD;&#x8FD9;&#x6837;&#x4E00;&#x5F80;&#x65E0;&#x524D;&#x5730;&#x5728;&#x9ED1;&#x6697;&#x4E2D;&#xFF0C;&#x4E3A;&#x4F60;&#x70EB;&#x51FA;&#x4E00;&#x4E2A;&#x6D1E;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6E29;&#x6696;&#x586B;&#x6EE1;&#x3002;&#x6210;&#x957F;&#x662F;&#x4EF6;&#x975E;&#x5E38;&#x75DB;&#x82E6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x4E00;&#x5B9A;&#x4F1A;&#x5931;&#x53BB;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x6CE8;&#x5B9A;&#x662F;&#x8BA9;&#x4F60;&#x6210;&#x957F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x597D;&#x597D;&#x518D;&#x89C1;&#xFF0C;&#x4E0D;&#x8D1F;&#x9047;&#x89C1;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x4F1A;&#x6C38;&#x8FDC;&#x505C;&#x7559;&#x5728;&#x4F60;&#x7684;&#x5FC3;&#x91CC;&#xFF0C;&#x4ED6;&#x4EEC;&#x66FE;&#x7ECF;&#x51FA;&#x73B0;&#xFF0C;&#x5E76;&#x6210;&#x4E3A;&#x4F60;&#x4EBA;&#x751F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7231;&#x4E0A;&#x4E0B;&#x4E00;&#x4E2A;&#xFF0C;&#x518D;&#x4E0B;&#x4E00;&#x4E2A;&#x3002;&#x653E;&#x8FC7;&#x524D;&#x4EFB;&#xFF0C;&#x653E;&#x8FC7;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x662F;&#x6700;&#x597D;&#x7684;&#x7ED3;&#x5C40;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2941880815/">米花之味：永远相信美好的事情</a></li><li><a href="https://qinyuanpei.github.io/posts/1684318907/">《大护法》—— 花生镇里的成人童话</a></li><li><a href="https://qinyuanpei.github.io/posts/2613006280/">一念执着，千山无阻</a></li><li><a href="https://zymin.cn/arcticle/100-children-movies.html">百部经典儿童电影推荐</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1358971951/" rel="external">致前任：愿余生各自安好</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1358971951/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1358971951/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/公众号/">公众号</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/前任/">前任</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/电影/">电影</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1358971951/&title=《致前任：愿余生各自安好》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1358971951/&title=《致前任：愿余生各自安好》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1358971951/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《致前任：愿余生各自安好》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1358971951/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1358971951/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1983298072/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">无问东西：你曾是少年</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/345410188/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">《C#多线程编程实战》读书笔记</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1358971951/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1358971951/&title=《致前任：愿余生各自安好》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1358971951/&title=《致前任：愿余生各自安好》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1358971951/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《致前任：愿余生各自安好》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1358971951/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1358971951/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1358971951/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
