<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        当黑客遇见画家 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;其实一直想读《黑客与画家》这本书，所以在我买了Kindle以后，这本书就成为我读完的第一本书。本书作者是美国互联网界举足轻重、有“创业教父”之称的哈佛大学计算机博士保罗·格雷厄姆 (Paul Graham )，而这本书是由他的思考整理而成的一本文集，虽然这本书的名字叫做《黑客与画家》，可实际上作者在这本书中观点，并非局限于黑客与画家本身，相反地它涉及编程、软件、创业、财富、">
<meta name="keywords" content="人文,黑客,程序员">
<meta property="og:type" content="article">
<meta property="og:title" content="当黑客遇见画家">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/4205536912/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;其实一直想读《黑客与画家》这本书，所以在我买了Kindle以后，这本书就成为我读完的第一本书。本书作者是美国互联网界举足轻重、有“创业教父”之称的哈佛大学计算机博士保罗·格雷厄姆 (Paul Graham )，而这本书是由他的思考整理而成的一本文集，虽然这本书的名字叫做《黑客与画家》，可实际上作者在这本书中观点，并非局限于黑客与画家本身，相反地它涉及编程、软件、创业、财富、">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="当黑客遇见画家">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;其实一直想读《黑客与画家》这本书，所以在我买了Kindle以后，这本书就成为我读完的第一本书。本书作者是美国互联网界举足轻重、有“创业教父”之称的哈佛大学计算机博士保罗·格雷厄姆 (Paul Graham )，而这本书是由他的思考整理而成的一本文集，虽然这本书的名字叫做《黑客与画家》，可实际上作者在这本书中观点，并非局限于黑客与画家本身，相反地它涉及编程、软件、创业、财富、">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">当黑客遇见画家</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">当黑客遇见画家</h1>
        <h5 class="subtitle">
            
                <time datetime="2016-10-09T18:38:03.000Z" itemprop="datePublished" class="page-time">
  2016-10-09
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-当黑客遇见画家" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">当黑客遇见画家</h1>
        <div class="post-meta">
            <time class="post-time" title="2016-10-09 18:38:03" datetime="2016-10-09T18:38:03.000Z" itemprop="datePublished">2016-10-09</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        17 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5176;&#x5B9E;&#x4E00;&#x76F4;&#x60F3;&#x8BFB;&#x300A;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6211;&#x4E70;&#x4E86;Kindle&#x4EE5;&#x540E;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5C31;&#x6210;&#x4E3A;&#x6211;&#x8BFB;&#x5B8C;&#x7684;&#x7B2C;&#x4E00;&#x672C;&#x4E66;&#x3002;&#x672C;&#x4E66;&#x4F5C;&#x8005;&#x662F;&#x7F8E;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x754C;&#x4E3E;&#x8DB3;&#x8F7B;&#x91CD;&#x3001;&#x6709;&#x201C;&#x521B;&#x4E1A;&#x6559;&#x7236;&#x201D;&#x4E4B;&#x79F0;&#x7684;&#x54C8;&#x4F5B;&#x5927;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x535A;&#x58EB;&#x4FDD;&#x7F57;&#xB7;&#x683C;&#x96F7;&#x5384;&#x59C6; (Paul Graham )&#xFF0C;&#x800C;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x7531;&#x4ED6;&#x7684;&#x601D;&#x8003;&#x6574;&#x7406;&#x800C;&#x6210;&#x7684;&#x4E00;&#x672C;&#x6587;&#x96C6;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x540D;&#x5B57;&#x53EB;&#x505A;&#x300A;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x300B;&#xFF0C;&#x53EF;&#x5B9E;&#x9645;&#x4E0A;&#x4F5C;&#x8005;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x89C2;&#x70B9;&#xFF0C;&#x5E76;&#x975E;&#x5C40;&#x9650;&#x4E8E;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x672C;&#x8EAB;&#xFF0C;&#x76F8;&#x53CD;&#x5730;&#x5B83;&#x6D89;&#x53CA;&#x7F16;&#x7A0B;&#x3001;&#x8F6F;&#x4EF6;&#x3001;&#x521B;&#x4E1A;&#x3001;&#x8D22;&#x5BCC;&#x3001;&#x8BBE;&#x8BA1;&#x3001;&#x7814;&#x7A76;&#x7B49;&#x7B49;&#x591A;&#x4E2A;&#x9886;&#x57DF;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x672C;&#x4E66;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x60F3;&#x4E0A;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x6C89;&#x8FF7;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x65E0;&#x6CD5;&#x81EA;&#x62D4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x5E94;&#x8BE5;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x539F;&#x672C;&#x662F;&#x7531;&#x7406;&#x6027;&#x548C;&#x611F;&#x6027;&#x4E24;&#x79CD;&#x8BA4;&#x8BC6;&#x6DF7;&#x5408;&#x800C;&#x6210;&#x7684;&#x3002;&#x5F53;&#x79D1;&#x6280;&#x4E0E;&#x4EBA;&#x6587;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x8FDB;&#x800C;&#x5171;&#x9E23;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x4E00;&#x5207;&#x662F;&#x5982;&#x6B64;&#x7684;&#x7F8E;&#x5999;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x5904;&#x7684;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x8FD9;&#x662F;&#x81EA;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x4EE5;&#x6765;&#xFF0C;&#x4EBA;&#x7C7B;&#x5386;&#x53F2;&#x4E0A;&#x53C8;&#x4E00;&#x4E2A;&#x9769;&#x547D;&#x6027;&#x7684;&#x65F6;&#x4EE3;&#x3002;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x8FF9;&#x8C61;&#x8868;&#x660E;&#xFF0C;&#x672A;&#x6765;&#x7684;&#x4EBA;&#x7C7B;&#x751F;&#x6D3B;&#x4E0D;&#x4EC5;&#x662F;&#x4EBA;&#x4E0E;&#x4EBA;&#x7684;&#x4E92;&#x52A8;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x591A;&#x7684;&#x5C06;&#x662F;&#x4EBA;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E92;&#x52A8;&#x3002;&#x6240;&#x4EE5;&#x60F3;&#x8981;&#x628A;&#x63E1;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x800C;&#x7406;&#x89E3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x5219;&#x662F;&#x8981;&#x7406;&#x89E3;&#x8BA1;&#x7B97;&#x673A;&#x80CC;&#x540E;&#x7684;&#x4EBA;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x4EE3;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x4E3B;&#x5BFC;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x800C;&#x4F1F;&#x5927;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x662F;&#x9ED1;&#x5BA2;&#x3002;</p>
<p>&#x2003;&#x2003;&#x666E;&#x901A;&#x4EBA;&#x8BA4;&#x4E3A;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x5C31;&#x662F;&#x5165;&#x4FB5;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x7F6A;&#x72AF;&#x201D;&#xFF0C;&#x5176;&#x5B9E;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x7684;&#x672C;&#x610F;&#x662F;&#x6307;&#x51FA;&#x4E8E;&#x5174;&#x8DA3;&#x800C;&#x89E3;&#x51B3;&#x67D0;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x6709;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x8FD9;&#x7C7B;&#x4EBA;(&#x51FA;&#x81EA;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x57FA;&#x91D1;&#x4F1A;&#x521B;&#x59CB;&#x4EBA;&#x7406;&#x67E5;&#x5FB7;&#xB7;&#x65AF;&#x6258;&#x5C14;&#x66FC;)&#xFF0C;&#x6240;&#x4EE5;&#x9ED1;&#x5BA2;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x6709;&#x7CBE;&#x795E;&#x8FFD;&#x6C42;&#x7684;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x7740;&#x6C42;&#x89E3;&#x95EE;&#x9898;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x7CBE;&#x795E;&#x6109;&#x60A6;&#x6216;&#x4EAB;&#x53D7;&#xFF0C;&#x9ED1;&#x5BA2;&#x4EEC;&#x53EA;&#x662F;&#x6BD4;&#x6211;&#x4EEC;&#x666E;&#x901A;&#x4EBA;&#x66F4;&#x5D07;&#x5C1A;&#x5206;&#x4EAB;&#x3001;&#x5F00;&#x653E;&#x548C;&#x6C11;&#x4E3B;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x4EFB;&#x4F55;&#x88AB;&#x7981;&#x6B62;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x6000;&#x6709;&#x7279;&#x522B;&#x5F3A;&#x70C8;&#x7684;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x4ED6;&#x4EEC;&#x559C;&#x6B22;&#x53BB;&#x601D;&#x8003;&#x90A3;&#x4E9B;&#x4F3C;&#x4E4E;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4EEC;&#x76F8;&#x4FE1;&#x8BA1;&#x7B97;&#x673A;&#x4F1A;&#x6DF1;&#x523B;&#x5730;&#x6539;&#x53D8;&#x4EBA;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x7531;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x8BC6;&#x5230;&#x201C;&#x9ED1;&#x5BA2;&#x4F26;&#x7406;&#x201D;&#x7684;&#x4E00;&#x4E2A;&#x63A8;&#x8BBA;&#xFF1A;&#x9ED1;&#x5BA2;&#x4E0D;&#x670D;&#x4ECE;&#x7BA1;&#x6559;&#xFF0C;&#x5177;&#x6709;&#x53DB;&#x9006;&#x7CBE;&#x795E;&#x3002;&#x9ED1;&#x5BA2;&#x5C31;&#x50CF;&#x4E00;&#x7FA4;&#x6709;&#x77E5;&#x8BC6;&#x7684;&#x6D77;&#x76D7;&#x3002;&#x7F16;&#x7A0B;&#x4E0E;&#x7ED8;&#x753B;&#x5F02;&#x66F2;&#x540C;&#x5DE5;&#xFF0C;&#x9ED1;&#x5BA2;&#x662F;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x7684;&#x827A;&#x672F;&#x5BB6;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x521B;&#x4F5C;&#x8005;&#xFF0C;&#x90FD;&#x8BD5;&#x56FE;&#x521B;&#x9020;&#x51FA;&#x4F18;&#x79C0;&#x7684;&#x4F5C;&#x54C1;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E66;&#x5446;&#x5B50;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E0D;&#x5982;&#x666E;&#x901A;&#x4EBA;&#x806A;&#x660E;&#x3002;&#x53EF;&#x662F;&#x4F5C;&#x4E3A;&#x666E;&#x901A;&#x4EBA;&#x7684;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E66;&#x5446;&#x5B50;&#x548C;&#x5468;&#x56F4;&#x73AF;&#x5883;&#x663E;&#x5F97;&#x683C;&#x683C;&#x4E0D;&#x5165;&#xFF0C;&#x6216;&#x8BB8;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BF4;&#x660E;&#x4ED6;&#x4EEC;&#x9886;&#x5148;&#x4E86;&#x4E00;&#x6B65;&#xFF0C;&#x6216;&#x8BB8;&#x4E66;&#x5446;&#x5B50;&#x5DF2;&#x7ECF;&#x5728;&#x601D;&#x8003;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6B63;&#x662F;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x770B;&#x91CD;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E76;&#x975E;&#x4E0D;&#x60F3;&#x8BA9;&#x81EA;&#x5DF1;&#x53D7;&#x5927;&#x5BB6;&#x73AF;&#x5883;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x6765;&#x505A;&#x8FD9;&#x4E9B;&#x666E;&#x901A;&#x4EBA;&#x6240;&#x770B;&#x91CD;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x867D;&#x7136;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x56FE;&#x7075;&#x5E76;&#x4E0D;&#x50CF;&#x7535;&#x5F71;&#x300A;&#x6A21;&#x4EFF;&#x6E38;&#x620F;&#x300B;&#x4E2D;&#x5851;&#x9020;&#x7684;&#x90A3;&#x6837;&#x602A;&#x7656;&#x3001;&#x4E0D;&#x5408;&#x7FA4;&#xFF0C;&#x53EF;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x80FD;&#x591F;&#x611F;&#x53D7;&#x5230;&#x90A3;&#x79CD;&#x5929;&#x624D;&#x822C;&#x7684;&#x75AF;&#x72C2;&#xFF0C;&#x56FE;&#x7075;&#x5C06;&#x5168;&#x90E8;&#x7CBE;&#x529B;&#x90FD;&#x4E13;&#x6CE8;&#x5728;&#x5236;&#x9020;&#x201C;&#x514B;&#x91CC;&#x65AF;&#x6258;&#x5F17;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x901A;&#x4E16;&#x6545;&#x800C;&#x88AB;&#x540C;&#x4E8B;&#x5632;&#x7B11;&#x548C;&#x6307;&#x8D23;&#xFF0C;&#x662F;&#x743C;&#x6559;&#x4F1A;&#x4ED6;&#x5982;&#x4F55;&#x548C;&#x5927;&#x5BB6;&#x76F8;&#x5904;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5F53;&#x56FE;&#x7075;&#x5C1D;&#x8BD5;&#x6539;&#x53D8;&#x4EE5;&#x540E;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x50CF;&#x666E;&#x901A;&#x4EBA;&#x4E00;&#x6837;&#x6536;&#x83B7;&#x53CB;&#x8C0A;&#xFF0C;&#x6240;&#x4EE5;&#x6240;&#x8C13;&#x5929;&#x624D;&#x65E0;&#x975E;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x6BD4;&#x5E38;&#x4EBA;&#x66F4;&#x4E13;&#x6CE8;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E2D;&#x56FD;&#x4F01;&#x4E1A;&#x66F4;&#x52A0;&#x5173;&#x6CE8;&#x8F6F;&#x4EF6;&#x4F5C;&#x4E3A;&#x79D1;&#x5B66;&#x548C;&#x5DE5;&#x7A0B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x90FD;&#x5C06;&#x7F16;&#x7A0B;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x5176;&#x5B9E;&#x7F16;&#x7A0B;&#x540C;&#x6837;&#x6709;&#x5B83;&#x4F5C;&#x4E3A;&#x4EBA;&#x6587;&#x4E0E;&#x827A;&#x672F;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8BA4;&#x8BC6;&#x5230;&#x7F16;&#x7A0B;&#x662F;&#x4E00;&#x79CD;&#x827A;&#x672F;&#x521B;&#x4F5C;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x7528;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x601D;&#x8003;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x8868;&#x8FBE;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x60F3;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x4F60;&#x53EA;&#x6709;&#x4EE5;&#x4E00;&#x79CD;&#x201C;&#x8BBE;&#x8BA1;&#x201D;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x975E;&#x201C;&#x5B9E;&#x73B0;&#x201D;&#x8F6F;&#x4EF6;&#x7684;&#x601D;&#x8DEF;&#x6765;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x73B0;&#x7F16;&#x7A0B;&#x7684;&#x4E50;&#x8DA3;&#xFF0C;&#x8FD9;&#x548C;&#x6211;&#x4EEC;&#x7684;&#x5174;&#x8DA3;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x7231;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x5B83;&#x505A;&#x5F97;&#x771F;&#x6B63;&#x4F18;&#x79C0;&#xFF0C;&#x8981;&#x662F;&#x4F60;&#x5F88;&#x70ED;&#x7231;&#x7F16;&#x7A0B;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x5F00;&#x53D1;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x2003;&#x2003;&#x575A;&#x6301;&#x4E00;&#x4E1D;&#x4E0D;&#x82DF;&#xFF0C;&#x5C31;&#x80FD;&#x53D6;&#x5F97;&#x4F18;&#x79C0;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x4E9B;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x7EC6;&#x8282;&#x7D2F;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x53D8;&#x5F97;&#x53EF;&#x89C1;&#x4E86;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;&#x8BA4;&#x4E3A;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x521B;&#x4F5C;&#x8005;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4ECE;&#x4E8B;&#x7684;&#x5C31;&#x4E0D;&#x518D;&#x662F;&#x673A;&#x68B0;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x4ED6;&#x5177;&#x5907;&#x7075;&#x611F;&#x3002;&#x5982;&#x679C;&#x7F16;&#x7A0B;&#x65F6;&#x4E0E;&#x7ED8;&#x753B;&#x548C;&#x5199;&#x4F5C;&#x540C;&#x4E00;&#x7C7B;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x9ED1;&#x5BA2;&#x662F;&#x5426;&#x6709;&#x673A;&#x4F1A;&#x50CF;&#x4F1F;&#x5927;&#x827A;&#x672F;&#x5BB6;&#x4E00;&#x6837;&#x5907;&#x53D7;&#x63A8;&#x5D07;&#x3001;&#x6D41;&#x82B3;&#x767E;&#x4E16;&#x5462;&#xFF1F;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x8B6C;&#x5982;Linus&#x4E00;&#x751F;&#x6709;Linux&#x548C;Git&#x4E24;&#x4E2A;&#x4F5C;&#x54C1;&#x5C31;&#x8DB3;&#x4EE5;&#x5F6A;&#x70B3;&#x53F2;&#x518C;&#xFF0C;&#x800C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4ED6;&#x80FD;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x4ECE;&#x4E2D;&#x6536;&#x76CA;&#xFF0C;&#x8FD9;&#x662F;&#x9ED1;&#x5BA2;&#x7CBE;&#x795E;&#x7684;&#x4EF7;&#x503C;&#x6240;&#x5728;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x4E60;&#x60EF;&#x4E8E;&#xFF0C;&#x7ED9;&#x90A3;&#x4E9B;&#x4E3A;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x4E0D;&#x60EF;&#x7684;&#x4EBA;&#xFF0C;&#x8D34;&#x4E0A;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x5176;&#x5B9E;&#x505A;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x4F2A;&#x88C5;&#x7684;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x6211;&#x800C;&#x5DF2;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x4F60;&#x4EEC;&#x8FC7;&#x9AD8;&#x7684;&#x671F;&#x671B;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x6BEB;&#x65E0;&#x4F8B;&#x5916;&#x5730;&#x88AB;&#x4EBA;&#x4EEC;&#x8BEF;&#x89E3;&#xFF0C;&#x4ECE;&#x963F;&#x91CC;&#x6708;&#x997C;&#x4E8B;&#x4EF6;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x666E;&#x901A;&#x4EBA;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x7406;&#x89E3;&#x57FA;&#x672C;&#x4FDD;&#x6301;&#x5728;&#x767D;&#x75F4;&#x8FD9;&#x6837;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x53EF;&#x8BBD;&#x523A;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x547D;&#x8FD0;&#x88AB;&#x88AB;&#x638C;&#x63E1;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x624B;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x7EDE;&#x5C3D;&#x8111;&#x6C41;&#x6765;&#x590D;&#x539F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x4EEC;&#x7684;&#x8111;&#x6D1E;&#xFF0C;&#x6211;&#x4EEC;&#x8D39;&#x5C3D;&#x5FC3;&#x673A;&#x6765;&#x9632;&#x6B62;&#x767D;&#x75F4;&#x7528;&#x6237;&#x4EEC;&#x7684;&#x9519;&#x8BEF;&#x2026;&#x2026;&#x53EF;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x88AB;&#x8FD9;&#x573A;&#x65E0;&#x60C5;&#x800C;&#x53EF;&#x7B11;&#x7684;&#x8206;&#x8BBA;&#x6253;&#x8D25;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5145;&#x6EE1;&#x656C;&#x754F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x60F3;&#x8C61;&#x4EE5;&#x81F4;&#x4E8E;&#x62BD;&#x8C61;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53EF;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x5728;&#x5C1D;&#x8BD5;&#x8BA9;&#x81EA;&#x5DF1;&#x66F4;&#x52AA;&#x529B;&#x4E00;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x8BA4;&#x8BC6;&#x7740;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x672C;&#x6765;&#x6CA1;&#x6709;&#x7B97;&#x6CD5;&#x3001;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x5F53;&#x6211;&#x4EEC;&#x521B;&#x9020;&#x548C;&#x4E86;&#x89E3;&#x8FD9;&#x4E00;&#x5207;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x770B;&#x6CD5;&#x6216;&#x8BB8;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#x4EBA;&#x7C7B;&#x7684;&#x611A;&#x8822;&#x3001;&#x72C2;&#x5984;&#x548C;&#x65E0;&#x77E5;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x8D8A;&#x63A5;&#x8FD1;&#x771F;&#x7406;&#x65F6;&#xFF0C;&#x4F60;&#x5C31;&#x8D8A;&#x4F1A;&#x8BA4;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6E3A;&#x5C0F;&#x3002;&#x6211;&#x4EEC;&#x66FE;&#x81EA;&#x4EE5;&#x4E3A;&#x662F;&#x5730;&#x76F8;&#x4FE1;&#xFF0C;&#x73B0;&#x4EE3;&#x4EBA;&#x6BD4;&#x53E4;&#x4EE3;&#x4EBA;&#x66F4;&#x806A;&#x660E;&#x3001;&#x66F4;&#x9AD8;&#x5C1A;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x7684;&#x5386;&#x53F2;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x4F1A;&#x8D8A;&#x660E;&#x767D;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF0C;&#x53E4;&#x4EBA;&#x4E0E;&#x6211;&#x4EEC;&#x662F;&#x4E00;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x66F4;&#x52C7;&#x6562;&#x4EA6;&#x6216;&#x7740;&#x66F4;&#x91CE;&#x86EE;&#xFF0C;&#x800C;&#x662F;&#x50CF;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#x7684;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x4E0D;&#x7BA1;&#x4ED6;&#x4EEC;&#x4EA7;&#x751F;&#x600E;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x90FD;&#x662F;&#x6B63;&#x5E38;&#x4EBA;&#x4EA7;&#x751F;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x5426;&#x613F;&#x610F;&#x53BB;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x65E0;&#x53EF;&#x907F;&#x514D;&#x5730;&#xFF0C;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7D27;&#x7D27;&#x5730;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4EBA;&#x7C7B;&#x5B8C;&#x6210;&#x5927;&#x91CF;&#x5DE5;&#x4F5C;&#x3002;&#x53EF;&#x4F60;&#x5FC5;&#x987B;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5B58;&#x5728;&#x7684;&#x610F;&#x4E49;&#x5E76;&#x975E;&#x662F;&#x8BA9;&#x4EBA;&#x7C7B;&#x53D8;&#x5F97;&#x66F4;&#x61D2;&#x60F0;&#x3002;&#x76F8;&#x53CD;&#x5730;&#xFF0C;&#x5B83;&#x5E0C;&#x671B;&#x4EBA;&#x7C7B;&#x5411;&#x7740;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x53BB;&#x53D1;&#x5C55;&#x3001;&#x5E0C;&#x671B;&#x4EBA;&#x7C7B;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#xFF0C;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8D8A;&#x591A;&#xFF0C;&#x4EBA;&#x7C7B;&#x9762;&#x4E34;&#x7684;&#x8FD9;&#x79CD;&#x5931;&#x4E1A;&#x7684;&#x7D27;&#x8FEB;&#x611F;&#x5C31;&#x5E94;&#x8BE5;&#x8D8A;&#x5F3A;&#x70C8;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x60F3;&#x5F53;&#x7136;&#x5730;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x7C7B;&#x4E00;&#x5B9A;&#x4F1A;&#x51CC;&#x9A7E;&#x4E8E;&#x667A;&#x80FD;&#x673A;&#x5668;&#x4E4B;&#x4E0A;&#x3002;&#x4EBA;&#x7C7B;&#x5728;&#x548C;&#x5927;&#x81EA;&#x7136;&#x6297;&#x8861;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5176;&#x65E0;&#x77E5;&#x4E0E;&#x611A;&#x8822;&#x662D;&#x7136;&#x82E5;&#x63ED;&#xFF0C;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x610F;&#x8BC6;&#x5230;&#x5730;&#x7403;&#x73AF;&#x5883;&#x9762;&#x4E34;&#x5A01;&#x80C1;&#xFF0C;&#x8FD9;&#x96BE;&#x9053;&#x4E0D;&#x662F;&#x4E3A;&#x513F;&#x65F6;&#x7684;&#x4EFB;&#x6027;&#x4ED8;&#x51FA;&#x7684;&#x4EE3;&#x4EF7;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x56FE;&#x7075;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x5C1A;&#x672A;&#x51FA;&#x73B0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x60F3;&#x5230;&#x6709;&#x4E00;&#x5929;&#x673A;&#x5668;&#x4F1A;&#x6BD4;&#x4EBA;&#x66F4;&#x806A;&#x660E;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x666E;&#x901A;&#x4EBA;&#x5C45;&#x7136;&#x72C2;&#x5984;&#x800C;&#x65E0;&#x77E5;&#x5730;&#x8BA4;&#x4E3A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E00;&#x5207;&#x5728;&#x5DE5;&#x7A0B;&#x5E08;&#x773C;&#x4E2D;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x61C2;&#x5F97;&#x656C;&#x754F;&#x81EA;&#x7136;&#x3001;&#x656C;&#x754F;&#x771F;&#x7406;&#xFF0C;&#x53EF;&#x666E;&#x901A;&#x4EBA;&#x53CD;&#x800C;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x539F;&#x7406;&#x548C;&#x4E8B;&#x5B9E;&#xFF0C;&#x66F4;&#x8BBD;&#x523A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x8BDD;&#x8BED;&#x6743;&#x662F;&#x638C;&#x63E1;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x624B;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x6765;&#x4E0D;&#x754F;&#x60E7;&#x53BB;&#x6311;&#x6218;&#x8270;&#x96BE;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x6709;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x6C38;&#x8FDC;&#x53BB;&#x656C;&#x754F;&#x548C;&#x5C0A;&#x91CD;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x771F;&#x7406;&#xFF0C;&#x90A3;&#x662F;&#x50CF;&#x4F3D;&#x5229;&#x7565;&#x3001;&#x5E03;&#x9C81;&#x8BFA;&#x3001;&#x56FE;&#x7075;&#x7B49;&#x7B49;&#x5BF9;&#x4EBA;&#x7C7B;&#x8FDB;&#x6B65;&#x505A;&#x51FA;&#x5353;&#x8D8A;&#x8D21;&#x732E;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x613F;&#x610F;&#x7528;&#x751F;&#x547D;&#x53BB;&#x634D;&#x536B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x662F;&#x6570;&#x5B66;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x627F;&#x8BA4;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x4E00;&#x95E8;&#x79D1;&#x5B66;&#xFF0C;&#x5176;&#x6B21;&#x5B83;&#x662F;&#x4E00;&#x95E8;&#x827A;&#x672F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x79CD;&#x79D1;&#x5B66;&#x548C;&#x827A;&#x672F;&#x5B8C;&#x7F8E;&#x878D;&#x5408;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5C31;&#x50CF;&#x73B0;&#x4EE3;&#x79D1;&#x6280;&#x53D1;&#x5C55;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x5730;&#x4E0D;&#x518D;&#x662F;&#x51B7;&#x51B0;&#x51B0;&#x7684;&#x63A7;&#x5236;&#x53F0;&#x7EC8;&#x7AEF;&#xFF0C;&#x800C;&#x662F;&#x6CE8;&#x91CD;&#x4EBA;&#x6027;&#x5316;&#x548C;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x56FE;&#x5F62;&#x5316;&#x754C;&#x9762;&#x3002;&#x82F9;&#x679C;&#x548C;&#x5FAE;&#x8F6F;&#x90FD;&#x66FE;&#x7ECF;&#x7A83;&#x53D6;&#x8FC7;&#x65BD;&#x4E50;&#x516C;&#x53F8;&#x7684;&#x56FE;&#x5F62;&#x5316;&#x754C;&#x9762;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x6BB5;&#x6545;&#x4E8B;&#x5728;&#x7535;&#x5F71;&#x300A;&#x7845;&#x8C37;&#x4F20;&#x5947;&#x300B;&#x4E2D;&#x66F4;&#x662F;&#x88AB;&#x6F14;&#x7ECE;&#x5F97;&#x6DCB;&#x6F13;&#x5C3D;&#x81F4;&#x3002;&#x53EF;&#x4E3A;&#x4EC0;&#x4E48;&#x4E54;&#x5E03;&#x65AF;&#x4F1A;&#x4E00;&#x76F4;&#x8BC4;&#x4EF7;&#x5FAE;&#x8F6F;&#x7684;&#x4EA7;&#x54C1;&#x6CA1;&#x6709;&#x54C1;&#x5473;&#x5462;&#xFF1F;&#x6216;&#x8BB8;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x7AD9;&#x5728;&#x4E86;&#x4E00;&#x4E2A;&#x79D1;&#x6280;&#x4E0E;&#x4EBA;&#x6587;&#x7684;&#x5341;&#x5B57;&#x8DEF;&#x53E3;&#x3002;&#x6211;&#x5E76;&#x975E;&#x679C;&#x7C89;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6211;&#x4E00;&#x76F4;&#x662F;&#x8F6F;&#x7C89;&#xFF0C;&#x53EF;&#x8FD9;&#x5E76;&#x4E0D;&#x59A8;&#x788D;&#x6211;&#x5BF9;&#x79D1;&#x6280;&#x548C;&#x7F8E;&#x7684;&#x4E00;&#x79CD;&#x70ED;&#x7231;&#xFF0C;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x80FD;&#x5728;&#x5546;&#x4E1A;&#x5316;&#x7B56;&#x7565;&#x4E2D;&#x8D77;&#x5230;&#x51B3;&#x5B9A;&#x6027;&#x4F5C;&#x7528;&#xFF0C;&#x53EF;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x4EA7;&#x54C1;&#x4E00;&#x5B9A;&#x662F;&#x5C06;&#x6280;&#x672F;&#x548C;&#x827A;&#x672F;&#x5B8C;&#x7F8E;&#x5730;&#x878D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x4E00;&#x5F20;&#x4E00;&#x5F1B;&#xFF0C;&#x6587;&#x6B66;&#x4E4B;&#x9053;&#x201D;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x9ED1;&#x5BA2;&#x548C;&#x753B;&#x5BB6;&#x5FD7;&#x540C;&#x9053;&#x5408;&#xFF0C;&#x7406;&#x6027;&#x4E0E;&#x611F;&#x6027;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6539;&#x53D8;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x53EF;&#x90A3;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x5462;&#xFF1F;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/1930050594/">互联网黑洞读书笔记(2)</a></li><li><a href="https://qinyuanpei.github.io/posts/3653716295/">像诗人一样睿智，像天才一样疯狂</a></li><li><a href="https://qinyuanpei.github.io/posts/94443781/">草食系程序员的穿搭指南</a></li><li><a href="https://blog.yuanpei.me/posts/1930050594/">互联网黑洞读书笔记(2)</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/4205536912/" rel="external">当黑客遇见画家</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/4205536912/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/4205536912/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/人文/">人文</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/黑客/">黑客</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/4205536912/&title=《当黑客遇见画家》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/4205536912/&title=《当黑客遇见画家》 — PayneQinのBlog&source=&emsp;&emsp;其实一直想读《黑客与画家》这本书，所以在我买了Kindle以后，这本书就成为我读完的第一本书。本书作者是美国互联网界举足轻重、有“..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/4205536912/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《当黑客遇见画家》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/4205536912/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/4205536912/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1254783039/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">基于C#中的Trace实现一个简单的日志系统</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3653716295/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">像诗人一样睿智，像天才一样疯狂</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/4205536912/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/4205536912/&title=《当黑客遇见画家》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/4205536912/&title=《当黑客遇见画家》 — PayneQinのBlog&source=&emsp;&emsp;其实一直想读《黑客与画家》这本书，所以在我买了Kindle以后，这本书就成为我读完的第一本书。本书作者是美国互联网界举足轻重、有“..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/4205536912/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《当黑客遇见画家》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/4205536912/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/4205536912/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/4205536912/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
