<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        一见钟情，无疾而终 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;昨天下午，当她从公司办理完离职手续的时候，她在内部聊天工具上告诉我：“师父，我在公司的离职手续都办理完了，我要走了”。在那一瞬间，我突然非常平静地走过去对她说：“那就走吧”。我不知道她是不是想让我在她离开之前做些什么，或许这完全就是我的一厢情愿，因为她在此之前就明确地告诉我，她不喜欢我，所以这注定是一个悲伤的故事。一个月前，当她的同学从公司离职的时候，她就告诉我或许某一天她">
<meta name="keywords" content="成长,感悟,爱情">
<meta property="og:type" content="article">
<meta property="og:title" content="一见钟情，无疾而终">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/21112647/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;昨天下午，当她从公司办理完离职手续的时候，她在内部聊天工具上告诉我：“师父，我在公司的离职手续都办理完了，我要走了”。在那一瞬间，我突然非常平静地走过去对她说：“那就走吧”。我不知道她是不是想让我在她离开之前做些什么，或许这完全就是我的一厢情愿，因为她在此之前就明确地告诉我，她不喜欢我，所以这注定是一个悲伤的故事。一个月前，当她的同学从公司离职的时候，她就告诉我或许某一天她">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="一见钟情，无疾而终">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;昨天下午，当她从公司办理完离职手续的时候，她在内部聊天工具上告诉我：“师父，我在公司的离职手续都办理完了，我要走了”。在那一瞬间，我突然非常平静地走过去对她说：“那就走吧”。我不知道她是不是想让我在她离开之前做些什么，或许这完全就是我的一厢情愿，因为她在此之前就明确地告诉我，她不喜欢我，所以这注定是一个悲伤的故事。一个月前，当她的同学从公司离职的时候，她就告诉我或许某一天她">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">一见钟情，无疾而终</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">一见钟情，无疾而终</h1>
        <h5 class="subtitle">
            
                <time datetime="2016-09-10T19:29:57.000Z" itemprop="datePublished" class="page-time">
  2016-09-10
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-一见钟情，无疾而终" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">一见钟情，无疾而终</h1>
        <div class="post-meta">
            <time class="post-time" title="2016-09-10 19:29:57" datetime="2016-09-10T19:29:57.000Z" itemprop="datePublished">2016-09-10</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        19 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6628;&#x5929;&#x4E0B;&#x5348;&#xFF0C;&#x5F53;&#x5979;&#x4ECE;&#x516C;&#x53F8;&#x529E;&#x7406;&#x5B8C;&#x79BB;&#x804C;&#x624B;&#x7EED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5979;&#x5728;&#x5185;&#x90E8;&#x804A;&#x5929;&#x5DE5;&#x5177;&#x4E0A;&#x544A;&#x8BC9;&#x6211;&#xFF1A;&#x201C;&#x5E08;&#x7236;&#xFF0C;&#x6211;&#x5728;&#x516C;&#x53F8;&#x7684;&#x79BB;&#x804C;&#x624B;&#x7EED;&#x90FD;&#x529E;&#x7406;&#x5B8C;&#x4E86;&#xFF0C;&#x6211;&#x8981;&#x8D70;&#x4E86;&#x201D;&#x3002;&#x5728;&#x90A3;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x975E;&#x5E38;&#x5E73;&#x9759;&#x5730;&#x8D70;&#x8FC7;&#x53BB;&#x5BF9;&#x5979;&#x8BF4;&#xFF1A;&#x201C;&#x90A3;&#x5C31;&#x8D70;&#x5427;&#x201D;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5979;&#x662F;&#x4E0D;&#x662F;&#x60F3;&#x8BA9;&#x6211;&#x5728;&#x5979;&#x79BB;&#x5F00;&#x4E4B;&#x524D;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x6211;&#x7684;&#x4E00;&#x53A2;&#x60C5;&#x613F;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x5C31;&#x660E;&#x786E;&#x5730;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5979;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6CE8;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x60B2;&#x4F24;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x524D;&#xFF0C;&#x5F53;&#x5979;&#x7684;&#x540C;&#x5B66;&#x4ECE;&#x516C;&#x53F8;&#x79BB;&#x804C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5979;&#x5C31;&#x544A;&#x8BC9;&#x6211;&#x6216;&#x8BB8;&#x67D0;&#x4E00;&#x5929;&#x5979;&#x5C31;&#x79BB;&#x5F00;&#x8FD9;&#x91CC;&#x4E86;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x8BF4;&#x6211;&#x4F1A;&#x60F3;&#x5979;&#x7684;&#xFF0C;&#x800C;&#x5F53;&#x5979;&#x771F;&#x6B63;&#x8981;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x751A;&#x81F3;&#x90FD;&#x60F3;&#x4E0D;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x5982;&#x6B64;&#x5E73;&#x9759;&#x3002;&#x4E0B;&#x73ED;&#x8DEF;&#x4E0A;&#x540C;&#x4E8B;Kent&#x82E5;&#x6709;&#x6240;&#x601D;&#x7684;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5728;&#x6211;&#x8FD9;&#x4E2A;&#x5E74;&#x9F84;&#x201C;&#x4E00;&#x89C1;&#x949F;&#x60C5;&#x201D;&#x8FD9;&#x79CD;&#x6EE1;&#x8DB3;&#x521D;&#x604B;&#x60C5;&#x7ED3;&#x7684;&#x673A;&#x4F1A;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x4E0E;&#x5176;&#x5728;&#x611F;&#x60C5;&#x7684;&#x521B;&#x4F24;&#x4E2D;&#x6301;&#x7EED;&#x5931;&#x843D;&#x4E0D;&#x5982;&#x52AA;&#x529B;&#x53BB;&#x4E89;&#x53D6;&#x4E00;&#x6BB5;&#x65B0;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x60CA;&#x8BE7;&#x4E8E;&#x4ED6;&#x7A81;&#x7136;&#x95F4;&#x53D1;&#x73B0;&#x6211;&#x9690;&#x85CF;&#x5728;&#x5FC3;&#x5E95;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x6211;&#x66F4;&#x52A0;&#x7EA0;&#x7ED3;&#x4E8E;&#x6211;&#x4E27;&#x5931;&#x4E86;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x6211;&#x50CF;&#x662F;&#x5FFD;&#x7136;&#x95F4;&#x53D1;&#x73B0;&#x6211;&#x5728;&#x611F;&#x60C5;&#x4E0A;&#x7684;&#x5929;&#x8D4B;&#x57FA;&#x672C;&#x4E3A;&#x8D1F;&#x503C;&#x4F3C;&#x7684;&#xFF0C;&#x4ECE;&#x6211;&#x5F00;&#x59CB;&#x559C;&#x6B22;&#x5979;&#x5F00;&#x59CB;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x975E;&#x5E38;&#x81EA;&#x5351;&#xFF0C;&#x751A;&#x81F3;&#x5F53;&#x6211;&#x771F;&#x6B63;&#x7AD9;&#x5728;&#x5979;&#x9762;&#x524D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7B28;&#x62D9;&#x4EE5;&#x81F3;&#x4E8E;&#x5B8C;&#x5168;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x8BF4;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x548C;&#x5979;&#x8BF4;&#x6211;&#x5728;&#x5979;&#x9762;&#x524D;&#x7684;&#x65F6;&#x5019;&#x6709;&#x70B9;&#x513F;&#x201C;&#x6015;&#x201D;&#x5979;&#xFF0C;&#x5979;&#x56DE;&#x590D;&#x7ED9;&#x6211;&#x4E00;&#x4E2A;&#x7B11;&#x8138;&#x8BF4;&#xFF1A;&#x4F60;&#x53EF;&#x662F;&#x6211;&#x5E08;&#x7236;&#x554A;&#x3002;&#x4F60;&#x77E5;&#x9053;&#x5417;&#xFF1F;&#x5F53;&#x4E00;&#x4E2A;&#x7537;&#x751F;&#x63A5;&#x53D7;&#x5973;&#x751F;&#x201C;&#x6210;&#x4E3A;&#x670B;&#x53CB;&#x201D;&#x8FD9;&#x79CD;&#x73B0;&#x5B9E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x4ED6;&#x662F;&#x5C06;&#x5BF9;&#x5979;&#x7684;&#x559C;&#x6B22;&#x4EE5;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x91CD;&#x65B0;&#x8F93;&#x51FA;&#xFF0C;&#x5C31;&#x50CF;&#x5979;&#x4E0D;&#x5728;&#x516C;&#x53F8;&#x91CC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5979;&#x613F;&#x610F;&#x59D4;&#x6258;&#x6211;&#x5E2E;&#x5979;&#x5904;&#x7406;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x662F;&#x975E;&#x5E38;&#x5F00;&#x5FC3;&#x7684;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6C38;&#x8FDC;&#x90FD;&#x671F;&#x5F85;&#x7740;&#xFF0C;&#x5979;&#x5728;&#x6709;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x5230;&#x4F60;&#xFF0C;&#x5373;&#x4F7F;&#x5979;&#x66FE;&#x7ECF;&#x62D2;&#x7EDD;&#x8FC7;&#x4F60;&#x4E24;&#x6B21;&#xFF0C;&#x5373;&#x4F7F;&#x5979;&#x660E;&#x786E;&#x544A;&#x8BC9;&#x4F60;&#x5979;&#x4E0D;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x544A;&#x8BC9;&#x8FC7;&#x81EA;&#x5DF1;&#xFF0C;&#x559C;&#x6B22;&#x662F;&#x5360;&#x6709;&#x800C;&#x7231;&#x662F;&#x514B;&#x5236;&#xFF0C;&#x81F3;&#x5C11;&#x66FE;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#x56E0;&#x4E3A;&#x5766;&#x9732;&#x5FC3;&#x58F0;&#x800C;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5F00;&#x5FC3;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x6700;&#x8BA9;&#x6211;&#x6000;&#x5FF5;&#x7684;&#x77AC;&#x95F4;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x627F;&#x8BA4;&#x6211;&#x559C;&#x6B22;&#x5979;&#x662F;&#x660E;&#x663E;&#x7684;&#x201C;&#x5957;&#x8DEF;&#x201D;&#x611F;&#x7684;&#xFF0C;&#x800C;&#x6211;&#x6070;&#x6070;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6F14;&#x6280;&#x6D3E;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x5728;&#x5979;&#x9762;&#x524D;&#x53D8;&#x5F97;&#x7B28;&#x62D9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x6211;&#x7684;&#x60C5;&#x7EEA;&#x968F;&#x65F6;&#x90FD;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x5979;&#x7684;&#x4E00;&#x4E3E;&#x4E00;&#x52A8;&#x800C;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x6211;&#x66FE;&#x7ECF;&#x56E0;&#x4E3A;&#x5979;&#x548C;&#x67D0;&#x4E2A;&#x7537;&#x751F;&#x4E00;&#x8D77;&#x800C;&#x751F;&#x5979;&#x7684;&#x95F7;&#x6C14;&#xFF0C;&#x53EF;&#x8BBD;&#x523A;&#x7684;&#x662F;&#x5979;&#x544A;&#x8BC9;&#x6211;&#x5728;&#x5979;&#x5FC3;&#x76EE;&#x4E2D;&#x6211;&#x6BD4;&#x8FD9;&#x4E2A;&#x7537;&#x751F;&#x66F4;&#x53D7;&#x6B22;&#x8FCE;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x60B2;&#x5267;&#x7684;&#x5F00;&#x59CB;&#xFF1A;&#x4F60;&#x4EBA;&#x633A;&#x597D;&#x7684;&#xFF0C;&#x53EF;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x4E0D;&#x9002;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x7EE7;&#x7EED;&#x505A;&#x670B;&#x53CB;&#x5427;&#xFF01;&#x7537;&#x4EBA;&#x5728;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x96BE;&#x4EE5;&#x63A5;&#x53D7;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x63A5;&#x53D7;&#x7684;&#x4E00;&#x4E2A;&#x73B0;&#x5B9E;&#x662F;&#xFF0C;&#x4F60;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x53EF;&#x4F60;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x7ED9;&#x5979;&#x60F3;&#x8981;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5C31;&#x50CF;&#x53E4;&#x53E4;&#x8BF4;&#x5979;&#x53EF;&#x80FD;&#x518D;&#x9047;&#x4E0D;&#x5230;&#x6211;&#x8FD9;&#x6837;&#x5BF9;&#x5979;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x5979;&#x59CB;&#x7EC8;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#x662F;&#x6CA1;&#x6709;&#x672A;&#x6765;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#x8FD9;&#x4E00;&#x5207;&#x662F;&#x5982;&#x6B64;&#x7684;&#x76F8;&#x4F3C;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#x5979;&#x4EEC;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x5F53;&#x5979;&#x4EEC;&#x540C;&#x65F6;&#x5BF9;&#x6211;&#x8BF4;&#x51FA;&#x201C;&#x4F60;&#x4F1A;&#x627E;&#x5230;&#x771F;&#x6B63;&#x9002;&#x5408;&#x4F60;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#x201D;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5DF2;&#x65E0;&#x5FC3;&#x5206;&#x8FA8;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x771F;&#x5047;&#xFF0C;&#x6211;&#x53EA;&#x77E5;&#x9053;&#x6211;&#x4F1A;&#x9677;&#x5165;&#x65E0;&#x4F11;&#x6B62;&#x7684;&#x7EA0;&#x7ED3;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6B7B;&#x5FAA;&#x73AF;&#x5BFC;&#x81F4;&#x7684;&#x7CBE;&#x795E;&#x5206;&#x88C2;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x53CC;&#x5B50;&#x5EA7;&#x7537;&#x751F;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x76F8;&#x4FE1;&#x661F;&#x5EA7;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x662F;&#x901A;&#x8FC7;&#x77E5;&#x4E4E;&#x4E0A;&#x7684;&#x76F8;&#x5173;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x53CC;&#x91CD;&#x4EBA;&#x683C;&#x53EF;&#x80FD;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x53CC;&#x5B50;&#x5EA7;&#x7684;&#x7EC8;&#x8EAB;&#x5BBF;&#x547D;&#x3002;&#x540C;&#x4E8B;&#x8BF4;&#x6211;&#x8D70;&#x8DEF;&#x7684;&#x65F6;&#x5019;&#x8EAB;&#x4F53;&#x524D;&#x503E;&#x3001;&#x53CC;&#x624B;&#x5448;&#x5408;&#x62E2;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x627F;&#x8BA4;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x53D7;&#x5230;&#x963F;&#x4EC0;&#x987F;.&#x5E93;&#x5F7B;&#x4E3B;&#x6F14;&#x7684;&#x4E54;&#x5E03;&#x65AF;&#x540C;&#x540D;&#x4F20;&#x8BB0;&#x7535;&#x5F71;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x6211;&#x662F;&#x5728;&#x523B;&#x610F;&#x6A21;&#x4EFF;&#x4ED6;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x65F6;&#x6211;&#x620F;&#x8BE9;&#x5730;&#x56DE;&#x7B54;&#x9053;&#xFF1A;&#x56E0;&#x4E3A;&#x6211;&#x662F;&#x98CE;&#x4E00;&#x6837;&#x7684;&#x7537;&#x5B50;&#x554A;&#x3002;&#x53EF;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5979;&#x8FD8;&#x662F;&#x6211;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x50CF;&#x98CE;&#x4E00;&#x6837;&#x5F7C;&#x6B64;&#x8D70;&#x8FDB;&#x5404;&#x81EA;&#x7684;&#x751F;&#x547D;&#x5386;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x50CF;&#x98CE;&#x4E00;&#x6837;&#x9041;&#x8FF9;&#x4E8E;&#x65E0;&#x5F62;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x4E00;&#x5207;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x8FC7;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x5979;&#x8BF4;&#x6211;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x60C5;&#x7EEA;&#x751F;&#x95F7;&#x6C14;&#x7684;&#x65F6;&#x5019;&#x663E;&#x5F97;&#x633A;&#x9017;&#x6BD4;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4ECE;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x5B66;&#x4F1A;&#x7BA1;&#x7406;&#x60C5;&#x7EEA;&#x3002;&#x53EF;&#x6211;&#x65F6;&#x5E38;&#x5BF9;&#x81EA;&#x5DF1;&#x4EA7;&#x751F;&#x6000;&#x7591;&#xFF0C; &#x6BD4;&#x5982;&#x6211;&#x6000;&#x7591;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x61C2;&#x5F97;&#x804A;&#x5929;&#x7684;&#x4EBA;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x6000;&#x7591;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x81EA;&#x4ECE;&#x53E4;&#x53E4;&#x79BB;&#x5F00;&#x6211;&#x4EE5;&#x540E;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x7231;&#x4EBA;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x6000;&#x7591;&#x662F;&#x4E0D;&#x662F;&#x592A;&#x4E13;&#x6CE8;&#x4E8E;&#x6280;&#x672F;&#x800C;&#x5FFD;&#x7565;&#x4E86;&#x66F4;&#x591A;&#x6280;&#x672F;&#x4EE5;&#x5916;&#x7684;&#x4E1C;&#x897F;&#x7B49;&#x7B49;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x786E;&#x5B9E;&#x5B58;&#x5728;&#xFF0C;&#x5F53;&#x4F60;&#x559C;&#x6B22;&#x4E0A;&#x4E00;&#x4E2A;&#x4EBA;&#x4EE5;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x66F4;&#x52A0;&#x4F60;&#x8EAB;&#x4E0A;&#x7684;&#x7F3A;&#x70B9;&#x4F1A;&#x5728;&#x77AC;&#x95F4;&#x88AB;&#x65B9;&#x5927;&#xFF0C;&#x5927;&#x6982;&#x8FD9;&#x662F;&#x6211;&#x5728;&#x5979;&#x9762;&#x524D;&#x81EA;&#x5351;&#x7684;&#x539F;&#x56E0;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x6240;&#x4EE5;&#x53CC;&#x5B50;&#x5EA7;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x50CF;&#x662F;&#x4E0A;&#x5E1D;&#x6253;&#x5F00;&#x4E86;&#x4E00;&#x6247;&#x65B0;&#x7A97;&#x6237;&#xFF0C;&#x5B83;&#x662F;&#x5929;&#x4F7F;&#x4E0E;&#x9B54;&#x9B3C;&#x7684;&#x7ED3;&#x5408;&#x3002;&#x800C;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x90FD;&#x88AB;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x7684;&#x4E24;&#x4E2A;&#x7075;&#x9B42;&#x5DE6;&#x53F3;&#x8005;&#xFF0C;&#x6211;&#x65F6;&#x5E38;&#x6E29;&#x67D4;&#x3001;&#x65F6;&#x5E38;&#x66B4;&#x623E;&#xFF0C;&#x5C31;&#x50CF;&#x9634;&#x6674;&#x4E0D;&#x5B9A;&#x7684;&#x5929;&#x6C14;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x8BA8;&#x538C;&#x8FD9;&#x79CD;&#x4E25;&#x91CD;&#x5206;&#x88C2;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5E38;&#x5E38;&#x8BA9;&#x6211;&#x5728;&#x5C0F;&#x4E8B;&#x60C5;&#x4E0A;&#x4E3E;&#x68CB;&#x4E0D;&#x5B9A;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x7537;&#x4EBA;&#x662F;&#x8981;&#x5B66;&#x4F1A;&#x5F53;&#x673A;&#x7ACB;&#x65AD;&#x7684;&#xFF0C;&#x53EF;&#x6211;&#x540C;&#x6837;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x6211;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x662F;&#x597D;&#x662F;&#x574F;&#xFF0C;&#x5F53;&#x4F60;&#x5B66;&#x4F1A;&#x63A5;&#x53D7;&#x8FD9;&#x4E00;&#x5207;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x7075;&#x9B42;&#x548C;&#x4F60;&#x7684;&#x8EAB;&#x4F53;&#x662F;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8BA8;&#x538C;&#x865A;&#x4F2A;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x50CF;&#x85CF;&#x5728;&#x5957;&#x5B50;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x4F60;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x54EA;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#x771F;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x53CC;&#x5B50;&#x5EA7;&#x7537;&#x751F;&#x5BF9;&#x4F60;&#x5FFD;&#x51B7;&#x5FFD;&#x70ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4FE1;&#x4EFB;&#x4ED6;&#x5C31;&#x8BA9;&#x4ED6;&#x81EA;&#x751F;&#x81EA;&#x706D;&#xFF0C;&#x5F53;&#x4ED6;&#x5B89;&#x9759;&#x4E0B;&#x6765;&#x50CF;&#x4E2A;&#x5B69;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4ED6;&#x7684;&#x5FEB;&#x4E50;&#x548C;&#x5FE7;&#x6101;&#x5C31;&#x50CF;&#x98CE;&#x4E00;&#x6837;&#x8F6C;&#x77AC;&#x5373;&#x901D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x662F;&#x98CE;&#x4E00;&#x6837;&#x7684;&#x7537;&#x5B50;&#x201D;&#x3002;&#x800C;&#x5F53;&#x4ED6;&#x5BF9;&#x4F60;&#x5931;&#x53BB;&#x5173;&#x6CE8;&#x548C;&#x70ED;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4F1A;&#x4F7F;&#x7528;&#x6700;&#x76F4;&#x63A5;&#x7684;&#x8BDD;&#x8BED;&#x544A;&#x8BC9;&#x4F60;&#x4ED6;&#x7684;&#x771F;&#x5B9E;&#x60F3;&#x6CD5;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x5728;&#x6211;&#x8FD9;&#x91CC;&#x4ECE;&#x6765;&#x53D1;&#x751F;&#x8FC7;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x6240;&#x6709;&#x88AB;&#x6211;&#x8FD9;&#x79CD;&#x9634;&#x6674;&#x4E0D;&#x5B9A;&#x7684;&#x6027;&#x683C;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x4F24;&#x5BB3;&#x8FC7;&#x7684;&#x670B;&#x53CB;&#x90FD;&#x80FD;&#x591F;&#x539F;&#x8C05;&#x6211;&#xFF0C;&#x6211;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4EBA;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x7684;&#x5FC3;&#x91CC;&#x4E00;&#x76F4;&#x6709;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x6253;&#x67B6;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x6211;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x5199;&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x8FD8;&#x559C;&#x6B22;&#x5979;&#x5417;&#xFF1F;&#x6211;&#x786E;&#x8BA4;&#x6211;&#x4F9D;&#x7136;&#x559C;&#x6B22;&#x5979;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5979;&#x5E74;&#x9F84;&#x6BD4;&#x6211;&#x5927;1&#x5C81;&#x4EE5;&#x53CA;&#x5979;&#x62E5;&#x6709;&#x7855;&#x58EB;&#x5B66;&#x4F4D;&#xFF0C;&#x8FD9;&#x6837;&#x4E24;&#x4E2A;&#x4E8B;&#x5B9E;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x66F4;&#x591A;&#x7684;&#x7EA0;&#x7ED3;&#x548C;&#x75DB;&#x82E6;&#x662F;&#x6765;&#x81EA;&#x6765;&#x81EA;&#x6211;&#x7684;&#x5426;&#x5B9A;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x8BF4;&#x7231;&#x60C5;&#x4E00;&#x534A;&#x9760;&#x7F18;&#x5206;&#x4E00;&#x534A;&#x9760;&#x4E89;&#x53D6;&#xFF0C;&#x53EF;&#x5F53;&#x4F60;&#x771F;&#x6B63;&#x8BD5;&#x56FE;&#x8D70;&#x8FDB;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x8BA4;&#x771F;&#x5730;&#x8003;&#x8651;&#x8FC7;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x60F3;&#x91CD;&#x8E48;&#x8986;&#x8F99;&#x3002;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x5E76;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x4F60;&#x5982;&#x4F55;&#x8BA9;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x4E16;&#x754C;&#x5DE7;&#x5999;&#x5730;&#x878D;&#x5408;&#x4E3A;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x65F6;&#x5E38;&#x81EA;&#x5351;&#x56E0;&#x4E3A;&#x6211;&#x5BF9;&#x672A;&#x6765;&#x8FD8;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x3002;&#x6211;&#x559C;&#x6B22;&#x8FC7;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x90FD;&#x4F1A;&#x5728;&#x6211;&#x5FC3;&#x5E95;&#x5360;&#x636E;&#x4E00;&#x7247;&#x5730;&#x65B9;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6709;&#x4E25;&#x91CD;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x548C;&#x6000;&#x65E7;&#x5FC3;&#x7406;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x53BB;&#x7ECF;&#x5E38;&#x53BB;&#x7684;&#x5730;&#x65B9;&#x5403;&#x540C;&#x6837;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x548C;&#x7ECF;&#x5E38;&#x9047;&#x89C1;&#x7684;&#x4EBA;&#x8BF4;&#x540C;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x5FE0;&#x8BDA;&#x5EA6;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x6BD4;&#x65B0;&#x9C9C;&#x611F;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x5728;&#x751F;&#x6D3B;&#x548C;&#x60C5;&#x611F;&#x4E0A;&#x7684;&#x7684;&#x786E;&#x786E;&#x5B58;&#x5728;&#x5F31;&#x70B9;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4E3B;&#x89C2;&#x610F;&#x8BC6;&#x8584;&#x5F31;&#xFF0C;&#x5BF9;&#x5F85;&#x4E8B;&#x7269;&#x7684;&#x6001;&#x5EA6;&#x968F;&#x610F;&#x800C;&#x6E29;&#x548C;&#xFF0C;&#x8FD9;&#x5728;&#x5973;&#x751F;&#x5FC3;&#x76EE;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x6210;&#x6CA1;&#x6709;&#x4E3B;&#x89C1;&#x5427;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x8FD9;&#x4E9B;&#x5C0F;&#x4E8B;&#x60C5;&#x4E0A;&#x6211;&#x4E00;&#x76F4;&#x90FD;&#x4E0D;&#x600E;&#x4E48;&#x4E0A;&#x5FC3;&#x7684;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x9700;&#x8981;&#x6539;&#x53D8;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x6628;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x7A81;&#x7136;&#x7279;&#x522B;&#x96BE;&#x8FC7;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x88AB;&#x540C;&#x4E8B;&#x8BF4;&#x4E2D;&#x5FC3;&#x4E8B;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x60F3;&#x5230;&#x6211;&#x559C;&#x6B22;&#x8FC7;&#x7684;&#x5973;&#x5B69;&#x800C;&#x5FC3;&#x5B58;&#x4E0D;&#x7518;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x618E;&#x6076;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x81EA;&#x5DF1;&#x2026;&#x2026;&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x95F4;&#x6211;&#x611F;&#x5230;&#x6211;&#x7684;&#x5FC3;&#x50CF;&#x662F;&#x88AB;&#x6316;&#x53BB;&#x4E86;&#x4E00;&#x5757;&#xFF0C;&#x539F;&#x6765;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x5982;&#x6B64;&#x96BE;&#x8FC7;&#xFF0C;&#x60F3;&#x5230;&#x79CD;&#x79CD;&#x8FC7;&#x5F80;&#x6211;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x4F1A;&#x6CE3;&#x4E0D;&#x6210;&#x58F0;&#xFF0C;&#x7ED3;&#x679C;&#x6211;&#x58F0;&#x97F3;&#x54FD;&#x54BD;&#x7740;&#x773C;&#x775B;&#x5374;&#x662F;&#x5E72;&#x7684;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x6700;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x7684;&#x90A3;&#x4E2A;&#x201C;&#x7834;&#x6D95;&#x4E3A;&#x7B11;&#x201D;&#x7684;&#x8868;&#x60C5;&#x6700;&#x80FD;&#x5F62;&#x5BB9;&#x6211;&#x5F53;&#x65F6;&#x7684;&#x5FC3;&#x5883;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x8DD1;&#x51FA;&#x53BB;&#x6563;&#x6B65;&#xFF0C;&#x5F53;&#x98CE;&#x8F7B;&#x8F7B;&#x5730;&#x5212;&#x8FC7;&#x6211;&#x7684;&#x8138;&#x5E9E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x79CB;&#x5929;&#x7684;&#x5BD2;&#x610F;&#x8BA9;&#x6211;&#x731D;&#x4E0D;&#x53CA;&#x9632;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5FFD;&#x7136;&#x89C9;&#x5F97;&#xFF0C;&#x5F53;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x8D8A;&#x53D1;&#x5730;&#x5145;&#x6EE1;&#x201C;&#x6076;&#x610F;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x66F4;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x575A;&#x5F3A;&#x5730;&#x7406;&#x7531;&#x53BB;&#x751F;&#x6D3B;&#xFF0C;&#x5979;&#x4EEC;&#x90FD;&#x6559;&#x4F1A;&#x6211;&#x5F88;&#x591A;&#xFF0C;&#x548C;&#x8FD9;&#x4E2A;&#x76F8;&#x6BD4;&#xFF0C;&#x60B2;&#x4F24;&#x548C;&#x75DB;&#x82E6;&#x90FD;&#x663E;&#x5F97;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#xFF0C;&#x6211;&#x60F3;&#x52AA;&#x529B;&#x5B66;&#x597D;&#x82F1;&#x8BED;&#x3001;&#x6211;&#x60F3;&#x52AA;&#x529B;&#x7EC3;&#x4E60;&#x5199;&#x5B57;&#x3001;&#x6211;&#x60F3;&#x52AA;&#x529B;&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x3001;&#x6211;&#x60F3;&#x52AA;&#x529B;&#x514B;&#x670D;&#x6050;&#x60E7;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x9A84;&#x50B2;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x662F;&#x5728;&#x751F;&#x6D3B;&#x4E0A;&#x66F4;&#x5E94;&#x8BE5;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4E0D;&#x80FD;&#x50CF;&#x7F16;&#x7A0B;&#x4E00;&#x6837;&#x638C;&#x63A7;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x613F;&#x610F;&#x5728;&#x8FD9;&#x7EB7;&#x7E41;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;&#xFF0C;&#x559C;&#x6B22;&#x548C;&#x7231;&#x8FD9;&#x79CD;&#x7F8E;&#x597D;&#x7684;&#x60C5;&#x611F;&#xFF0C;&#x662F;&#x4E0D;&#x8BE5;&#x8BA9;&#x60B2;&#x4F24;&#x6765;&#x6D88;&#x5316;&#x7684;&#x5962;&#x4F88;&#x54C1;&#x3002;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x671F;&#x671B;&#x662F;&#x8BA9;&#x6211;&#x53D8;&#x5F97;&#x4F18;&#x79C0;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x611F;&#x60C5;&#x95EE;&#x9898;&#x4E0A;&#x505A;&#x4E0D;&#x4E86;&#x6F14;&#x6280;&#x6D3E;&#xFF0C;&#x90A3;&#x6211;&#x53EA;&#x597D;&#x9009;&#x62E9;&#x672C;&#x8272;&#x51FA;&#x6F14;&#xFF0C;&#x771F;&#x8BDA;&#x6BD4;&#x5957;&#x8DEF;&#x66F4;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0B;&#x5348;&#x5750;&#x516C;&#x4EA4;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x7740;&#x7A97;&#x5916;&#x50CF;&#x98CE;&#x4E00;&#x6837;&#x98DE;&#x9A70;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x6211;&#x7684;&#x601D;&#x7EEA;&#x8D8A;&#x98D8;&#x8D8A;&#x8FDC;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x4EC0;&#x4E48;&#xFF0C;&#x5728;&#x90A3;&#x4E00;&#x523B;&#x6211;&#x7A81;&#x7136;&#x5F88;&#x60F3;&#x7ED9;&#x5979;&#x5199;&#x4E00;&#x9996;&#x8BD7;&#xFF0C;&#x5F53;&#x522B;&#x7684;&#x5973;&#x5B69;&#x513F;&#x5AC9;&#x5992;&#x6211;&#x5BF9;&#x5979;&#x5982;&#x5BA0;&#x6EBA;&#x4E00;&#x822C;&#x7684;&#x8010;&#x5FC3;&#x65F6;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x544A;&#x8BC9;&#x5979;&#x4EEC;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x7B28;&#x7684;&#x5F92;&#x5F1F;&#xFF0C;&#x5373;&#x4F7F;&#x5404;&#x79CD;&#x7FA1;&#x6155;&#x5AC9;&#x5992;&#x6068;&#xFF0C;&#x53EF;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x5FC3;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;&#x554A;&#xFF0C;&#x6211;&#x4E0D;&#x8FC7;&#x662F;&#x9075;&#x4ECE;&#x5B83;&#x7684;&#x610F;&#x5FD7;&#xFF0C;&#x8BA9;&#x8FD9;&#x4E00;&#x5207;&#x53D8;&#x5F97;&#x6E29;&#x6696;&#x7F8E;&#x597D;&#x8D77;&#x6765;&#xFF1A;</p>
<blockquote>
<p>&#x4F60;&#x50CF;&#x4E00;&#x9635;&#x98CE;/&#x6211;&#x4F38;&#x5F00;&#x624B;<br>&#x6293;&#x5230;&#x7684;&#x53EA;&#x6709;/&#x82B1;&#x843D;&#x540E;&#x7684;&#x82AC;&#x82B3;<br>&#x6211;&#x79BB;&#x4F60;/&#x65F6;&#x800C;&#x5F88;&#x8FD1;/&#x65F6;&#x800C;&#x5F88;&#x8FDC;<br>&#x50CF;&#x5929;&#x4E0A;&#x7684;&#x4E91;/&#x8212;&#x5377;&#x6210;&#x8776;<br>&#x6211;&#x4E0D;&#x60F3;&#x53BB;&#x91C7;&#x6458;&#x5B83;&#x554A;<br>&#x6708;&#x4EAE;&#x9759;&#x5F85;&#x7740;&#x5B83;&#x6012;&#x653E;<br>&#x6211;&#x613F;&#x610F;&#x5B88;&#x62A4;&#x5B83;&#x4E00;&#x523B;<br>&#x5373;&#x4F7F;&#x5B83;&#x4E00;&#x76F4;&#x5F53;&#x6708;&#x4EAE;&#x662F;&#x592A;&#x9633;</p>
</blockquote>
<p>2016&#x5E74;9&#x6708;10&#x65E5; Payne</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/720539850/">不如归去</a></li><li><a href="https://qinyuanpei.github.io/posts/1394521917/">青黄未接的2015</a></li><li><a href="https://qinyuanpei.github.io/posts/3111375079/">冬天来了，春天还会远吗？</a></li><li><a href="https://zymin.cn/arcticle/speaking.html">宝宝学说话</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/21112647/" rel="external">一见钟情，无疾而终</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/21112647/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/21112647/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/感悟/">感悟</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/爱情/">爱情</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/21112647/&title=《一见钟情，无疾而终》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/21112647/&title=《一见钟情，无疾而终》 — PayneQinのBlog&source=&emsp;&emsp;昨天下午，当她从公司办理完离职手续的时候，她在内部聊天工具上告诉我：“师父，我在公司的离职手续都办理完了，我要走了”。在那一瞬间，..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/21112647/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《一见钟情，无疾而终》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/21112647/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/21112647/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3247186509/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">一个关于概率的问题的思考</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/569337285/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">浅析WPF中MVVM模式下命令与委托的关系</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/21112647/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/21112647/&title=《一见钟情，无疾而终》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/21112647/&title=《一见钟情，无疾而终》 — PayneQinのBlog&source=&emsp;&emsp;昨天下午，当她从公司办理完离职手续的时候，她在内部聊天工具上告诉我：“师父，我在公司的离职手续都办理完了，我要走了”。在那一瞬间，..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/21112647/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《一见钟情，无疾而终》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/21112647/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/21112647/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/21112647/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
