<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        爱情像一场霍乱 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x8DDD;&amp;#x79BB;&amp;#x8BFB;&amp;#x5B8C;&amp;#x9A6C;&amp;#x5C14;&amp;#x514B;&amp;#x65AF;&amp;#x7684;&amp;#x300A;&amp;#x970D;&amp;#x4E71;&amp;#x65F6;&amp;#x671F;&amp;#x7684;&amp;#x7231;&amp;#x60C5;&amp;#x300B;&amp;#x8FD9;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x5DEE">
<meta name="keywords" content="影评,阅读,马尔克斯">
<meta property="og:type" content="article">
<meta property="og:title" content="爱情像一场霍乱">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/3782208845/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x8DDD;&amp;#x79BB;&amp;#x8BFB;&amp;#x5B8C;&amp;#x9A6C;&amp;#x5C14;&amp;#x514B;&amp;#x65AF;&amp;#x7684;&amp;#x300A;&amp;#x970D;&amp;#x4E71;&amp;#x65F6;&amp;#x671F;&amp;#x7684;&amp;#x7231;&amp;#x60C5;&amp;#x300B;&amp;#x8FD9;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x5DEE">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="爱情像一场霍乱">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x8DDD;&amp;#x79BB;&amp;#x8BFB;&amp;#x5B8C;&amp;#x9A6C;&amp;#x5C14;&amp;#x514B;&amp;#x65AF;&amp;#x7684;&amp;#x300A;&amp;#x970D;&amp;#x4E71;&amp;#x65F6;&amp;#x671F;&amp;#x7684;&amp;#x7231;&amp;#x60C5;&amp;#x300B;&amp;#x8FD9;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x5DEE">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

<link rel="stylesheet" href="/assets/css/APlayer.min.css" class="aplayer-style-marker">
<script src="/assets/js/APlayer.min.js" class="aplayer-script-marker"></script>
<script src="/assets/js/Meting.min.js" class="meting-script-marker"></script>
</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">爱情像一场霍乱</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">爱情像一场霍乱</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-05-22T09:05:34.000Z" itemprop="datePublished" class="page-time">
  2018-05-22
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-爱情像一场霍乱" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">爱情像一场霍乱</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-05-22 09:05:34" datetime="2018-05-22T09:05:34.000Z" itemprop="datePublished">2018-05-22</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        26 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <div id="aplayer-lTpSjkCK" class="aplayer aplayer-tag-marker meting-tag-marker" data-id="536622304" data-server="netease" data-type="song" data-mode="circulation" data-autoplay="true" data-mutex="false" data-listmaxheight="340px" data-preload="none" data-theme="#ad7a86"></div>
<p>&#x2003;&#x2003;&#x8DDD;&#x79BB;&#x8BFB;&#x5B8C;&#x9A6C;&#x5C14;&#x514B;&#x65AF;&#x7684;&#x300A;&#x970D;&#x4E71;&#x65F6;&#x671F;&#x7684;&#x7231;&#x60C5;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#x5566;&#x3002;&#x76F8;&#x6BD4;&#x5C0F;&#x8BF4;&#x4E2D;&#x9519;&#x7EFC;&#x590D;&#x6742;&#x7684;&#x4EBA;&#x7269;&#x5173;&#x7CFB;&#xFF0C;&#x66F4;&#x52A0;&#x8BA9;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x6216;&#x8BB8;&#x662F;&#x201C;&#x767E;&#x5E74;&#x5B64;&#x72EC;&#x201D;&#x5F0F;&#x7684;&#x5F00;&#x5934;&#x3002;&#x4E0D;&#x8BBA;&#x662F;&#x591A;&#x5E74;&#x540E;&#x9762;&#x5BF9;&#x884C;&#x5211;&#x961F;&#x7684;&#x5E03;&#x6069;&#x8FEA;&#x4E9A;&#x4E0A;&#x6821;&#xFF0C;&#x8FD8;&#x662F;&#x62CD;&#x6253;&#x9E66;&#x9E49;&#x7ED3;&#x679C;&#x4ECE;&#x68AF;&#x5B50;&#x4E0A;&#x6454;&#x4E0B;&#x6765;&#x7684;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x533B;&#x751F;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x523B;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x7269;&#x7684;&#x8FC7;&#x53BB;&#x4E0E;&#x73B0;&#x5728;&#x5C42;&#x53E0;&#x51FA;&#x7684;&#x8FD9;&#x79CD;&#x65F6;&#x7A7A;&#x611F;&#xFF0C;&#x6216;&#x8BB8;&#x5C31;&#x662F;&#x9A6C;&#x5C14;&#x514B;&#x65AF;&#x60F3;&#x8981;&#x53BB;&#x63CF;&#x7ED8;&#x7684;&#x9B54;&#x5E7B;&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x3002;&#x6700;&#x8FD1;&#x770B;&#x4E86;&#x7531;&#x5C0F;&#x8BF4;&#x6539;&#x7F16;&#x7684;&#x540C;&#x540D;&#x7535;&#x5F71;&#xFF0C;&#x611F;&#x89C9;&#x5BF9;&#x8FD9;&#x90E8;&#x5C0F;&#x8BF4;&#x7684;&#x5370;&#x8C61;&#x66F4;&#x4E3A;&#x5177;&#x4F53;&#x5316;&#xFF0C;&#x5C0F;&#x8BF4;&#x7684;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x5C06;&#x8FD1;&#x534A;&#x4E2A;&#x4E16;&#x7EAA;&#xFF0C;&#x662F;&#x9009;&#x62E9;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x548C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x8FD9;&#x6837;&#x7A33;&#x5B9A;&#x7684;&#x5A5A;&#x59FB;&#x5173;&#x7CFB;&#xFF0C;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x963F;&#x91CC;&#x8428;&#x548C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x8FD9;&#x6837;&#x504F;&#x6267;&#x7684;&#x7231;&#x60C5;&#x6545;&#x4E8B;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x53BB;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;&#x5427;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x4ECE;&#x68AF;&#x5B50;&#x4E0A;&#x6454;&#x4E0B;&#x6765;&#x5373;&#x5C06;&#x79BB;&#x5F00;&#x4EBA;&#x4E16;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x62FC;&#x5C3D;&#x6700;&#x540E;&#x4E00;&#x53E3;&#x6C14;&#x5BF9;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x8BF4;&#xFF1A;&#x201C;&#x53EA;&#x6709;&#x4E0A;&#x5E1D;&#x624D;&#x77E5;&#x9053;&#x6211;&#x6709;&#x591A;&#x7231;&#x4F60;&#x201D;&#x3002;&#x5355;&#x5355;&#x4ECE;&#x8FD9;&#x53E5;&#x8BDD;&#x6765;&#x770B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#x6216;&#x8BB8;&#x662F;&#x76F8;&#x7231;&#x7684;&#x3002;&#x53EF;&#x660E;&#x660E;&#x4E0D;&#x4E45;&#x524D;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x8FD8;&#x5728;&#x4E3A;&#x4E86;&#x4E00;&#x5757;&#x80A5;&#x7682;&#x7684;&#x4E8B;&#x60C5;&#x800C;&#x4E89;&#x5435;&#x3002;&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x5BF9;&#x51FA;&#x8F68;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x770B;&#x5F97;&#x7279;&#x522B;&#x91CD;&#xFF0C;&#x91CD;&#x8981;&#x5230;&#x4E0D;&#x8981;&#x8BF4;&#x662F;&#x8089;&#x4F53;&#x51FA;&#x8F68;&#xFF0C;&#x8FDE;&#x7CBE;&#x795E;&#x51FA;&#x8F68;&#x90FD;&#x662F;&#x4E0D;&#x80FD;&#x88AB;&#x539F;&#x8C05;&#x7684;&#x3002;&#x4ECE;&#x53BB;&#x5E74;&#x81F3;&#x4ECA;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0A;&#x5404;&#x79CD;&#x51FA;&#x8F68;&#x7684;&#x8206;&#x8BBA;&#x6D88;&#x606F;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x597D;&#x50CF;&#x7231;&#x60C5;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x503C;&#x5F97;&#x671F;&#x5F85;&#x3002;&#x53EF;&#x4F60;&#x770B;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x548C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x7684;&#x5A5A;&#x59FB;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x5728;&#x59BB;&#x5B50;&#x5916;&#x51FA;&#x671F;&#x95F4;&#x51FA;&#x8F68;&#x4E86;&#x4E00;&#x540D;&#x9ED1;&#x4EBA;&#x5973;&#x5B50;&#xFF0C;&#x867D;&#x7136;&#x4ED6;&#x9009;&#x62E9;&#x4E3B;&#x52A8;&#x5411;&#x59BB;&#x5B50;&#x627F;&#x8BA4;&#x51FA;&#x8F68;&#xFF0C;&#x53CA;&#x65F6;&#x56DE;&#x5F52;&#x5BB6;&#x5EAD;&#xFF0C;&#x53EF;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x5916;&#x4EBA;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5A5A;&#x59FB;&#x662F;&#x542B;&#x6709;&#x6742;&#x8D28;&#x7684;&#x5A5A;&#x59FB;&#x3002;&#x4ECE;&#x59BB;&#x5B50;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5979;&#x7ED3;&#x5A5A;&#x4EE5;&#x524D;&#x662F;&#x4E0D;&#x5403;&#x8304;&#x5B50;&#x7684;&#xFF0C;&#x800C;&#x7ED3;&#x5A5A;&#x4EE5;&#x540E;&#x5219;&#x9002;&#x5E94;&#x4E86;&#x8304;&#x5B50;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x4E00;&#x65B9;&#x9009;&#x62E9;&#x59A5;&#x534F;&#x3002;&#x53EF;&#x5728;&#x4E00;&#x4E2A;&#x52A8;&#x8F84;&#x8BB2;&#x4E09;&#x89C2;&#x3001;&#x8BB2;&#x5174;&#x8DA3;&#x3001;&#x8BB2;&#x5730;&#x4F4D;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x4F1A;&#x89C9;&#x5F97;&#x4E24;&#x4E2A;&#x4EBA;&#x5408;&#x9002;&#x5462;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x5408;&#x9002;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x5DE7;&#x5999;&#x7684;&#x8BCD;&#x6C47;&#xFF0C;&#x5DE7;&#x5999;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x5B83;&#x771F;&#x6B63;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x201C;&#x4EE5;&#x4E0D;&#x53D8;&#x5E94;&#x4E07;&#x53D8;&#x201D;&#x3002;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x592B;&#x5987;&#x7684;&#x5A5A;&#x59FB;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x771F;&#x5B9E;&#x5199;&#x7167;&#x3002;&#x4E24;&#x4E2A;&#x4EBA;&#x7B2C;&#x4E00;&#x6B21;&#x89C1;&#x9762;&#xFF0C;&#x6E90;&#x4E8E;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x7684;&#x4E00;&#x573A;&#x75BE;&#x75C5;&#x3002;&#x5F53;&#x65F6;&#x5916;&#x9762;&#x6B63;&#x6D41;&#x884C;&#x7740;&#x970D;&#x4E71;&#x75AB;&#x75C5;&#xFF0C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x56E0;&#x4E3A;&#x6000;&#x7591;&#x88AB;&#x611F;&#x67D3;&#x4E86;&#x970D;&#x4E71;&#x4E0D;&#x5F97;&#x4E0D;&#x5BFB;&#x627E;&#x533B;&#x751F;&#x6CBB;&#x7597;&#xFF0C;&#x6070;&#x597D;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x6B63;&#x4ECE;&#x5DF4;&#x9ECE;&#x65C5;&#x884C;&#x56DE;&#x6765;&#x3002;&#x5728;&#x533B;&#x5B66;&#x6280;&#x672F;&#x4E0D;&#x53D1;&#x8FBE;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x533B;&#x751F;&#x662F;&#x6CA1;&#x6709;&#x542C;&#x8BCA;&#x5668;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x5FC5;&#x987B;&#x8D34;&#x7740;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x88F8;&#x9732;&#x7684;&#x80F8;&#x90E8;&#x542C;&#x5FC3;&#x8DF3;&#x3002;&#x4E66;&#x4F5C;&#x548C;&#x7535;&#x5F71;&#x4E2D;&#x90FD;&#x8BE6;&#x7EC6;&#x5730;&#x63CF;&#x7ED8;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E24;&#x4E2A;&#x9752;&#x5E74;&#x7537;&#x5973;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x751F;&#x4E86;&#x8EAB;&#x4F53;&#x4E0A;&#x7684;&#x63A5;&#x89E6;&#xFF0C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x66F4;&#x662F;&#x88AB;&#x5BF9;&#x65B9;&#x8EAB;&#x4E0A;&#x7684;&#x7537;&#x6027;&#x6C14;&#x6982;&#x6240;&#x5438;&#x5F15;&#x3002;&#x53EF;&#x8FD9;&#x7B97;&#x662F;&#x7231;&#x60C5;&#x5417;&#xFF1F;&#x6211;&#x66F4;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x539F;&#x59CB;&#x7684;&#x6B32;&#x671B;&#x51B2;&#x52A8;&#xFF0C;&#x53EF;&#x4F60;&#x8BF4;&#x8FD9;&#x4E24;&#x4E2A;&#x4EBA;&#x95F4;&#x6CA1;&#x6709;&#x7231;&#x60C5;&#xFF0C;&#x4F30;&#x8BA1;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4F1A;&#x53CD;&#x5BF9;&#xFF0C;&#x8C01;&#x8BA9;&#x6211;&#x4EEC;&#x90FD;&#x559C;&#x6B22;&#x7528;&#x6D77;&#x67AF;&#x77F3;&#x70C2;&#x8868;&#x793A;&#x7231;&#x60C5;&#x7684;&#x5FE0;&#x8D1E;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x751F;&#x6D3B;50&#x5E74;&#xFF0C;&#x751A;&#x81F3;&#x4F5C;&#x8005;&#x90FD;&#x8868;&#x793A;&#xFF1A;&#x4E00;&#x5BF9;&#x6069;&#x7231;&#x7684;&#x592B;&#x59BB;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x5E78;&#x798F;&#xFF0C;&#x800C;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x627F;&#x8BA4;&#xFF0C;&#x7231;&#x60C5;&#x6700;&#x7EC8;&#x90FD;&#x4F1A;&#x90E8;&#x5206;&#x5730;&#x8F6C;&#x5316;&#x4E3A;&#x4EB2;&#x60C5;&#xFF0C;&#x7231;&#x60C5;&#x672C;&#x8EAB;&#x662F;&#x6709;&#x7455;&#x75B5;&#x7684;&#x3001;&#x6709;&#x7F3A;&#x9677;&#x7684;&#xFF0C;&#x4E89;&#x5435;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#xFF0C;&#x72AF;&#x9519;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x3002;&#x8BDA;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5E0C;&#x671B;&#x5BF9;&#x65B9;&#x5FE0;&#x8BDA;&#x7684;&#x5BF9;&#x5F85;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x4EBA;&#x5F52;&#x6839;&#x5230;&#x5E95;&#x662F;&#x4E00;&#x79CD;&#x5BF9;&#x81EA;&#x6211;&#x5FE0;&#x8BDA;&#x7684;&#x52A8;&#x7269;&#xFF0C;&#x4F60;&#x8BF4;&#x4F60;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x5BF9;&#x65B9;&#x53D8;&#x5FC3;&#xFF0C;&#x53EF;&#x4EBA;&#x3001;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x65E0;&#x65F6;&#x65E0;&#x523B;&#x4E0D;&#x5728;&#x53D1;&#x751F;&#x7740;&#x53D8;&#x5316;&#xFF0C;&#x559C;&#x6B22;&#x6216;&#x8005;&#x4E0D;&#x559C;&#x6B22;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x67D0;&#x4E00;&#x77AC;&#x95F4;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x76F8;&#x4FE1;&#xFF0C;&#x7231;&#x60C5;&#x672C;&#x6765;&#x5C31;&#x4E0D;&#x5B8C;&#x7F8E;&#x3001;&#x5145;&#x6EE1;&#x7455;&#x75B5;&#xFF0C;&#x53EF;&#x8FD9;&#x5C31;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x7231;&#x60C5;&#x7684;&#x6837;&#x5B50;&#x554A;&#xFF0C;&#x4EBA;&#x4EEC;&#x4F1A;&#x8BB0;&#x5F97;&#x4F60;&#x5A5A;&#x793C;&#x4E0A;&#x7684;&#x6D77;&#x8A93;&#x5C71;&#x76DF;&#xFF0C;&#x552F;&#x72EC;&#x4E0D;&#x4F1A;&#x8BB0;&#x5F97;&#x4F60;&#x6BCF;&#x5929;&#x67F4;&#x7C73;&#x6CB9;&#x76D0;&#x7684;&#x5E73;&#x5E73;&#x6DE1;&#x6DE1;&#xFF1B;&#x4EBA;&#x4EEC;&#x4F1A;&#x7ED9;&#x4ED6;&#x4EEC;&#x613F;&#x610F;&#x770B;&#x5230;&#x7684;&#x8868;&#x9762;&#x73B0;&#x8C61;&#x53BB;&#x70B9;&#x8D5E;&#xFF0C;&#x552F;&#x72EC;&#x4E0D;&#x4F1A;&#x5173;&#x6CE8;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x5FEB;&#x4E50;&#x3002;&#x7231;&#x60C5;&#x91CC;&#x6709;&#x4EBA;&#x4E0D;&#x538C;&#x5176;&#x70E6;&#x5730;&#x5BFB;&#x627E;&#x771F;&#x7231;&#xFF0C;&#x6709;&#x4EBA;&#x6C89;&#x6EBA;&#x5728;&#x56DE;&#x5FC6;&#x91CC;&#x4E0D;&#x6562;&#x518D;&#x89E6;&#x78B0;&#x7231;&#x60C5;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#x6211;&#x90FD;&#x8868;&#x793A;&#x5C0A;&#x91CD;&#xFF0C;&#x56E0;&#x4E3A;&#x7231;&#x60C5;&#x672C;&#x6765;&#x5C31;&#x6709;&#x5B83;&#x771F;&#x5B9E;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x8FD8;&#x4F1A;&#x4E0D;&#x4F1A;&#x6709;&#x4EBA;&#x4E3A;&#x4E86;&#x522B;&#x4EBA;&#x800C;&#x82E6;&#x7B49;51&#x5E74;9&#x4E2A;&#x6708;&#x96F6;4&#x5929;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x7A76;&#x7ADF;&#x6709;&#x591A;&#x5927;&#x7684;&#x52C7;&#x6C14;&#x548C;&#x6267;&#x5FF5;&#xFF0C;&#x624D;&#x80FD;&#x4ECE;&#x4E00;&#x4E2A;&#x671D;&#x6C14;&#x84EC;&#x52C3;&#x7684;&#x9752;&#x5E74;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x767D;&#x53D1;&#x82CD;&#x82CD;&#x7684;&#x8001;&#x4EBA;&#x3002;&#x91D1;&#x5EB8;&#x5148;&#x751F;&#x7684;&#x540D;&#x7BC7;&#x300A;&#x5C04;&#x96D5;&#x82F1;&#x96C4;&#x4F20;&#x300B;&#x91CC;&#xFF0C;&#x795E;&#x7B97;&#x5B50;&#x745B;&#x59D1;&#x56E0;&#x4E3A;&#x5931;&#x53BB;&#x7231;&#x5B50;&#x800C;&#x4E00;&#x591C;&#x767D;&#x5934;&#xFF0C;&#x6211;&#x60F3;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x6709;&#x5BF9;&#x6BB5;&#x7687;&#x7237;&#x89C1;&#x6B7B;&#x4E0D;&#x6551;&#x7684;&#x6028;&#x6068;&#xFF0C;&#x6709;&#x5BF9;&#x5468;&#x4F2F;&#x901A;&#x6C42;&#x800C;&#x4E0D;&#x5F97;&#x7684;&#x6267;&#x5FF5;&#x3002;&#x53EF;&#x5BF9;&#x963F;&#x91CC;&#x8428;&#x800C;&#x8A00;&#xFF0C;&#x4ECE;&#x4ED6;&#x9047;&#x89C1;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x90A3;&#x5929;&#x5F00;&#x59CB;&#xFF0C;&#x4ED6;&#x7684;&#x751F;&#x547D;&#x5C31;&#x4EFF;&#x4F5B;&#x6CE8;&#x5B9A;&#x662F;&#x5C5E;&#x4E8E;&#x5979;&#x7684;&#xFF0C;&#x4ED6;&#x575A;&#x6301;&#x7ED9;&#x5979;&#x5199;&#x4FE1;&#xFF0C;&#x5728;&#x697C;&#x4E0B;&#x4E3A;&#x5979;&#x62C9;&#x5C0F;&#x63D0;&#x7434;&#xFF0C;&#x5728;&#x957F;&#x6905;&#x4E0A;&#x523B;&#x4E0B;&#x5979;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x559D;&#x82B1;&#x9732;&#x6C34;&#x3001;&#x5403;&#x73AB;&#x7470;&#x82B1;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x7231;&#x60C5;&#x50CF;&#x4E00;&#x573A;&#x970D;&#x4E71;&#xFF0C;&#x5E94;&#x8BE5;&#x4F1A;&#x6CA1;&#x6709;&#x6000;&#x7591;&#xFF0C;&#x56E0;&#x4E3A;&#x963F;&#x91CC;&#x8428;&#x7684;&#x786E;&#x50CF;&#x662F;&#x751F;&#x4E86;&#x4E00;&#x573A;&#x970D;&#x4E71;&#xFF0C;&#x4E0D;&#x7136;&#x600E;&#x4E48;&#x4F1A;&#x75AF;&#x72C2;&#x5730;&#x7231;&#x76F4;&#x81F3;&#x504F;&#x6267;&#x751A;&#x81F3;&#x6709;&#x4E9B;&#x8352;&#x5510;&#x3002;&#x6211;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x963F;&#x91CC;&#x8428;&#x7684;&#x4E3E;&#x52A8;&#xFF0C;&#x56E0;&#x4E3A;&#x5E74;&#x8F7B;&#x65F6;&#x7684;&#x6211;&#x4EEC;&#x90FD;&#x66FE;&#x505A;&#x51FA;&#x8FC7;&#x7C7B;&#x4F3C;&#x7684;&#x4E3E;&#x52A8;&#x3002;&#x6211;&#x5E76;&#x4E0D;&#x53CD;&#x5BF9;&#x8FD9;&#x6837;&#x7684;&#x7231;&#x60C5;&#xFF0C;&#x53EF;&#x5F53;&#x4F60;&#x56DE;&#x5934;&#x6765;&#x770B;&#x8FD9;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x7231;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x5BF9;&#x963F;&#x91CC;&#x8428;&#x8FD9;&#x4E2A;&#x4EBA;&#x51E0;&#x4E4E;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#xFF0C;&#x9664;&#x4E86;&#x77E5;&#x9053;&#x5BF9;&#x65B9;&#x7684;&#x804C;&#x4E1A;&#x662F;&#x62A5;&#x52A1;&#x5458;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7535;&#x5F71;&#x4E2D;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x751A;&#x81F3;&#x7ED9;&#x963F;&#x91CC;&#x8428;&#x56DE;&#x4E86;&#x4FE1;&#xFF0C;&#x53EF;&#x5C31;&#x5982;&#x540C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x6240;&#x8A00;&#xFF0C;&#x201C;&#x4ED6;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x53EA;&#x6709;&#x865A;&#x5E7B;&#xFF0C;&#x7231;&#x60C5;&#x8499;&#x853D;&#x4E86;&#x5F7C;&#x6B64;&#x7684;&#x53CC;&#x773C;&#x201D;&#xFF0C;&#x5927;&#x6982;&#x6240;&#x6709;&#x4E00;&#x89C1;&#x949F;&#x60C5;&#x7684;&#x4EBA;&#x90FD;&#x6CA1;&#x80FD;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4F60;&#x771F;&#x7684;&#x4E86;&#x89E3;&#x5BF9;&#x65B9;&#x8FD9;&#x4E2A;&#x4EBA;&#x5417;&#xFF1F;&#x975E;&#x5E38;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x4EB2;&#x8FD1;&#x5982;&#x7236;&#x6BCD;&#x3001;&#x59BB;&#x5B50;&#x548C;&#x4E08;&#x592B;&#x8FD9;&#x6837;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x4E5F;&#x6C38;&#x8FDC;&#x4E0D;&#x53EF;&#x80FD;&#x4E86;&#x89E3;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x7A76;&#x7ADF;&#x8981;&#x7231;&#x5F97;&#x591A;&#x5351;&#x5FAE;&#xFF0C;&#x624D;&#x4F1A;&#x5FC3;&#x5FC3;&#x5FF5;&#x5FF5;&#x5730;&#x7B49;&#x7740;&#x5BF9;&#x65B9;&#x7684;&#x4E08;&#x592B;&#x6B7B;&#x6389;&#xFF0C;&#x751A;&#x81F3;&#x6015;&#x5BF9;&#x65B9;&#x6BD4;&#x4E08;&#x592B;&#x5148;&#x6B7B;&#x6389;&#x3002;&#x5047;&#x5982;&#x963F;&#x91CC;&#x8428;&#x53EA;&#x662F;&#x8FD9;&#x6837;&#x75F4;&#x75F4;&#x7B49;&#x5F85;50&#x5E74;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x591A;&#x53EA;&#x662F;&#x66FF;&#x4ED6;&#x611F;&#x5230;&#x60CB;&#x60DC;&#x800C;&#x5DF2;&#xFF0C;&#x53EF;&#x504F;&#x504F;&#x963F;&#x91CC;&#x8428;&#x4E3A;&#x4E86;&#x201C;&#x62A5;&#x590D;&#x201D;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#xFF0C;&#x7F13;&#x89E3;&#x88AB;&#x5979;&#x4F24;&#x5BB3;&#x7684;&#x5FC3;&#xFF0C;&#x5F00;&#x59CB;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x5730;&#x75AF;&#x72C2;&#x7EB5;&#x6B32;&#xFF0C;&#x5728;&#x8089;&#x4F53;&#x7684;&#x72C2;&#x6B22;&#x4E2D;&#x4E0D;&#x65AD;&#x5F3A;&#x5316;&#x7CBE;&#x795E;&#x5C42;&#x9762;&#x4E0A;&#x5BF9;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x7684;&#x7231;&#xFF0C;&#x636E;&#x4ED6;&#x81EA;&#x5DF1;&#x8BB0;&#x8F7D;&#xFF0C;&#x4ED6;&#x548C;&#x5BE1;&#x5987;&#x3001;&#x5C11;&#x5987;&#x751A;&#x81F3;&#x5C11;&#x5973;&#x90FD;&#x53D1;&#x751F;&#x8FC7;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x5F53;&#x4ED6;&#x7EC8;&#x4E8E;&#x7B49;&#x6765;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x58F0;&#x79F0;&#x81EA;&#x5DF1;&#x662F;&#x4E00;&#x4E2A;&#x5904;&#x7537;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4EBA;&#x5E38;&#x5E38;&#x590D;&#x6742;&#x5230;&#x8BA9;&#x4F60;&#x6211;&#x6000;&#x7591;&#x4EBA;&#x751F;&#xFF0C;&#x800C;&#x963F;&#x91CC;&#x8428;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x5230;&#xFF0C;&#x8BA9;&#x4F60;&#x89C9;&#x5F97;&#x4ED6;&#x8FD8;&#x6709;&#x70B9;&#x53EF;&#x601C;&#x7684;&#x4EBA;&#x3002;&#x4ED6;&#x89C6;&#x5176;&#x5B83;&#x5973;&#x6027;&#x7684;&#x8089;&#x4F53;&#x5982;&#x65E0;&#x7269;&#xFF0C;&#x552F;&#x72EC;&#x5C06;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x63A8;&#x4E0A;&#x5973;&#x795E;&#x7684;&#x5723;&#x575B;&#x3002;&#x66F4;&#x5FAE;&#x5999;&#x7684;&#x662F;&#xFF0C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x5C45;&#x7136;&#x662F;&#x559C;&#x6B22;&#x8FC7;&#x963F;&#x91CC;&#x8428;&#x8FD9;&#x4E2A;&#x4EBA;&#x7684;&#x3002;&#x5979;&#x4E0D;&#x8FC7;&#x662F;&#x5728;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x548C;&#x963F;&#x91CC;&#x8428;&#x95F4;&#x9009;&#x62E9;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x800C;&#x5DF2;&#xFF0C;&#x53EF;&#x963F;&#x91CC;&#x8428;&#x8FD9;&#x79CD;&#x75C5;&#x6001;&#x7684;&#x7231;&#x5728;&#x6211;&#x770B;&#x6765;&#x662F;&#x6781;&#x4E3A;&#x81EA;&#x79C1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x4E24;&#x4E2A;&#x4EBA;&#x591A;&#x4E48;&#x5730;&#x7231;&#x5F7C;&#x6B64;&#xFF0C;&#x4E00;&#x65E6;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x8089;&#x4F53;&#x7684;&#x51FA;&#x8F68;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x633D;&#x56DE;&#x3002;&#x867D;&#x7136;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x9009;&#x62E9;&#x5AC1;&#x7ED9;&#x4E86;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#xFF0C;&#x53EF;&#x5047;&#x5982;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x8EAB;&#x4F53;&#x4E0A;&#x51FA;&#x8F68;&#x65E0;&#x6570;&#x6B21;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x4E08;&#x592B;&#x901D;&#x4E16;&#x4EE5;&#x540E;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4ED6;&#x7B49;&#x8FD9;&#x4E00;&#x5929;&#x5DF2;&#x7ECF;&#x7B49;&#x4E86;51&#x5E74;9&#x4E2A;&#x6708;&#x96F6;4&#x5929;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x4F1A;&#x4F5C;&#x4F55;&#x611F;&#x60F3;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x5C01;&#x5EFA;&#x601D;&#x60F3;&#x6B8B;&#x7559;&#xFF0C;&#x6211;&#x5C0A;&#x91CD;&#x5973;&#x6027;&#x5728;&#x4E08;&#x592B;&#x6B7B;&#x540E;&#x6539;&#x5AC1;&#x7684;&#x81EA;&#x7531;&#xFF0C;&#x53EF;&#x9009;&#x62E9;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x201C;&#x7F3A;&#x70B9;&#x201D;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x53BB;&#x8BA4;&#x771F;&#x60F3;&#x4E00;&#x60F3;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E24;&#x4E2A;&#x4EBA;&#x5982;&#x679C;&#x771F;&#x5FC3;&#x76F8;&#x7231;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x6EE1;&#x5934;&#x767D;&#x53D1;&#x7684;&#x8E52;&#x8DDA;&#x8001;&#x8005;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x7ED3;&#x5A5A;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x53EF;&#x5F53;&#x4E24;&#x4E2A;70&#x591A;&#x5C81;&#x7684;&#x8001;&#x4EBA;&#x5766;&#x8BDA;&#x76F8;&#x89C1;&#x65F6;&#xFF0C;&#x5F53;&#x963F;&#x91CC;&#x8428;&#x770B;&#x5230;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x5E72;&#x762A;&#x4E0B;&#x5782;&#x7684;&#x80F8;&#x90E8;&#x65F6;&#xFF0C;&#x5F53;&#x5404;&#x81EA;&#x770B;&#x5230;&#x5BF9;&#x65B9;&#x5145;&#x6EE1;&#x76B1;&#x7EB9;&#x548C;&#x8D58;&#x8089;&#x7684;&#x8EAB;&#x4F53;&#x65F6;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;50&#x591A;&#x5E74;&#x7684;&#x7B49;&#x5F85;&#x771F;&#x7684;&#x503C;&#x5417;&#xFF1F;&#x6216;&#x8BB8;&#x662F;&#x503C;&#x7684;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x4E24;&#x4E2A;&#x4EBA;&#x559C;&#x6B22;&#x7684;&#x90FD;&#x662F;&#x6709;&#x70B9;&#x5E7B;&#x60F3;&#x6210;&#x5206;&#x7684;&#x5BF9;&#x65B9;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x5411;&#x5F80;&#x6C38;&#x8FDC;&#x9760;&#x7CBE;&#x795E;&#x6170;&#x85C9;&#x5F7C;&#x6B64;&#x7684;&#x5E15;&#x62C9;&#x56FE;&#x4E4B;&#x604B;&#xFF0C;&#x4E5F;&#x4E0D;&#x6392;&#x65A5;&#x7537;&#x6B22;&#x5973;&#x7231;&#x7684;&#x8089;&#x4F53;&#x4E4B;&#x6B22;&#xFF0C;&#x53EF;&#x65E0;&#x8BBA;&#x54EA;&#x4E00;&#x79CD;&#x90FD;&#x5FC5;&#x987B;&#x5EFA;&#x7ACB;&#x5728;&#x771F;&#x5B9E;&#x7684;&#x73B0;&#x5B9E;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x865A;&#x5E7B;&#x7684;&#x7231;&#x6155;&#x8005;&#xFF0C;&#x4E00;&#x4E2A;&#x4F60;&#x5E76;&#x4E0D;&#x771F;&#x6B63;&#x4E86;&#x89E3;&#x7684;&#x4EBA;&#xFF0C;&#x5F53;&#x5E7B;&#x60F3;&#x88AB;&#x6253;&#x7834;&#x7684;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6216;&#x8BB8;&#x5C31;&#x662F;&#x7231;&#x60C5;&#x7834;&#x788E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x5BF9;&#x5F85;&#x611F;&#x60C5;&#x66F4;&#x614E;&#x91CD;&#x4E9B;&#xFF0C;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x4EBA;&#x7231;&#x4F60;&#xFF0C;&#x5B66;&#x4F1A;&#x81EA;&#x7231;&#x672A;&#x5C1D;&#x4E0D;&#x53EF;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x547D;&#x539F;&#x672C;&#x5C31;&#x77ED;&#x6682;&#xFF0C;&#x4F55;&#x82E6;&#x8981;&#x5C06;&#x8FD9;&#x751F;&#x547D;&#x6D6A;&#x8D39;&#x5728;&#x522B;&#x4EBA;&#x8EAB;&#x4E0A;&#xFF0C;&#x51B5;&#x4E14;&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x50CF;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x4E00;&#x6837;&#xFF0C;&#x5206;&#x4E0D;&#x6E05;&#x5230;&#x5E95;&#x662F;&#x7231;&#x8FD8;&#x662F;&#x5B64;&#x72EC;&#xFF0C;&#x4EBA;&#x5728;&#x7ECF;&#x5386;&#x67AF;&#x71E5;&#x548C;&#x4E4F;&#x5473;&#x4EE5;&#x540E;&#x662F;&#x4F1A;&#x53D8;&#x7684;&#xFF0C;&#x4F1A;&#x53D8;&#x5F97;&#x5BF9;&#x4E8B;&#x7269;&#x5145;&#x6EE1;&#x65B0;&#x9C9C;&#x611F;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x66FE;&#x7ECF;&#x4E0D;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECE;&#x67D0;&#x79CD;&#x89D2;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x963F;&#x91CC;&#x8428;&#x662F;&#x6210;&#x529F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x7528;&#x4E00;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x5F97;&#x5230;&#x4E86;&#x559C;&#x6B22;&#x7684;&#x5973;&#x4EBA;&#x3002;&#x53EF;&#x6211;&#x65F6;&#x5E38;&#x89C9;&#x5F97;&#x4EBA;&#x751F;&#x6709;&#x6BD4;&#x8FD9;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x5C0F;&#x65F6;&#x5019;&#x770B;&#x5230;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x4E70;&#x4E0D;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x6837;&#x505A;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x4E0D;&#x8981;&#x4E86;&#x6216;&#x8005;&#x662F;&#x7B49;&#x4EE5;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x518D;&#x4E70;&#x3002;&#x53EF;&#x4EBA;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5947;&#x602A;&#x7684;&#x52A8;&#x7269;&#xFF0C;&#x660E;&#x660E;&#x4EE5;&#x524D;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x559C;&#x6B22;&#xFF0C;&#x53EF;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x5929;&#x53D1;&#x73B0;&#x548B;&#x518D;&#x559C;&#x6B22;&#x4E0D;&#x8D77;&#x6765;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5;&#x5766;&#x7136;&#x63A5;&#x53D7;&#xFF0C;&#x552F;&#x72EC;&#x5728;&#x9762;&#x5BF9;&#x611F;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x5E38;&#x5E38;&#x65E0;&#x6CD5;&#x81EA;&#x62D4;&#x5462;&#xFF1F;&#x4F60;&#x5F53;&#x521D;&#x6709;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4EF6;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6216;&#x8BB8;&#x4F1A;&#x5F71;&#x54CD;&#x4F60;&#x5728;&#x672A;&#x6765;&#x7684;&#x4EBA;&#x751F;&#x8F68;&#x8FF9;&#xFF0C;&#x53EF;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x547D;&#x5B9E;&#x5728;&#x6CDB;&#x4E0D;&#x8D77;&#x591A;&#x5C11;&#x6D9F;&#x6F2A;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x4EBA;&#x751F;&#x4E0B;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED3;&#x5C40;&#x5C31;&#x65E9;&#x5DF2;&#x6CE8;&#x5B9A;&#xFF0C;&#x6211;&#x4EEC;&#x552F;&#x4E00;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x52AA;&#x529B;&#x53BB;&#x586B;&#x8865;&#x548C;&#x4E30;&#x5BCC;&#x8FD9;&#x4E94;&#x516D;&#x5341;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x6837;&#x8BF4;&#x6765;&#xFF0C;&#x4EBA;&#x751F;&#x5B9E;&#x5728;&#x662F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x975E;&#x505A;&#x4E0D;&#x53EF;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x90A3;&#x53EA;&#x6709;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x52AA;&#x529B;&#x5730;&#x6D3B;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x2003;&#x2003;&#x300A;Unnatural&#x300B;&#x91CC;&#x4E2D;&#x5802;&#x7CFB;&#x4E00;&#x76F4;&#x5BF9;&#x604B;&#x4EBA;&#x7684;&#x6B7B;&#x65E0;&#x6CD5;&#x91CA;&#x6000;&#xFF0C;&#x6574;&#x6574;&#x516B;&#x5E74;&#x65F6;&#x95F4;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x8C03;&#x67E5;&#x604B;&#x4EBA;&#x7684;&#x6B7B;&#x4EA1;&#x539F;&#x56E0;&#xFF0C;&#x76F4;&#x5230;&#x771F;&#x76F8;&#x88AB;&#x67E5;&#x660E;&#xFF0C;&#x5F97;&#x5230;&#x604B;&#x4EBA;&#x7236;&#x4EB2;&#x7684;&#x539F;&#x8C05;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x8BF4;&#xFF0C;&#x4EBA;&#x751F;&#x4E0D;&#x53EF;&#x4EE5;&#x6709;&#x6267;&#x5FF5;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x660E;&#x767D;&#xFF0C;&#x6267;&#x5FF5;&#x53EA;&#x4F1A;&#x8BA9;&#x4F60;&#x592A;&#x5173;&#x6CE8;&#x7ED3;&#x679C;&#x800C;&#x5FFD;&#x7565;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x547D;&#x662F;&#x9700;&#x8981;&#x4E00;&#x5929;&#x5929;&#x53BB;&#x5EA6;&#x8FC7;&#x7684;&#x3002;&#x5C31;&#x50CF;&#x963F;&#x91CC;&#x8428;&#x7EC8;&#x4E8E;&#x5F97;&#x5230;&#x4E86;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#xFF0C;&#x53EF;&#x4E24;&#x4E2A;70&#x591A;&#x5C81;&#x7684;&#x8001;&#x4EBA;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x6325;&#x970D;&#x5462;&#xFF1F;&#x6211;&#x5012;&#x60C5;&#x613F;&#x65E5;&#x5B50;&#x8FC7;&#x5F97;&#x7A0D;&#x5FAE;&#x6162;&#x4E00;&#x4E9B;&#xFF0C;&#x7528;&#x4E00;&#x8F88;&#x5B50;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x4E86;&#x89E3;&#x5BF9;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x6240;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x4E0D;&#x5C31;&#x662F;&#x88AB;&#x4EBA;&#x7406;&#x89E3;&#x548C;&#x8BA4;&#x540C;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x6C38;&#x8FDC;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x540C;&#x4F60;&#x4EA4;&#x6D41;&#x7075;&#x9B42;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x52AA;&#x529B;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x751F;&#x6D3B;&#xFF0C;&#x4EBA;&#x751F;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5FC5;&#x987B;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x6709;&#x4F60;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8D77;&#x98CE;&#x4E86;&#xFF0C;&#x5C31;&#x5F53;&#x52AA;&#x529B;&#x751F;&#x5B58;&#x3002;&#x6D3B;&#x7740;&#x4E0D;&#x597D;&#x5417;&#xFF1F;&#x6211;&#x5B9E;&#x5728;&#x4E0D;&#x613F;&#x610F;&#x518D;&#x770B;&#x5230;&#x7F57;&#x5BC6;&#x6B27;&#x4E0E;&#x6731;&#x4E3D;&#x53F6;&#x8FD9;&#x6837;&#x7684;&#x60B2;&#x5267;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x90FD;&#x66FE;&#x6B4C;&#x9882;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x53EF;&#x53EA;&#x8981;&#x6D3B;&#x7740;&#x5C31;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x673A;&#x4F1A;&#x554A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#x60F3;&#x60F3;&#x6211;&#x4EEC;&#x7236;&#x6BCD;&#x8FD9;&#x4E00;&#x4EE3;&#x4EBA;&#xFF0C;&#x51E0;&#x4E4E;&#x5728;&#x6BEB;&#x65E0;&#x51C6;&#x5907;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x88AB;&#x52A8;&#x5730;&#x6B65;&#x5165;&#x4E86;&#x5A5A;&#x59FB;&#x7684;&#x6BBF;&#x5802;&#x3002;&#x65F6;&#x9694;&#x591A;&#x5E74;&#x4EE5;&#x540E;&#xFF0C;&#x6216;&#x6D88;&#x878D;&#x5728;&#x67F4;&#x7C73;&#x6CB9;&#x76D0;&#x7684;&#x5E73;&#x6DE1;&#x91CC;&#xFF0C;&#x6216;&#x4EA4;&#x7EC7;&#x5728;&#x5B50;&#x5973;&#x4EB2;&#x60C5;&#x7684;&#x7F81;&#x7ECA;&#x4E2D;&#xFF0C;&#x6216;&#x7A7F;&#x884C;&#x5728;&#x6D41;&#x6C34;&#x5149;&#x9634;&#x7684;&#x5F97;&#x5931;&#x95F4;&#x2026;&#x2026;&#x76F4;&#x81F3;&#x7231;&#x60C5;&#x5F7B;&#x5E95;&#x6D88;&#x4EA1;&#x6700;&#x7EC8;&#x53D8;&#x6210;&#x4EB2;&#x60C5;&#xFF0C;&#x50CF;&#x4E00;&#x6EF4;&#x677E;&#x80F6;&#x6CB9;&#x6162;&#x6162;&#x53D8;&#x6210;&#x4E00;&#x9897;&#x7CBE;&#x7F8E;&#x7684;&#x7425;&#x73C0;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x5A5A;&#x59FB;&#x662F;&#x7231;&#x60C5;&#x7684;&#x575F;&#x5893;&#xFF0C;&#x751A;&#x81F3;&#x7ED3;&#x8FC7;&#x5A5A;&#x7684;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x5A5A;&#x59FB;&#x975E;&#x5E38;&#x65E0;&#x8DA3;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x7F57;&#x66FC;&#x8482;&#x514B;&#x662F;&#x5426;&#x4E00;&#x5B9A;&#x4F1A;&#x6D88;&#x4EA1;&#xFF1F;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5A5A;&#x59FB;&#x91CC;&#x6709;&#x6CA1;&#x6709;&#x7231;&#x60C5;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x56E0;&#x4E3A;&#x603B;&#x6709;&#x4E00;&#x5929;&#x5B83;&#x4F1A;&#x67AF;&#x7AED;&#xFF0C;&#x4EBA;&#x751F;&#x91CC;&#x5145;&#x6EE1;&#x592A;&#x591A;&#x65E0;&#x53EF;&#x5948;&#x4F55;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5355;&#x5355;&#x662F;&#x7231;&#x60C5;&#x8FD9;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x53EF;&#x4EE5;&#x5199;&#x6EE1;&#x6574;&#x4E2A;&#x5386;&#x53F2;&#xFF0C;&#x7231;&#x60C5;&#x91CC;&#x6709;&#x50CF;&#x7AE5;&#x8BDD;&#x4E00;&#x822C;&#x7F8E;&#x597D;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x540C;&#x6837;&#x6709;&#x50CF;&#x60B2;&#x5267;&#x4E00;&#x822C;&#x54C0;&#x4F24;&#x7684;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x4EE3;&#x72EC;&#x751F;&#x5B50;&#x5973;&#x4EEC;&#xFF0C;&#x5728;&#x63A5;&#x89E6;&#x5230;&#x66F4;&#x5E7F;&#x9614;&#x7684;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x540E;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x5F71;&#x54CD;&#x4E86;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x6D3B;&#x5F97;&#x592A;&#x660E;&#x767D;&#x4E86;&#x3002;&#x53EF;&#x5982;&#x679C;&#x8981;&#x8FD9;&#x6837;&#x7A00;&#x91CC;&#x7CCA;&#x6D82;&#x5730;&#x5EA6;&#x8FC7;&#x4F59;&#x751F;&#x4E2D;&#x7684;&#x4E94;&#x516D;&#x5341;&#x5E74;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7A81;&#x7136;&#x95F4;&#x53C8;&#x4E0D;&#x7518;&#x5FC3;&#x63A5;&#x53D7;&#x8FD9;&#x6B8B;&#x9177;&#x7684;&#x547D;&#x8FD0;&#x3002;&#x5F53;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x8981;&#x8FDC;&#x79BB;&#x7236;&#x6BCD;&#x751F;&#x6D3B;&#xFF0C;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x80FD;&#x529B;&#x80FD;&#x529B;&#x548C;&#x7CBE;&#x529B;&#x7167;&#x987E;&#x4ED6;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x60F3;&#x5230;&#x6211;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x548C;&#x4ED6;&#x4EEC;&#x4E00;&#x6837;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x5A5A;&#x59FB;&#x662F;&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4EBA;&#x966A;&#x4F60;&#x4E00;&#x8D77;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x72EC;&#x751F;&#x5B50;&#x5973;&#x4EEC;&#xFF0C;&#x65E9;&#x5C31;&#x4E60;&#x60EF;&#x4E86;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x751F;&#x6D3B;&#xFF0C;&#x751F;&#x547D;&#x91CC;&#x603B;&#x662F;&#x5145;&#x6EE1;&#x7740;&#x65E0;&#x5C3D;&#x7684;&#x53D8;&#x6545;&#xFF0C;&#x6216;&#x8BB8;&#x5979;&#x66FE;&#x7ECF;&#x7279;&#x522B;&#x7279;&#x522B;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x53EF;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x5929;&#x5979;&#x5C31;&#x4E0D;&#x518D;&#x559C;&#x6B22;&#x4F60;&#x4E86;&#xFF1B;&#x6216;&#x8BB8;&#x4F60;&#x4EEC;&#x66FE;&#x7ECF;&#x662F;&#x7279;&#x522B;&#x7279;&#x522B;&#x53CB;&#x597D;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x53EF;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x5929;&#x5BF9;&#x65B9;&#x5C31;&#x7A81;&#x7136;&#x79BB;&#x4F60;&#x8FDC;&#x53BB;&#xFF1B;&#x6216;&#x8BB8;&#x4F60;&#x4EEC;&#x671D;&#x5915;&#x76F8;&#x5904;&#x4EB2;&#x5BC6;&#x65E0;&#x95F4;&#xFF0C;&#x53EF;&#x5230;&#x6700;&#x540E;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x6839;&#x672C;&#x4E0D;&#x4E86;&#x89E3;&#x5F7C;&#x6B64;&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x4EBA;&#x660E;&#x660E;&#x90FD;&#x662F;&#x4F1A;&#x53D8;&#x7684;&#xFF0C;&#x53EF;&#x504F;&#x504F;&#x603B;&#x7231;&#x628A;&#x5E0C;&#x671B;&#x5BC4;&#x6258;&#x5728;&#x53D8;&#x5316;&#x7684;&#x4E8B;&#x7269;&#x4E0A;&#x9762;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5468;&#x56F4;&#x4E00;&#x5207;&#x90FD;&#x5728;&#x53D8;&#x5316;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x8FFD;&#x6C42;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x662F;&#x8D2A;&#x5FC3;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x8FFD;&#x6C42;&#x7684;&#x53EA;&#x6709;&#x7A33;&#x5B9A;&#xFF0C;&#x53EF;&#x96BE;&#x514D;&#x4F1A;&#x95EE;&#x4E00;&#x4E2A;&#x4E0D;&#x7406;&#x667A;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x7A33;&#x5B9A;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x7231;&#x5417;&#xFF1F;&#x8FD9;&#x6B63;&#x662F;&#x4E4C;&#x5C14;&#x6BD4;&#x8BFA;&#x548C;&#x8D39;&#x5C14;&#x7C73;&#x7EB3;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x611F;&#x60C5;&#x751F;&#x6D3B;&#x7559;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x8C1C;&#x9898;&#x3002;&#x5E74;&#x5C11;&#x65F6;&#x6216;&#x8BB8;&#x4F1A;&#x61A7;&#x61AC;&#x963F;&#x91CC;&#x8428;&#x8FD9;&#x6837;&#x56E0;&#x7231;&#x6210;&#x75F4;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x53EF;&#x6B63;&#x5982;&#x6751;&#x4E0A;&#x6625;&#x6811;&#x6240;&#x8BF4;&#xFF0C;&#x201C;&#x54EA;&#x91CC;&#x4F1A;&#x6709;&#x4EBA;&#x559C;&#x6B22;&#x5B64;&#x72EC;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x4E0D;&#x559C;&#x6B22;&#x5931;&#x671B;&#x7F62;&#x4E86;&#x201D;&#x3002;&#x5982;&#x679C;&#x7231;&#x60C5;&#x662F;&#x4E00;&#x573A;&#x970D;&#x4E71;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x6BCF;&#x4E2A;&#x751F;&#x75C5;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x80FD;&#x5C3D;&#x65E9;&#x5730;&#x4ECE;&#x8FD9;&#x573A;&#x75BE;&#x75C5;&#x4E2D;&#x6CBB;&#x6108;&#x3002;&#x201C;&#x8D77;&#x98CE;&#x4E86;&#xFF0C;&#x5F53;&#x52AA;&#x529B;&#x751F;&#x5B58;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x77F3;&#x539F;&#x91CC;&#x7F8E;&#x9970;&#x6F14;&#x7684;&#x4E09;&#x6A59;&#x8BF4;&#x8FC7;&#x7684;&#xFF0C;&#x201C;&#x6709;&#x65F6;&#x95F4;&#x7EDD;&#x671B;&#x8FD8;&#x4E0D;&#x5982;&#x53BB;&#x5403;&#x70B9;&#x597D;&#x5403;&#x7684;&#x5462;&#x201D;&#xFF0C;&#x6BD4;&#x8D77;&#x627E;&#x5230;&#x5FC3;&#x7231;&#x7684;&#x4EBA;&#xFF0C;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x7231;&#x81EA;&#x5DF1;&#x4E0D;&#x662F;&#x66F4;&#x91CD;&#x8981;&#x5417;&#xFF1F;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2941880815/">米花之味：永远相信美好的事情</a></li><li><a href="https://qinyuanpei.github.io/posts/2613006280/">一念执着，千山无阻</a></li><li><a href="https://qinyuanpei.github.io/posts/2462008667/">关于电影《暗杀》背后的故事和想法</a></li><li><a href="http://www.davidfnck.com/talkshow/no_surprise_in_the_end.html/">预告片好过正片的电影</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/3782208845/" rel="external">爱情像一场霍乱</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/3782208845/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/3782208845/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/影评/">影评</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/阅读/">阅读</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/马尔克斯/">马尔克斯</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3782208845/&title=《爱情像一场霍乱》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3782208845/&title=《爱情像一场霍乱》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3782208845/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《爱情像一场霍乱》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3782208845/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3782208845/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/2462008667/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">关于电影《暗杀》背后的故事和想法</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/815861661/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">使用Jexus实现ASP.NET在Linux平台下的部署</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/3782208845/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3782208845/&title=《爱情像一场霍乱》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3782208845/&title=《爱情像一场霍乱》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3782208845/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《爱情像一场霍乱》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3782208845/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3782208845/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/3782208845/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
