<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        行走在消逝中 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x4ECE;&amp;#x6628;&amp;#x5929;&amp;#x5230;&amp;#x4ECA;&amp;#x5929;&amp;#xFF0C;&amp;#x5173;&amp;#x4E8E;&amp;#x970D;&amp;#x91D1;&amp;#x901D;&amp;#x4E16;&amp;#x7684;&amp;#x6D88;&amp;#x606F;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x670B;&amp;#x53CB;&amp;#x5708">
<meta name="keywords" content="霍金,时间,请记住我">
<meta property="og:type" content="article">
<meta property="og:title" content="行走在消逝中">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2809571715/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x4ECE;&amp;#x6628;&amp;#x5929;&amp;#x5230;&amp;#x4ECA;&amp;#x5929;&amp;#xFF0C;&amp;#x5173;&amp;#x4E8E;&amp;#x970D;&amp;#x91D1;&amp;#x901D;&amp;#x4E16;&amp;#x7684;&amp;#x6D88;&amp;#x606F;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x670B;&amp;#x53CB;&amp;#x5708">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="行走在消逝中">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x4ECE;&amp;#x6628;&amp;#x5929;&amp;#x5230;&amp;#x4ECA;&amp;#x5929;&amp;#xFF0C;&amp;#x5173;&amp;#x4E8E;&amp;#x970D;&amp;#x91D1;&amp;#x901D;&amp;#x4E16;&amp;#x7684;&amp;#x6D88;&amp;#x606F;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x670B;&amp;#x53CB;&amp;#x5708">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

<link rel="stylesheet" href="/assets/css/APlayer.min.css" class="aplayer-style-marker">
<script src="/assets/js/APlayer.min.js" class="aplayer-script-marker"></script>
<script src="/assets/js/Meting.min.js" class="meting-script-marker"></script>
</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">行走在消逝中</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">行走在消逝中</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-03-15T21:29:47.000Z" itemprop="datePublished" class="page-time">
  2018-03-15
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-行走在消逝中" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">行走在消逝中</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-03-15 21:29:47" datetime="2018-03-15T21:29:47.000Z" itemprop="datePublished">2018-03-15</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        19 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <div id="aplayer-iROWGZYJ" class="aplayer aplayer-tag-marker meting-tag-marker" data-id="523845740" data-server="netease" data-type="song" data-mode="circulation" data-autoplay="true" data-mutex="false" data-listmaxheight="340px" data-preload="none" data-theme="#ad7a86"></div>
<p>&#x2003;&#x2003;&#x4ECE;&#x6628;&#x5929;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x5173;&#x4E8E;&#x970D;&#x91D1;&#x901D;&#x4E16;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x5237;&#x5C4F;&#x3002;&#x6628;&#x5929;&#x540C;&#x4E8B;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5FC3;&#x5E95;&#x5148;&#x662F;&#x4E00;&#x7247;&#x604D;&#x60DA;&#xFF0C;&#x800C;&#x540E;&#x4E60;&#x60EF;&#x6027;&#x5730;&#x6253;&#x5F00;&#x5FAE;&#x4FE1;&#xFF0C;&#x53D1;&#x73B0;&#x670B;&#x53CB;&#x5708;&#x548C;&#x516C;&#x4F17;&#x53F7;&#x91CC;&#x90FD;&#x5728;&#x8BA8;&#x8BBA;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x800C;&#x7B49;&#x5230;&#x6211;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C45;&#x7136;&#x542C;&#x5230;&#x4E34;&#x684C;&#x7684;&#x4E00;&#x540D;&#x7537;&#x751F;&#xFF0C;&#x5728;&#x5411;&#x540C;&#x4F34;&#x8BB2;&#x8FF0;&#x970D;&#x91D1;&#x8F90;&#x5C04;&#x7684;&#x7406;&#x8BBA;&#xFF0C;&#x582A;&#x79F0;&#x6211;&#x5728;&#x8FD9;&#x4E00;&#x5929;&#x6240;&#x89C1;&#x8FC7;&#x7684;&#x4E00;&#x80A1;&#x6E05;&#x6D41;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x7269;&#x7684;&#x7A81;&#x7136;&#x79BB;&#x53BB;&#xFF0C;&#x603B;&#x662F;&#x4F1A;&#x8BA9;&#x4EBA;&#x4EEC;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x4EA2;&#x594B;&#x8D77;&#x6765;&#xFF0C;&#x4EFF;&#x4F5B;&#x4E00;&#x573A;&#x96C6;&#x4F53;&#x7F05;&#x6000;&#x7684;&#x72C2;&#x6B22;&#x3002;&#x56DE;&#x987E;&#x6700;&#x8FD1;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x5DF2;&#x6545;&#x7684;&#x540D;&#x4EBA;&#xFF0C;&#x4F8B;&#x5982;&#x6768;&#x7EDB;&#x5148;&#x751F;&#x3001;&#x6768;&#x6D01;&#x5BFC;&#x6F14;&#x3001;&#x8BCD;&#x4F5C;&#x5BB6;&#x95EB;&#x8083;&#x3001;&#x4F5C;&#x5BB6;&#x9EC4;&#x6613;&#x7B49;&#x7B49;&#xFF0C;&#x6BCF;&#x6BCF;&#x63D0;&#x53CA;&#x4E0D;&#x7981;&#x4EE4;&#x4EBA;&#x4E00;&#x9635;&#x550F;&#x5618;&#xFF0C;&#x6B63;&#x6240;&#x8C13;&#x201C;&#x901D;&#x8005;&#x5DF2;&#x77E3;&#xFF0C;&#x751F;&#x8005;&#x5982;&#x65AF;&#x201D;&#x3002;&#x53EF;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x603B;&#x662F;&#x7B49;&#x5230;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x60F3;&#x8D77;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5370;&#x8C61;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x6709;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x662F;&#x5728;2011&#x5E74;&#xFF0C;&#x90A3;&#x65F6;&#x6211;&#x521A;&#x521A;&#x8003;&#x4E0A;&#x5927;&#x5B66;&#xFF0C;&#x6211;&#x53EA;&#x8BB0;&#x5F97;&#x90A3;&#x65F6;&#x7AD9;&#x5728;&#x592A;&#x9633;&#x5E95;&#x4E0B;&#x7684;&#x6211;&#xFF0C;&#x7A81;&#x7136;&#x5927;&#x58F0;&#x5730;&#x5411;&#x5468;&#x56F4;&#x4EBA;&#x5BA3;&#x5E03;&#x4E54;&#x5E03;&#x65AF;&#x901D;&#x4E16;&#x7684;&#x6D88;&#x606F;&#x3002;&#x6211;&#x6E05;&#x6670;&#x5730;&#x8BB0;&#x7740;&#x7236;&#x6BCD;&#x60CA;&#x6115;&#x7684;&#x8868;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x4EBA;&#x751F;&#x5B57;&#x5178;&#x91CC;&#xFF0C;&#x5168;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x4E54;&#x5E03;&#x65AF;&#x662F;&#x8C01;&#xFF0C;&#x53EF;&#x5728;19&#x5C81;&#x7684;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x90A3;&#x5C31;&#x50CF;&#x662F;&#x67D0;&#x79CD;&#x91CD;&#x5927;&#x7684;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#xFF0C;&#x81F3;&#x5C11;&#x4ECE;&#x4ECA;&#x5929;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5728;&#x6211;&#x51FA;&#x751F;&#x7684;1992&#x5E74;&#x91CC;&#xFF0C;&#x82CF;&#x8054;&#x6B63;&#x5F0F;&#x89E3;&#x4F53;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x547D;&#x603B;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x548C;&#x67D0;&#x79CD;&#x5386;&#x53F2;&#x8FDB;&#x7A0B;&#x5173;&#x8054;&#x8D77;&#x6765;&#x3002;&#x56E0;&#x4E3A;&#x4ECE;&#x4E2D;&#x5B66;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x59CB;&#x4F4F;&#x6821;&#xFF0C;&#x5370;&#x8C61;&#x4E2D;&#x6BCF;&#x6B21;&#x56DE;&#x5BB6;&#x90FD;&#x65E2;&#x964C;&#x751F;&#x800C;&#x719F;&#x6089;&#xFF0C;&#x5076;&#x5C14;&#x4F1A;&#x542C;&#x5230;&#x5988;&#x5988;&#x8BB2;&#xFF0C;&#x5BB6;&#x65CF;&#x91CC;&#x67D0;&#x4E00;&#x4F4D;&#x957F;&#x8F88;&#x7A81;&#x7136;&#x8FC7;&#x4E16;&#x3002;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x542C;&#x5F97;&#x591A;&#x4E86;&#xFF0C;&#x5C45;&#x7136;&#x4E0D;&#x4F1A;&#x518D;&#x89C9;&#x5F97;&#x60CA;&#x8BB6;&#x3002;&#x53EF;&#x662F;&#x60F3;&#x8D77;&#x8FD9;&#x4E9B;&#x4EBA;&#x91CC;&#xFF0C;&#x6709;&#x4EBA;&#x66FE;&#x7ECF;&#x51FA;&#x8FC7;&#x6570;&#x5B66;&#x9898;&#x8003;&#x95EE;&#x8FC7;&#x6211;&#xFF0C;&#x6709;&#x4EBA;&#x4F60;&#x66FE;&#x7ECF;&#x5E2E;&#x8FC7;&#x4ED6;&#x4EEC;&#x505A;&#x8FC7;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x2026;&#x2026;&#x5239;&#x90A3;&#x95F4;&#x89C9;&#x5BDF;&#x5230;&#x65F6;&#x5149;&#x7684;&#x6B8B;&#x5FCD;&#x2014;&#x2014;&#x6240;&#x8C13;&#x7684;&#x7269;&#x662F;&#x4EBA;&#x975E;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x4F60;&#x8FD8;&#x5728;&#x6B64;&#x5904;&#xFF0C;&#x800C;&#x522B;&#x4EBA;&#x65E9;&#x5DF2;&#x6697;&#x81EA;&#x8D70;&#x8FDC;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5766;&#x767D;&#x5730;&#x8BB2;&#xFF0C;&#x6211;&#x5BF9;&#x970D;&#x91D1;&#x7684;&#x8BA4;&#x77E5;&#x6C38;&#x8FDC;&#x90FD;&#x505C;&#x7559;&#x5728;&#x300A;&#x65F6;&#x95F4;&#x7B80;&#x53F2;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x4E0A;&#xFF0C;&#x8BB0;&#x5F97;16&#x5E74;&#x4E70;&#x4E86;Kindle&#x4EE5;&#x540E;&#xFF0C;&#x7684;&#x786E;&#x4E70;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#x6765;&#x8BFB;&#xFF0C;&#x5927;&#x6982;&#x8BFB;&#x4E86;&#x5341;&#x6765;&#x9875;&#x4FBF;&#x8BFB;&#x4E0D;&#x4E0B;&#x53BB;&#x3002;&#x970D;&#x91D1;&#x548C;&#x6D77;&#x4F26;&#xB7;&#x51EF;&#x52D2;&#x4E00;&#x6837;&#xFF0C;&#x662F;&#x88AB;&#x6211;&#x5212;&#x5B9A;&#x5230;&#x8EAB;&#x6B8B;&#x5FD7;&#x575A;&#x8FD9;&#x7C7B;&#x5199;&#x4F5C;&#x7D20;&#x6750;&#x7684;&#x8303;&#x7574;&#x91CC;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x8BED;&#x6587;&#x8001;&#x5E08;&#x8BA9;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x6BCF;&#x5E74;&#x7684;&#x611F;&#x52A8;&#x4E2D;&#x56FD;&#x4EBA;&#x7269;&#x8BC4;&#x9009;&#xFF0C;&#x5176;&#x521D;&#x8877;&#x4FBF;&#x662F;&#x4E3A;&#x4E86;&#x4E30;&#x5BCC;&#x6211;&#x4EEC;&#x7684;&#x5199;&#x4F5C;&#x7D20;&#x6750;&#x3002;&#x56DE;&#x60F3;&#x90A3;&#x4E9B;&#x5E74;&#x91CC;&#xFF0C;&#x906D;&#x53D7;&#x65E0;&#x6570;&#x6B21;&#x5BAB;&#x5211;&#x800C;&#x5FCD;&#x8FB1;&#x8D1F;&#x91CD;&#x7684;&#x53F8;&#x9A6C;&#x8FC1;&#x3001;&#x5B9E;&#x9A8C;&#x4E86;3000&#x591A;&#x79CD;&#x6750;&#x6599;&#x7EC8;&#x4E8E;&#x5236;&#x9020;&#x51FA;&#x706F;&#x6CE1;&#x7684;&#x7231;&#x8FEA;&#x751F;&#x3001;&#x62AB;&#x53D1;&#x884C;&#x541F;&#x6CEA;&#x6D12;&#x6C68;&#x7F57;&#x800C;&#x5FC3;&#x7CFB;&#x5BB6;&#x56FD;&#x7684;&#x5C48;&#x539F;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x5728;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#x9891;&#x9891;&#x88AB;&#x6D88;&#x8D39;&#x7684;&#x5386;&#x53F2;&#x4EBA;&#x7269;&#xFF0C;&#x5728;&#x4ECA;&#x5929;&#x770B;&#x6765;&#x662F;&#x5426;&#x6709;&#x4E9B;&#x76F8;&#x4F3C;&#x5462;&#xFF1F;&#x636E;&#x8BF4;&#x77E5;&#x4E4E;&#x4E0A;&#x4E00;&#x5929;&#x5185;&#x4EA7;&#x751F;&#x4E86;700&#x591A;&#x4E2A;&#x970D;&#x91D1;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x66FE;&#x7ECF;&#x6D3B;&#x5728;&#x6211;&#x4EEC;&#x4F5C;&#x6587;&#x91CC;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x5728;&#x4ED6;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4EE5;&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x70ED;&#x8BAE;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x597D;&#x50CF;&#x4ED6;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x5B58;&#x5728;&#x8FC7;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EF6;&#x53EF;&#x6015;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x8BA4;&#x4E3A;&#x5C0A;&#x91CD;&#x4E00;&#x540D;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x7684;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x662F;&#x76F8;&#x4FE1;&#x79D1;&#x5B66;&#x3002;&#x4F34;&#x968F;&#x7740;&#x970D;&#x91D1;&#x53D8;&#x6210;&#x4EBA;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x70ED;&#x70B9;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0A;&#x5F00;&#x59CB;&#x6D41;&#x4F20;&#x4F3D;&#x5229;&#x7565;&#x3001;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x548C;&#x970D;&#x91D1;&#x4E09;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x5DE7;&#x5408;&#x7684;&#x65F6;&#x95F4;&#x7EBF;&#x95EE;&#x9898;&#xFF0C;&#x4EFF;&#x4F5B;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x7684;&#x4E0D;&#x662F;&#x4E00;&#x540D;&#x4E3A;&#x5B87;&#x5B99;&#x7269;&#x7406;&#x5B66;&#x505A;&#x51FA;&#x5DE8;&#x5927;&#x8D21;&#x732E;&#x7684;&#x79D1;&#x5B66;&#x5BB6;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x795E;&#x5316;&#x7684;&#x201C;&#x6D3B;&#x4F5B;&#x201D;&#x8F6C;&#x4E16;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x4EBA;&#x7C7B;&#x90FD;&#x662F;&#x4E00;&#x7FA4;&#x620F;&#x7CBE;&#x3002;&#x96C6;&#x4F53;&#x7F05;&#x6000;&#x4E00;&#x4E2A;&#x4F1F;&#x4EBA;&#x5427;&#xFF0C;&#x7ACB;&#x9A6C;&#x6709;&#x4EBA;&#x8DF3;&#x51FA;&#x6765;&#x8BF4;&#xFF0C;&#x4F1F;&#x4EBA;&#x7684;&#x8457;&#x4F5C;&#x90FD;&#x6CA1;&#x8BFB;&#x8FC7;&#x4E00;&#x672C;&#xFF0C;&#x8E6D;&#x4EC0;&#x4E48;&#x70ED;&#x5EA6;&#xFF1B;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x5173;&#x6CE8;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5427;&#xFF0C;&#x7ACB;&#x9A6C;&#x6709;&#x4EBA;&#x8DF3;&#x51FA;&#x8BF4;&#xFF0C;&#x201C;&#x5C06;&#x519B;&#x575F;&#x524D;&#x65E0;&#x4EBA;&#x95EE;&#xFF0C;&#x620F;&#x5B50;&#x5BB6;&#x4E8B;&#x5929;&#x4E0B;&#x77E5;&#x201D;&#xFF0C;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x4EBA;&#x5173;&#x5FC3;&#x79D1;&#x6280;&#x5DE5;&#x4F5C;&#x8005;&#x3002;&#x53EF;&#x4F60;&#x770B;&#x5173;&#x6CE8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x5173;&#x6CE8;&#x4EC0;&#x4E48;&#xFF0C;&#x8B6C;&#x5982;&#x5B9A;&#x8981;&#x7ED9;&#x7269;&#x7406;&#x5B66;&#x9886;&#x57DF;&#x5185;&#x7684;&#x4E13;&#x5BB6;&#x5B66;&#x8005;&#x4EEC;&#x6392;&#x51FA;&#x4E2A;&#x4F18;&#x52A3;&#x6765;&#xFF0C;&#x5B9A;&#x8981;&#x5C06;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x79C1;&#x4E8B;&#x6DF1;&#x6316;&#x51FA;&#x6765;&#x54C1;&#x5224;&#x4EBA;&#x54C1;&#x3002;&#x6768;&#x7EDB;&#x5148;&#x751F;&#x8BF4;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x66FE;&#x5982;&#x6B64;&#x6E34;&#x671B;&#x547D;&#x8FD0;&#x7684;&#x6CE2;&#x6F9C;&#xFF0C;&#x5230;&#x6700;&#x540E;&#x624D;&#x53D1;&#x73B0;&#xFF1A;&#x4EBA;&#x751F;&#x6700;&#x66FC;&#x5999;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x7ADF;&#x662F;&#x5185;&#x5FC3;&#x7684;&#x6DE1;&#x5B9A;&#x4E0E;&#x4ECE;&#x5BB9;&#x3002;&#x6211;&#x4EEC;&#x66FE;&#x5982;&#x6B64;&#x671F;&#x76FC;&#x5916;&#x754C;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x5230;&#x6700;&#x540E;&#x624D;&#x77E5;&#x9053;&#xFF1A;&#x4E16;&#x754C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#xFF0C;&#x4E0E;&#x4ED6;&#x4EBA;&#x6BEB;&#x65E0;&#x5173;&#x7CFB;&#x3002;&#x201C;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x6D45;&#x663E;&#x4E0D;&#x8FC7;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x53EF;&#x60DC;&#x60F3;&#x8981;&#x505A;&#x5230;&#x5B9E;&#x5728;&#x592A;&#x96BE;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4E00;&#x76F4;&#x76F8;&#x4FE1;&#x201C;&#x4EBA;&#x751F;&#x800C;&#x5B64;&#x72EC;&#x201D;&#xFF0C;&#x9664;&#x4E86;&#x4EB2;&#x60C5;&#x8840;&#x7F18;&#x4EE5;&#x5916;&#xFF0C;&#x4EBA;&#x4E0E;&#x4EBA;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x6709;&#x65F6;&#x8106;&#x5F31;&#x5F97;&#x50CF;&#x4E00;&#x53EA;&#x6302;&#x5728;&#x98CE;&#x7B5D;&#x4E0A;&#x7684;&#x7EBF;&#xFF0C;&#x968F;&#x65F6;&#x90FD;&#x4F1A;&#x6709;&#x65AD;&#x5F00;&#x7684;&#x5371;&#x9669;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5C31;&#x6E10;&#x6E10;&#x8D70;&#x8FDC;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8DEF;&#x8E1F;&#x8E70;&#x800C;&#x96C1;&#x884C;&#xFF0C;&#x5728;&#x76F8;&#x9047;&#x4E2D;&#x5931;&#x6563;&#xFF0C;&#x5728;&#x5931;&#x6563;&#x4E2D;&#x76F8;&#x9047;&#xFF0C;&#x53EF;&#x5F53;&#x4E24;&#x4E2A;&#x4EBA;&#x518D;&#x6B21;&#x76F8;&#x9047;&#x65F6;&#xFF0C;&#x5DF2;&#x7136;&#x4E0D;&#x662F;&#x5F53;&#x521D;&#x7684;&#x5F7C;&#x6B64;&#x3002;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x4F1A;&#x7EF4;&#x62A4;&#x4EB2;&#x5BC6;&#x5173;&#x7CFB;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x8D70;&#x5F97;&#x592A;&#x5FEB;&#xFF0C;&#x8FD8;&#x662F;&#x522B;&#x4EBA;&#x8D70;&#x5F97;&#x592A;&#x5FEB;&#xFF0C;&#x65E0;&#x6570;&#x7684;&#x4EBA;&#x5728;&#x6211;&#x8FD9;&#x91CC;&#x51FA;&#x73B0;&#x7136;&#x540E;&#x79BB;&#x5F00;&#xFF0C;&#x4EFF;&#x4F5B;&#x662F;&#x5728;&#x8FFD;&#x9010;&#x98CE;&#x4E2D;&#x7684;&#x82B1;&#x74E3;&#xFF0C;&#x7B49;&#x5230;&#x98CE;&#x505C;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x82B1;&#x74E3;&#x5DF2;&#x4E0D;&#x89C1;&#xFF0C;&#x82B1;&#x9999;&#x5DF2;&#x98D8;&#x8FDC;&#x3002;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x7A81;&#x7136;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x60F3;&#x628A;&#x522B;&#x4EBA;&#x7559;&#x5728;&#x6211;&#x7684;&#x751F;&#x547D;&#x91CC;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x81EA;&#x79C1;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6E38;&#x620F;&#x5236;&#x4F5C;&#x4EBA;&#x9648;&#x661F;&#x6C49;&#x6709;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#x53EB;&#x505A;&#x300A;&#x98CE;&#x4E4B;&#x65C5;&#x4EBA;&#x300B;&#xFF0C;&#x5728;&#x5E7F;&#x9614;&#x65E0;&#x57A0;&#x7684;&#x6C99;&#x6F20;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6700;&#x591A;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x73A9;&#x5BB6;&#x51FA;&#x73B0;&#xFF0C;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x5730;&#x70B9;&#x968F;&#x673A;&#xFF0C;&#x5BF9;&#x65B9;&#x53EF;&#x80FD;&#x6765;&#x81EA;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x56FD;&#x5BB6;&#xFF0C;&#x4F60;&#x5BF9;&#x4ED6;/&#x5979;&#x7684;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x552F;&#x4E00;&#x7684;&#x4E92;&#x52A8;&#x65B9;&#x5F0F;&#x662F;&#x201C;&#x5171;&#x9E23;&#x201D;&#x3002;&#x4E24;&#x4E2A;&#x9760;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x201C;&#x5171;&#x9E23;&#x201D;&#x6765;&#x4E3A;&#x5BF9;&#x65B9;&#x7684;&#x56F4;&#x5DFE;&#x8865;&#x5145;&#x80FD;&#x91CF;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x4E00;&#x65E6;&#x4E24;&#x4E2A;&#x4EBA;&#x8D70;&#x5931;&#xFF0C;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x518D;&#x76F8;&#x9047;&#xFF0C;&#x8FD9;&#x662F;&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x8D85;&#x73B0;&#x5B9E;&#x610F;&#x4E49;&#x7684;&#x4E00;&#x4E2A;&#x4F53;&#x73B0;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x4ECE;&#x65E0;&#x8BDD;&#x4E0D;&#x8BF4;&#x5230;&#x65E0;&#x8BDD;&#x53EF;&#x8BF4;&#x9700;&#x8981;&#x591A;&#x4E45;&#xFF1B;&#x6211;&#x53EA;&#x77E5;&#x9053;&#xFF0C;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x79BB;&#x5F00;&#x7684;&#x4EBA;&#xFF0C;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x4E0D;&#x52A8;&#x58F0;&#x8272;&#x7684;&#x3002;&#x81EA;&#x90A3;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5BF9;&#x65B9;&#x4F1A;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x4F1A;&#x53D8;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x505A;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x627F;&#x8BA4;&#xFF0C;&#x522B;&#x4EBA;&#x7684;&#x4E16;&#x754C;&#x548C;&#x4F60;&#x6BEB;&#x65E0;&#x5173;&#x8054;&#xFF0C;&#x53EF;&#x4F60;&#x7EC8;&#x7A76;&#x4E0D;&#x613F;&#x610F;&#x8BA9;&#x81EA;&#x5DF1;&#x6210;&#x4E3A;&#x5B64;&#x5C9B;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4F1A;&#x611F;&#x5230;&#x75DB;&#x82E6;&#x548C;&#x6323;&#x624E;&#xFF0C;&#x4F1A;&#x60F3;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x80FD;&#x6C38;&#x8FDC;&#x966A;&#x4F34;&#x4F60;&#x7684;&#x4EBA;&#x3002;&#x53EF;&#x751F;&#x8001;&#x75C5;&#x6B7B;&#x662F;&#x4EBA;&#x751F;&#x91CC;&#x65E0;&#x53EF;&#x907F;&#x514D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x7EC8;&#x5176;&#x4E00;&#x751F;&#x6240;&#x5BFB;&#x627E;&#x7684;&#x7075;&#x9B42;&#x4F34;&#x4FA3;&#xFF0C;&#x662F;&#x5426;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x966A;&#x4F34;&#x5F7C;&#x6B64;&#x5230;&#x751F;&#x547D;&#x5C3D;&#x5934;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5207;&#x6CE8;&#x5B9A;&#x90FD;&#x8981;&#x5931;&#x53BB;&#xFF0C;&#x6211;&#x5B81;&#x613F;&#x4E00;&#x76F4;&#x8FD9;&#x6837;&#x4E0B;&#x53BB;&#xFF0C;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x628A;&#x751F;&#x80B2;&#x770B;&#x505A;&#x662F;&#x6211;&#x751F;&#x547D;&#x7684;&#x4E00;&#x79CD;&#x5EF6;&#x7EED;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x547D;&#x90FD;&#x6CE8;&#x5B9A;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x60F3;&#x5F53;&#x7136;&#x5730;&#x8BA4;&#x4E3A;&#xFF0C;&#x8840;&#x7F18;&#x5173;&#x7CFB;&#x4F1A;&#x66FF;&#x4F60;&#x7EE7;&#x627F;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x3002;&#x4ECE;&#x4F60;&#x6B7B;&#x4EA1;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x8D77;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x53D8;&#x6210;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4EBA;&#x7684;&#x4E00;&#x751F;&#x4F1A;&#x6B7B;&#x4EA1;&#x4E09;&#x6B21;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x662F;&#x533B;&#x751F;&#x5BA3;&#x5E03;&#x4F60;&#x7684;&#x6B7B;&#x4EA1;&#xFF0C;&#x8FD9;&#x662F;&#x8089;&#x4F53;&#x4E0A;&#x7684;&#x6B7B;&#x4EA1;&#xFF1B;&#x7B2C;&#x4E8C;&#x6B21;&#x662F;&#x4EBA;&#x4EEC;&#x6765;&#x53C2;&#x52A0;&#x4F60;&#x7684;&#x846C;&#x793C;&#xFF0C;&#x8FD9;&#x662F;&#x793E;&#x4F1A;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x6B7B;&#x4EA1;&#xFF1B;&#x7B2C;&#x4E09;&#x6B21;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6CA1;&#x6709;&#x4EBA;&#x518D;&#x8BB0;&#x5F97;&#x4F60;&#xFF0C;&#x8FD9;&#x662F;&#x54F2;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x6B7B;&#x4EA1;&#x3002;&#x6216;&#x8BB8;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x518D;&#x65E0;&#x970D;&#x91D1;&#xFF0C;&#x53EF;&#x4ED6;&#x7684;&#x601D;&#x60F3;&#x548C;&#x8457;&#x4F5C;&#x4E00;&#x76F4;&#x5C31;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x65F6;&#x95F4;&#x4F1A;&#x8BB0;&#x5F55;&#x7740;&#x4EBA;&#x7C7B;&#x7684;&#x8FC7;&#x53BB;&#x548C;&#x672A;&#x6765;&#xFF0C;&#x800C;&#x4ED6;&#x662F;&#x642D;&#x4E58;&#x65F6;&#x5149;&#x5217;&#x8F66;&#x6EE1;&#x4E16;&#x754C;&#x65C5;&#x884C;&#x7684;&#x81EA;&#x7531;&#x7075;&#x9B42;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x4E0D;&#x7ED3;&#x5A5A;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x751F;&#x5B69;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4F60;&#x751F;&#x800C;&#x4E3A;&#x4EBA;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4E16;&#x4FD7;&#x7684;&#x529B;&#x91CF;&#x662F;&#x5982;&#x6B64;&#x7684;&#x5F3A;&#x5927;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x4EEC;&#x90FD;&#x4EE5;&#x4E3A;&#xFF0C;&#x4EBA;&#x751F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8DF3;&#x4E00;&#x8DF3;&#x6E38;&#x620F;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5E74;&#x9F84;&#x5C31;&#x5E94;&#x8BE5;&#x8DF3;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6211;&#x7684;&#x4EBA;&#x751F;&#x76EE;&#x6807;&#x91CC;&#x6CA1;&#x6709;&#x7ED3;&#x5A5A;&#x751F;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x6CE8;&#x5B9A;&#x7559;&#x4E0D;&#x4E0B;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x6CE8;&#x5B9A;&#x6C38;&#x8FDC;&#x8981;&#x88AB;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6240;&#x9057;&#x5FD8;&#xFF0C;&#x6211;&#x5B81;&#x613F;&#x5728;&#x6211;&#x8FD8;&#x6D3B;&#x7740;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x52AA;&#x529B;&#x53BB;&#x5199;&#x5B57;&#x53BB;&#x53D1;&#x51FA;&#x58F0;&#x97F3;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x8FD9;&#x7A7A;&#x8361;&#x8361;&#x7684;&#x5B87;&#x5B99;&#x91CC;&#x542C;&#x4E0D;&#x5230;&#x56DE;&#x58F0;&#xFF0C;&#x53EF;&#x58F0;&#x97F3;&#x4E0D;&#x662F;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x4F20;&#x64AD;&#x7740;&#x5417;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x60F3;&#x60F3;&#x4EBA;&#x751F;&#x96BE;&#x514D;&#x4F1A;&#x89C9;&#x5F97;&#x5931;&#x671B;&#x3002;&#x6211;&#x4EEC;&#x660E;&#x660E;&#x77E5;&#x9053;&#x4E16;&#x754C;&#x662F;&#x81EA;&#x5DF1;&#xFF0C;&#x548C;&#x4ED6;&#x4EBA;&#x6BEB;&#x65E0;&#x5173;&#x8054;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x8FD8;&#x5728;&#x52AA;&#x529B;&#x5730;&#x548C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x53D1;&#x751F;&#x7740;&#x5173;&#x8054;&#xFF1B;&#x6211;&#x4EEC;&#x660E;&#x660E;&#x4E0D;&#x613F;&#x610F;&#x8BA9;&#x522B;&#x4EBA;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x8868;&#x8FBE;&#x6B32;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x8870;&#x51CF;&#x8FC7;&#x3002;&#x4ECE;&#x954C;&#x523B;&#x5728;&#x9F9F;&#x58F3;&#x4E0A;&#x7532;&#x9AA8;&#x6587;&#x5230;&#x4EE5;&#x4E1D;&#x5E1B;&#x4F5C;&#x4E3A;&#x4E66;&#x5199;&#x6750;&#x6599;&#xFF0C;&#x518D;&#x5230;&#x9020;&#x7EB8;&#x672F;&#x7684;&#x4EA7;&#x751F;&#xFF0C;&#x518D;&#x5230;&#x4ECA;&#x5929;&#x7684;&#x5404;&#x79CD;&#x82AF;&#x7247;&#xFF0C;&#x751A;&#x81F3;&#x5185;&#x5BB9;&#x7684;&#x5F62;&#x5F0F;&#x4ECE;&#x6587;&#x672C;&#x6F14;&#x53D8;&#x4E3A;&#x56FE;&#x7247;&#x518D;&#x6F14;&#x53D8;&#x4E3A;&#x89C6;&#x9891;&#x2026;&#x2026;&#x53EF;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x5806;&#x201C;&#x4EA1;&#x7075;&#x201D;&#xFF0C;&#x4ECE;&#x524D;QQ&#x597D;&#x53CB;&#x5217;&#x8868;&#x4E00;&#x7247;&#x9690;&#x8EAB;&#xFF0C;&#x5982;&#x4ECA;&#x670B;&#x53CB;&#x5708;&#x5269;&#x4E0B;&#x4E00;&#x6761;&#x6A2A;&#x7EBF;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x522B;&#x4EBA;&#x4E0D;&#x518D;&#x60F3;&#x8D77;&#x4F60;&#xFF0C;&#x7B49;&#x4F60;&#x771F;&#x6B63;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x7A81;&#x7136;&#x95F4;&#x88AB;&#x60F3;&#x8D77;&#xFF0C;&#x6211;&#x4F1A;&#x5F88;&#x5FC3;&#x75BC;&#x4E00;&#x6761;&#x9C7C;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x6761;&#x9C7C;&#x7684;&#x8BB0;&#x5FC6;&#x53EA;&#x6709;8&#x79D2;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5982;&#x679C;&#x4E0B;&#x4E00;&#x523B;&#x5931;&#x53BB;&#x8BB0;&#x5FC6;&#x7684;&#xFF0C;&#x662F;&#x4F60;&#x548C;&#x6211;&#x8FD9;&#x822C;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x50CF;&#x970D;&#x91D1;&#x4E00;&#x6837;&#xFF0C;&#x88AB;&#x5927;&#x5BB6;&#x96C6;&#x4F53;&#x7F05;&#x6000;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x88AB;&#x90A3;&#x4E00;&#x4E2A;&#x4EBA;&#x8BB0;&#x7740;&#xFF0C;&#x8BB0;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x5462;&#xFF1F;&#x5C31;&#x50CF;&#x6211;&#x603B;&#x548C;&#x670B;&#x53CB;&#x4EEC;&#x8BF4;&#xFF0C;&#x56DE;&#x5BB6;&#x4EE5;&#x540E;&#x627E;&#x65F6;&#x95F4;&#x76F8;&#x805A;&#xFF0C;&#x53EF;&#x5728;&#x5BB6;&#x65F6;&#x4F1A;&#x89C9;&#x5F97;&#x5BB6;&#x4EBA;&#x6700;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x5728;&#x67D0;&#x4E00;&#x77AC;&#x95F4;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x65F6;&#x95F4;&#xFF1B;&#x5C31;&#x50CF;&#x6211;&#x603B;&#x8BA1;&#x5212;&#x7740;&#x627E;&#x673A;&#x4F1A;&#x53BB;&#x770B;&#x671B;&#x8BED;&#x6587;&#x8001;&#x5E08;&#xFF0C;&#x53EF;&#x548C;&#x670B;&#x53CB;&#x7EA6;&#x4E0D;&#x5230;&#x4E00;&#x8D77;&#x65F6;&#x4FBF;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x2026;&#x2026;&#x6211;&#x7A81;&#x7136;&#x95F4;&#x60F3;&#x5230;&#xFF0C;&#x9AD8;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x5802;&#x8BED;&#x6587;&#x8BFE;&#x4E0A;&#xFF0C;&#x8001;&#x5E08;&#x5B89;&#x6392;&#x5927;&#x5BB6;&#x5199;&#x4E00;&#x7BC7;&#x4F5C;&#x6587;&#xFF0C;&#x9898;&#x76EE;&#x597D;&#x50CF;&#x53EB;&#x505A;&#x300A;&#x56DE;&#x9996;&#x5411;&#x6765;&#x300B;&#x4EA6;&#x6216;&#x8005;&#x662F;&#x300A;&#x884C;&#x8D70;&#x5728;&#x6D88;&#x901D;&#x4E2D;&#x300B;&#xFF0C;&#x90A3;&#x65F6;&#x6211;&#x7684;&#x4F5C;&#x6587;&#x6CA1;&#x6709;&#x5199;&#x5B8C;&#xFF0C;&#x53CD;&#x800C;&#x88AB;&#x8001;&#x5E08;&#x53EB;&#x8D77;&#x6765;&#x5F53;&#x4F17;&#x6717;&#x8BFB;&#xFF0C;&#x6211;&#x8BF4;&#x201C;&#x56DE;&#x9996;&#x5411;&#x6765;&#x8427;&#x745F;&#x5904;&#xFF0C;&#x4E5F;&#x65E0;&#x98CE;&#x96E8;&#x4E5F;&#x65E0;&#x6674;&#x201D;&#xFF0C;&#x8BB0;&#x5FC6;&#x660E;&#x660E;&#x662F;&#x6709;&#x7684;&#xFF0C;&#x53EF;&#x6211;&#x7A81;&#x7136;&#x53EB;&#x4E0D;&#x51FA;&#x6765;&#x6709;&#x4E9B;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x6E05;&#x6668;&#x60CA;&#x9192;&#xFF0C;&#x68A6;&#x5230;&#x8FC7;&#x5F80;&#x7684;&#x67D0;&#x4E00;&#x5929;&#x8003;&#x8BD5;&#x8FDF;&#x5230;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5FEB;&#x8981;&#x4EA4;&#x5377;&#x53D1;&#x73B0;&#x4F5C;&#x6587;&#x6CA1;&#x6709;&#x5199;&#x2026;&#x2026;&#x6211;&#x7A0D;&#x7A0D;&#x4E00;&#x5B9A;&#x795E;&#xFF0C;&#x8003;&#x8BD5;&#x90A3;&#x597D;&#x50CF;&#x662F;&#x5F88;&#x591A;&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x5427;&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x6211;&#x5176;&#x5B9E;&#x5F88;&#x60F3;&#x7559;&#x4E0B;&#x6765;&#x966A;&#x4F60;&#x6216;&#x8005;&#x966A;Ta&#x5440;&#xFF0C;&#x53EF;&#x65F6;&#x5149;&#x5217;&#x8F66;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x7559;&#x7ED9;&#x6211;&#x601D;&#x8003;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x8D70;&#x5F97;&#x5FEB;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F60;&#x8D70;&#x5F97;&#x5FEB;&#xFF0C;&#x50CF;&#x65E0;&#x6CD5;&#x9003;&#x79BB;&#x9ED1;&#x6D1E;&#x7684;&#x5149;&#x4E00;&#x6837;&#xFF0C;&#x62FC;&#x547D;&#x5730;&#x5F80;&#x524D;&#x8D70;&#x5F80;&#x524D;&#x8D70;&#x3002;&#x5728;&#x5E7F;&#x9614;&#x65E0;&#x57A0;&#x7684;&#x5B87;&#x5B99;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x751F;&#x6D3B;&#x5728;&#x5F7C;&#x6B64;&#x5E73;&#x884C;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x6709;&#x65F6;&#x770B;&#x5F97;&#x89C1;&#x5F7C;&#x6B64;&#xFF0C;&#x6709;&#x65F6;&#x770B;&#x4E0D;&#x89C1;&#x5F7C;&#x6B64;&#xFF0C;&#x9760;&#x7740;&#x5F7C;&#x6B64;&#x95F4;&#x5FAE;&#x5F31;&#x7684;&#x4E07;&#x6709;&#x5F15;&#x529B;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x5931;&#x6563;&#x5F97;&#x592A;&#x8FDC;&#xFF0C;&#x5728;&#x6210;&#x4E3A;&#x4E00;&#x9897;&#x5B64;&#x72EC;&#x7684;&#x767D;&#x77EE;&#x661F;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x6211;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/172426938/">一个由服务器时区引发的Bug</a></li><li><a href="https://blog.yuanpei.me/posts/2809571715/">行走在消逝中</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2809571715/" rel="external">行走在消逝中</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2809571715/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2809571715/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/时间/">时间</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/请记住我/">请记住我</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/霍金/">霍金</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2809571715/&title=《行走在消逝中》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2809571715/&title=《行走在消逝中》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2809571715/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《行走在消逝中》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2809571715/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2809571715/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3083474169/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">基于新浪微博的男女性择偶观数据分析(下)</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/352037321/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">我是猫，一只特立独行的猫</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2809571715/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2809571715/&title=《行走在消逝中》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2809571715/&title=《行走在消逝中》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2809571715/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《行走在消逝中》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2809571715/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2809571715/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2809571715/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
