<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        生命的朝圣者 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;最初开始读这本书的时候，并没有想到这本书会讲这样一个故事，甚至它不像一本畅销书一样让人充满期待，可是当你逐渐理清整个故事的来龙去脉以后，或许你会喜欢这个故事甚至被这个这个故事所震撼。我从未对宗教意义上的朝圣进行过深入了解，我所知道的朝圣，比如每年伊斯兰教历的第十二月，都会有数以百万计的伊斯兰教徒前往麦加参与朝觐仪式，而国内每年都会有从各地前往布达拉宫下的大昭寺朝佛的佛教信徒">
<meta name="keywords" content="生活,读书,朝圣">
<meta property="og:type" content="article">
<meta property="og:title" content="生命的朝圣者">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/3657008967/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;最初开始读这本书的时候，并没有想到这本书会讲这样一个故事，甚至它不像一本畅销书一样让人充满期待，可是当你逐渐理清整个故事的来龙去脉以后，或许你会喜欢这个故事甚至被这个这个故事所震撼。我从未对宗教意义上的朝圣进行过深入了解，我所知道的朝圣，比如每年伊斯兰教历的第十二月，都会有数以百万计的伊斯兰教徒前往麦加参与朝觐仪式，而国内每年都会有从各地前往布达拉宫下的大昭寺朝佛的佛教信徒">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="生命的朝圣者">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;最初开始读这本书的时候，并没有想到这本书会讲这样一个故事，甚至它不像一本畅销书一样让人充满期待，可是当你逐渐理清整个故事的来龙去脉以后，或许你会喜欢这个故事甚至被这个这个故事所震撼。我从未对宗教意义上的朝圣进行过深入了解，我所知道的朝圣，比如每年伊斯兰教历的第十二月，都会有数以百万计的伊斯兰教徒前往麦加参与朝觐仪式，而国内每年都会有从各地前往布达拉宫下的大昭寺朝佛的佛教信徒">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">生命的朝圣者</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">生命的朝圣者</h1>
        <h5 class="subtitle">
            
                <time datetime="2016-11-05T21:44:52.000Z" itemprop="datePublished" class="page-time">
  2016-11-05
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-生命的朝圣者" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">生命的朝圣者</h1>
        <div class="post-meta">
            <time class="post-time" title="2016-11-05 21:44:52" datetime="2016-11-05T21:44:52.000Z" itemprop="datePublished">2016-11-05</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        20 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6700;&#x521D;&#x5F00;&#x59CB;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x8FD9;&#x672C;&#x4E66;&#x4F1A;&#x8BB2;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x751A;&#x81F3;&#x5B83;&#x4E0D;&#x50CF;&#x4E00;&#x672C;&#x7545;&#x9500;&#x4E66;&#x4E00;&#x6837;&#x8BA9;&#x4EBA;&#x5145;&#x6EE1;&#x671F;&#x5F85;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x4F60;&#x9010;&#x6E10;&#x7406;&#x6E05;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x7684;&#x6765;&#x9F99;&#x53BB;&#x8109;&#x4EE5;&#x540E;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x751A;&#x81F3;&#x88AB;&#x8FD9;&#x4E2A;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x6240;&#x9707;&#x64BC;&#x3002;&#x6211;&#x4ECE;&#x672A;&#x5BF9;&#x5B97;&#x6559;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x671D;&#x5723;&#x8FDB;&#x884C;&#x8FC7;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#xFF0C;&#x6211;&#x6240;&#x77E5;&#x9053;&#x7684;&#x671D;&#x5723;&#xFF0C;&#x6BD4;&#x5982;&#x6BCF;&#x5E74;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x5386;&#x7684;&#x7B2C;&#x5341;&#x4E8C;&#x6708;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x6570;&#x4EE5;&#x767E;&#x4E07;&#x8BA1;&#x7684;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x5F92;&#x524D;&#x5F80;&#x9EA6;&#x52A0;&#x53C2;&#x4E0E;&#x671D;&#x89D0;&#x4EEA;&#x5F0F;&#xFF0C;&#x800C;&#x56FD;&#x5185;&#x6BCF;&#x5E74;&#x90FD;&#x4F1A;&#x6709;&#x4ECE;&#x5404;&#x5730;&#x524D;&#x5F80;&#x5E03;&#x8FBE;&#x62C9;&#x5BAB;&#x4E0B;&#x7684;&#x5927;&#x662D;&#x5BFA;&#x671D;&#x4F5B;&#x7684;&#x4F5B;&#x6559;&#x4FE1;&#x5F92;&#xFF0C;&#x800C;&#x5BF9;&#x85CF;&#x4F20;&#x4F5B;&#x6559;&#x4FE1;&#x4F17;&#x6765;&#x8BF4;&#x201C;&#x53E9;&#x957F;&#x5934;&#x201D;&#x662F;&#x6700;&#x4E3A;&#x81F3;&#x8BDA;&#x7684;&#x793C;&#x4F5B;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x3002;&#x6240;&#x4EE5;&#x671D;&#x5723;&#x662F;&#x4E00;&#x9879;&#x5177;&#x6709;&#x91CD;&#x5927;&#x7684;&#x9053;&#x5FB7;&#x6216;&#x8005;&#x7075;&#x6027;&#x610F;&#x4E49;&#x7684;&#x65C5;&#x7A0B;&#x6216;&#x8005;&#x63A2;&#x5BFB;&#xFF0C;&#x5B83;&#x5173;&#x4E4E;&#x5BF9;&#x4FE1;&#x4EF0;&#x7684;&#x601D;&#x8003;&#x540C;&#x65F6;&#x6CE8;&#x91CD;&#x8EAB;&#x4F53;&#x529B;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x671D;&#x5723;&#x8005;&#x59CB;&#x7EC8;&#x76F8;&#x4FE1;&#x524D;&#x5F80;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x80FD;&#x591F;&#x4ECE;&#x4E2D;&#x83B7;&#x5F97;&#x7075;&#x6027;&#x6216;&#x8005;&#x662F;&#x5F97;&#x5230;&#x6CBB;&#x6108;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x672C;&#x4E66;&#x7684;&#x4E3B;&#x4EBA;&#x516C;&#x54C8;&#x7F57;&#x5FB7;.&#x5F17;&#x83B1;&#xFF0C;&#x4E00;&#x4E2A;&#x516D;&#x5341;&#x5C81;&#x7684;&#x8001;&#x5934;&#x513F;&#xFF0C;&#x5728;&#x917F;&#x9152;&#x5382;&#x5DE5;&#x4F5C;&#x4E86;&#x56DB;&#x5341;&#x5E74;&#x540E;&#x9ED8;&#x9ED8;&#x65E0;&#x95FB;&#x5730;&#x9000;&#x4F11;&#x3002;&#x5728;&#x4ED6;&#x5E73;&#x9759;&#x5982;&#x6C34;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x4E0D;&#x66FE;&#x7ECF;&#x5386;&#x8FC7;&#x5347;&#x8FC1;&#x7684;&#x8D77;&#x8D77;&#x843D;&#x843D;&#xFF0C;&#x4ED6;&#x4E0D;&#x66FE;&#x5F97;&#x7F6A;&#x8FC7;&#x522B;&#x4EBA;&#x5230;&#x5904;&#x6811;&#x654C;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x4EB2;&#x8FD1;&#x5230;&#x4EA4;&#x5FC3;&#x7684;&#x670B;&#x53CB;&#x3002;&#x4ED6;&#x548C;&#x5FC3;&#x5B58;&#x9694;&#x9602;&#x7684;&#x59BB;&#x5B50;&#x4F4F;&#x5728;&#x4E61;&#x4E0B;&#xFF0C;&#x751F;&#x6D3B;&#x5E73;&#x9759;&#x5374;&#x5F7C;&#x6B64;&#x611F;&#x60C5;&#x758F;&#x79BB;&#xFF0C;&#x65E5;&#x590D;&#x4E00;&#x65E5;&#xFF0C;&#x5E74;&#x590D;&#x4E00;&#x5E74;&#x3002;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x4E00;&#x5C01;&#x6765;&#x81EA;&#x4E8C;&#x5341;&#x5E74;&#x672A;&#x89C1;&#x7684;&#x8001;&#x53CB;&#x594E;&#x59AE;&#x5730;&#x4FE1;&#xFF0C;&#x8BA9;&#x54C8;&#x7F57;&#x5FB7;&#x539F;&#x672C;&#x5E73;&#x9759;&#x5730;&#x751F;&#x6D3B;&#x5F00;&#x59CB;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x5728;&#x4FE1;&#x4E2D;&#x594E;&#x59AE;&#x544A;&#x8BC9;&#x4ED6;&#x81EA;&#x5DF1;&#x60A3;&#x4E86;&#x764C;&#x75C7;&#xFF0C;&#x54C8;&#x7F57;&#x5FB7;&#x611F;&#x5230;&#x83AB;&#x540D;&#x7684;&#x9707;&#x60CA;&#x548C;&#x60B2;&#x75DB;&#xFF0C;&#x6B64;&#x65F6;&#x4ED6;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x75AF;&#x72C2;&#x7684;&#x51B3;&#x5B9A;&#xFF1A;&#x4ECE;&#x82F1;&#x56FD;&#x6700;&#x897F;&#x5357;&#x4E00;&#x8DEF;&#x5230;&#x6700;&#x4E1C;&#x5317;&#xFF0C;&#x5F92;&#x6B65;&#x8DE8;&#x8D8A;&#x6574;&#x4E2A;&#x82F1;&#x683C;&#x5170;&#x53BB;&#x770B;&#x671B;&#x5979;&#x3002;&#x800C;&#x8BA9;&#x4ED6;&#x4EA7;&#x751F;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4ED6;&#x60F3;&#x5F53;&#x7136;&#x5730;&#x8BA4;&#x4E3A;&#xFF0C;&#x53EA;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x770B;&#x594E;&#x59AE;&#x5979;&#x5C31;&#x80FD;&#x591F;&#x6D3B;&#x4E0B;&#x6765;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x75AF;&#x72C2;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x53EF;&#x662F;&#x8C01;&#x80FD;&#x591F;&#x771F;&#x7684;&#x9884;&#x6599;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0B;&#x4E00;&#x523B;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x54C8;&#x7F57;&#x5FB7;&#x51B3;&#x5B9A;&#x8981;&#x5F00;&#x59CB;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x6216;&#x8BB8;&#x4E0D;&#x4F1A;&#x60F3;&#x5230;&#xFF0C;&#x8FD9;&#x573A;&#x4EE5;&#x751F;&#x547D;&#x7684;&#x540D;&#x4E49;&#x53D1;&#x8D77;&#x7684;&#x671D;&#x5723;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x54C8;&#x7F57;&#x5FB7;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x7684;&#x4E00;&#x79CD;&#x81EA;&#x6211;&#x6551;&#x8D4E;&#x3002;&#x54C8;&#x7F57;&#x5FB7;&#x662F;&#x4E00;&#x4E2A;&#x5E73;&#x51E1;&#x5982;&#x4F60;&#x6211;&#x7684;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x751A;&#x81F3;&#x4ECE;&#x4ED6;&#x6CE2;&#x6F9C;&#x4E0D;&#x5174;&#x7684;&#x4EBA;&#x751F;&#x8F68;&#x8FF9;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x627E;&#x4E0D;&#x51FA;&#x4ED6;&#x7684;&#x751F;&#x547D;&#x91CC;&#x6709;&#x8FC7;&#x54EA;&#x4E9B;&#x95EA;&#x5149;&#x70B9;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x4EE5;&#x4ECA;&#x5929;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E16;&#x4FD7;&#x7684;&#x773C;&#x5149;&#x6765;&#x5BA1;&#x89C6;&#x54C8;&#x7F57;&#x5FB7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6216;&#x8BB8;&#x6C89;&#x9ED8;&#x5BE1;&#x8A00;&#x7684;&#x54C8;&#x7F57;&#x5FB7;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x8005;&#xFF0C;&#x53EF;&#x5F53;&#x4ED6;&#x5F92;&#x6B65;&#x8D70;&#x5B8C;627&#x82F1;&#x91CC;&#x7684;&#x8FD9;&#x6BB5;&#x65C5;&#x7A0B;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6216;&#x8BB8;&#x4F1A;&#x660E;&#x767D;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x800C;&#x54C8;&#x7F57;&#x5FB7;&#x6240;&#x505A;&#x7684;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x539F;&#x59CB;&#x800C;&#x8D28;&#x6734;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x627E;&#x56DE;&#x57CB;&#x85CF;&#x5728;&#x5185;&#x5FC3;&#x591A;&#x5E74;&#x7684;&#x5584;&#x826F;&#x548C;&#x6E29;&#x60C5;&#xFF0C;&#x4ED6;&#x66FE;&#x7ECF;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x4E08;&#x592B;&#x3001;&#x66F4;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x7236;&#x4EB2;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x7ECF;&#x5386;&#x8FC7;&#x8FD9;&#x6BB5;&#x65C5;&#x7A0B;&#x4EE5;&#x540E;&#xFF0C;&#x4ED6;&#x7EC8;&#x4E8E;&#x627E;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;&#x6108;&#x52A0;&#x771F;&#x5B9E;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x573A;&#x5173;&#x4E8E;&#x751F;&#x547D;&#x5730;&#x4FEE;&#x884C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x65E0;&#x6CD5;&#x8BA4;&#x6E05;&#x81EA;&#x6211;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x7740;&#x5E74;&#x9F84;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F1A;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x51B0;&#x51B7;&#x7684;&#x4E16;&#x754C;&#x800C;&#x53D8;&#x5F97;&#x9EBB;&#x6728;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5B66;&#x4F1A;&#x6C89;&#x9ED8;&#x3001;&#x5B66;&#x4F1A;&#x59A5;&#x534F;&#xFF0C;&#x90A3;&#x4EFD;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x9A84;&#x50B2;&#x7EC8;&#x4E8E;&#x88AB;&#x5C81;&#x6708;&#x78E8;&#x53BB;&#x68F1;&#x89D2;&#x3002;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x6B3A;&#x9A97;&#x81EA;&#x5DF1;&#xFF0C;&#x8BA4;&#x4E3A;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x6210;&#x719F;&#x3002;&#x6211;&#x7279;&#x522B;&#x559C;&#x6B22;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;&#x77E5;&#x4E16;&#x6545;&#x800C;&#x4E0D;&#x4E16;&#x6545;&#xFF0C;&#x65B9;&#x4E3A;&#x6700;&#x5584;&#x826F;&#x7684;&#x6210;&#x719F;&#x201D;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x56DE;&#x9996;&#x54C8;&#x7F57;&#x5FB7;&#x7684;&#x751F;&#x5E73;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x751F;&#x90FD;&#x88AB;&#x632B;&#x8D25;&#x611F;&#x585E;&#x6EE1;&#x7684;&#x7537;&#x4EBA;&#xFF0C;&#x4ECE;&#x5C0F;&#x5C31;&#x5BB3;&#x6015;&#x6210;&#x4E3A;&#x5927;&#x5BB6;&#x5173;&#x6CE8;&#x7684;&#x7126;&#x70B9;;&#x4E00;&#x8F88;&#x5B50;&#x90FD;&#x5F2F;&#x7740;&#x8170;&#x751F;&#x6D3B;&#xFF0C;&#x4E60;&#x60EF;&#x50CF;&#x5F71;&#x5B50;&#x4E00;&#x6837;&#x6084;&#x65E0;&#x58F0;&#x606F;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x5728;&#x4ED6;&#x9000;&#x4F11;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x516C;&#x53F8;&#x90FD;&#x6CA1;&#x6709;&#x4E3A;&#x4ED6;&#x4E3E;&#x884C;&#x8FC7;&#x6B22;&#x9001;&#x4EEA;&#x5F0F;;&#x4ED6;&#x5BB3;&#x6015;&#x88AB;&#x629B;&#x5F03;&#xFF0C;&#x7ED3;&#x679C;&#x56E0;&#x4E3A;&#x513F;&#x5B50;&#x7684;&#x6B7B;&#x548C;&#x59BB;&#x5B50;&#x4EA7;&#x751F;&#x9694;&#x9602;;&#x4ED6;&#x592A;&#x5BB3;&#x6015;&#x5931;&#x53BB;&#x773C;&#x524D;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x513F;&#x5B50;&#x6EBA;&#x6C34;&#x65F6;&#x72B9;&#x8C6B;&#x4E0D;&#x51B3;&#x9009;&#x62E9;&#x505C;&#x4E0B;&#x6765;&#x89E3;&#x978B;&#x5E26;;&#x4ED6;&#x592A;&#x5BB3;&#x6015;&#x9519;&#x8FC7;&#x7F8E;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x65B0;&#x5A5A;&#x4E4B;&#x591C;&#x8EB2;&#x8FDB;&#x5395;&#x6240;&#x800C;&#x4E0D;&#x6562;&#x76F4;&#x89C6;&#x7F8E;&#x4E3D;&#x7684;&#x59BB;&#x5B50;.&#x4EBA;&#x4EEC;&#x5E38;&#x5E38;&#x65E0;&#x6CD5;&#x63A5;&#x7EB3;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5FC3;&#x6000;&#x6267;&#x5FF5;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x81EA;&#x5351;&#x3002;&#x53EF;&#x662F;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x751F;&#x6D3B;&#x7684;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x53BB;&#x53D1;&#x73B0;&#x81EA;&#x6211;&#xFF0C;&#x66F4;&#x597D;&#x5730;&#x63A5;&#x7EB3;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x6BB5;&#x65C5;&#x884C;&#x4E2D;&#xFF0C;&#x54C8;&#x7F57;&#x5FB7;&#x9047;&#x5230;&#x4E86;&#x52A0;&#x6CB9;&#x7AD9;&#x5973;&#x5B69;&#x3001;&#x5BA2;&#x5E97;&#x65C5;&#x4EBA;&#x3001;&#x739B;&#x8482;&#x5A1C;&#x7B49;&#x7B49;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x54C8;&#x7F57;&#x5FB7;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x662F;&#x4ED6;&#x65C5;&#x9014;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x8DEF;&#x4EBA;&#x7532;&#xFF0C;&#x53EF;&#x6B63;&#x662F;&#x8FD9;&#x4E9B;&#x8DEF;&#x4EBA;&#x7532;&#x6559;&#x4F1A;&#x4E86;&#x54C8;&#x7F57;&#x5FB7;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x8BA9;&#x4ED6;&#x5B66;&#x4F1A;&#x4E86;&#x8046;&#x542C;&#x522B;&#x4EBA;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5B66;&#x4F1A;&#x4E86;&#x5766;&#x9648;&#x5185;&#x5FC3;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x751F;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x7684;&#x8D77;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#x90FD;&#x662F;&#x4E0A;&#x5929;&#x5B89;&#x6392;&#x597D;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x53BB;&#x8BA9;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x4E30;&#x5BCC;&#x8D77;&#x6765;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8BD5;&#x7740;&#x53BB;&#x63A5;&#x53D7;&#x4E9B;&#x4F60;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#x3001;&#x53BB;&#x4E89;&#x53D6;&#x548C;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x4E0E;&#x5176;&#x8E1F;&#x8E70;&#x4E0D;&#x524D;&#x72B9;&#x8C6B;&#x4E0D;&#x51B3;&#xFF0C;&#x4E0D;&#x5982;&#x53BB;&#x63A5;&#x53D7;&#x8FD9;&#x4E9B;&#x6765;&#x81EA;&#x672A;&#x6765;&#x7684;&#x6050;&#x60E7;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5FC3;&#x4E2D;&#x575A;&#x4FE1;&#x81EA;&#x5DF1;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x79BB;&#x76EE;&#x6807;&#x5DF2;&#x7136;&#x63A5;&#x8FD1;&#x4E86;&#x4E00;&#x6B65;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x8FD8;&#x5E74;&#x8F7B;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8D81;&#x7740;&#x73B0;&#x5728;&#xFF0C;&#x53BB;&#x505A;&#x4E9B;&#x771F;&#x6B63;&#x75AF;&#x72C2;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x6211;&#x4EEC;&#x5782;&#x5782;&#x8001;&#x77E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x751F;&#x547D;&#x662F;&#x5982;&#x6B64;&#x7684;&#x82CD;&#x767D;&#xFF0C;&#x5927;&#x6982;&#x6211;&#x4EEC;&#x4F1A;&#x66F4;&#x52A0;&#x56E0;&#x4E3A;&#x5E74;&#x8F7B;&#x65F6;&#x7684;&#x788C;&#x788C;&#x65E0;&#x4E3A;&#x800C;&#x6094;&#x6068;&#x7EC8;&#x751F;&#x5427;&#x3002;&#x4EBA;&#x4EEC;&#x90FD;&#x662F;&#x61A7;&#x61AC;&#x7740;&#x672A;&#x6765;&#xFF0C;&#x671F;&#x5F85;&#x7740;&#x65E0;&#x9650;&#x7F8E;&#x597D;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x660E;&#x767D;&#x7231;&#x662F;&#x4E00;&#x79CD;&#x53D1;&#x81EA;&#x672C;&#x6027;&#x7684;&#x60C5;&#x611F;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x771F;&#x6B63;&#x5177;&#x5907;&#x4E86;&#x7231;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x65F6;&#x5E38;&#x4F1A;&#x56E0;&#x4E3A;&#x63A7;&#x5236;&#x4E0D;&#x4F4F;&#x60C5;&#x7EEA;&#x800C;&#x4F24;&#x5BB3;&#x5230;&#x522B;&#x4EBA;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x77E5;&#x9053;&#x6211;&#x7684;&#x672C;&#x610F;&#x5E76;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x53BB;&#x4F24;&#x5BB3;&#x522B;&#x4EBA;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x5BF9;&#x522B;&#x4EBA;&#x7684;&#x4F24;&#x5BB3;&#x5DF2;&#x7136;&#x9020;&#x6210;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x50CF;&#x9489;&#x6EE1;&#x7BF1;&#x7B06;&#x7684;&#x9489;&#x5B50;&#x5373;&#x4F7F;&#x9489;&#x5B50;&#x88AB;&#x62D4;&#x51FA;&#x6765;&#xFF0C;&#x53EF;&#x662F;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x518D;&#x8BA9;&#x7BF1;&#x7B06;&#x53D8;&#x56DE;&#x5B83;&#x539F;&#x6765;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x540C;&#x60C5;&#x54C8;&#x7F57;&#x5FB7;&#x7684;&#x59BB;&#x5B50;&#x83AB;&#x7433;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9762;&#x5BF9;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7EC8;&#x65E5;&#x6728;&#x7EB3;&#x5BE1;&#x8A00;&#x7684;&#x4E08;&#x592B;&#xFF0C;&#x751A;&#x81F3;&#x4ED6;&#x4ECE;&#x6765;&#x90FD;&#x5B66;&#x4E0D;&#x4F1A;&#x6D6A;&#x6F2B;&#x6216;&#x8005;&#x662F;&#x54C4;&#x4F60;&#x5F00;&#x5FC3;&#xFF0C;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x60F3;&#x5462;&#xFF1F;&#x6700;&#x521D;&#x83AB;&#x7433;&#x5BF9;&#x4E08;&#x592B;&#x7684;&#x56F0;&#x60D1;&#x4E0D;&#x89E3;&#x3001;&#x62C5;&#x5FE7;&#x6124;&#x6012;&#xFF0C;&#x968F;&#x7740;&#x6545;&#x4E8B;&#x7684;&#x63A8;&#x8FDB;&#x9010;&#x6E10;&#x6F14;&#x53D8;&#x4E3A;&#x63A2;&#x5BFB;&#x6539;&#x53D8;&#x3001;&#x5C1D;&#x8BD5;&#x4E86;&#x89E3;&#xFF0C;&#x751A;&#x81F3;&#x5230;&#x6545;&#x4E8B;&#x7684;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x4EBA;&#x7EC8;&#x4E8E;&#x91CD;&#x65B0;&#x8D70;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x60C5;&#x8282;&#x662F;&#x4E24;&#x4E2A;&#x4EBA;&#x5C3D;&#x91CA;&#x524D;&#x5ACC;&#xFF0C;&#x624B;&#x7275;&#x7740;&#x624B;&#x8D70;&#x5411;&#x6D77;&#x8FB9;&#xFF0C;&#x4E00;&#x8FB9;&#x8D70;&#x4E00;&#x8FB9;&#x56DE;&#x5FC6;&#x7B2C;&#x4E00;&#x6B21;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x821E;&#x4F1A;&#x4E0A;&#x8BA4;&#x8BC6;&#x7684;&#x60C5;&#x666F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65C5;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x8FDC;&#x884C;&#xFF0C;&#x53EF;&#x662F;&#x5B83;&#x5374;&#x662F;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x7075;&#x9B42;&#x56DE;&#x5F52;&#xFF0C;&#x5F53;&#x54C8;&#x7F57;&#x5FB7;&#x9010;&#x6E10;&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x61E6;&#x5F31;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x5F00;&#x59CB;&#x5B66;&#x4F1A;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#xFF1B;&#x5F53;&#x83AB;&#x7433;&#x5F00;&#x59CB;&#x53CD;&#x601D;&#x8FC7;&#x53BB;&#x7684;&#x79CD;&#x79CD;&#x7ECF;&#x5386;&#xFF0C;&#x56DE;&#x60F3;&#x8D77;&#x4E08;&#x592B;&#x66FE;&#x7ECF;&#x6E29;&#x60C5;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x4E16;&#x95F4;&#x6240;&#x6709;&#x7684;&#x76F8;&#x9047;&#x90FD;&#x662F;&#x4E45;&#x522B;&#x91CD;&#x9022;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x76F8;&#x9022;&#x4E00;&#x7B11;&#x6CEF;&#x6069;&#x4EC7;&#x66F4;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x5462;&#xFF1F;&#x4E0D;&#x613F;&#x610F;&#x653E;&#x4E0B;&#x8FC7;&#x53BB;&#x662F;&#x6267;&#x5FF5;&#xFF0C;&#x4E0D;&#x613F;&#x610F;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x662F;&#x6267;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x672C;&#x6765;&#x5C31;&#x5E94;&#x8BE5;&#x6E29;&#x6696;&#x5584;&#x826F;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5373;&#x4F7F;&#x751F;&#x6D3B;&#x8BA9;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x7A77;&#x56F0;&#x6F66;&#x5012;&#x3001;&#x5931;&#x610F;&#x843D;&#x5BDE;&#xFF0C;&#x90A3;&#x53C8;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x4E00;&#x4E2A;&#x8BA9;&#x6211;&#x66F4;&#x52A0;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x5F53;&#x54C8;&#x7F57;&#x5FB7;&#x56E0;&#x4E3A;&#x72EC;&#x81EA;&#x8FDC;&#x884C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x800C;&#x58F0;&#x540D;&#x8FDC;&#x64AD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x90A3;&#x4E00;&#x77AC;&#x95F4;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x671D;&#x5723;&#x8005;&#x90FD;&#x8868;&#x793A;&#x8981;&#x52A0;&#x5165;&#x8FD9;&#x4E2A;&#x65C5;&#x7A0B;&#xFF0C;&#x53EF;&#x662F;&#x5F88;&#x5FEB;&#x6211;&#x4EEC;&#x5C31;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x671D;&#x5723;&#x8005;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x90FD;&#x5404;&#x6000;&#x5FC3;&#x673A;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x662F;&#x4E3A;&#x4E86;&#x8FFD;&#x6C42;&#x540D;&#x5229;&#x800C;&#x52A0;&#x5165;&#x961F;&#x4F0D;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x662F;&#x4E3A;&#x4E86;&#x51FA;&#x4E00;&#x672C;&#x4F20;&#x5947;&#x4E66;&#x7C4D;&#x800C;&#x52A0;&#x5165;&#x961F;&#x4F0D;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x662F;&#x4E3A;&#x4E86;&#x633D;&#x6551;&#x4E00;&#x6BB5;&#x5931;&#x8D25;&#x7684;&#x5A5A;&#x59FB;&#x800C;&#x52A0;&#x5165;&#x961F;&#x4F0D;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x662F;&#x4E3A;&#x4E86;&#x5199;&#x4E00;&#x7BC7;&#x6210;&#x4E3A;&#x5934;&#x6761;&#x7684;&#x65B0;&#x95FB;&#x62A5;&#x9053;&#x800C;&#x52A0;&#x5165;&#x961F;&#x4F0D;&#x2026;&#x2026;&#x8FD9;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x6765;&#x63E3;&#x5EA6;&#x54C8;&#x7F57;&#x5FB7;&#x7684;&#x7528;&#x610F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x671D;&#x5723;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#x5730;&#x610F;&#x4E49;&#x5C31;&#x4F1A;&#x88AB;&#x65E0;&#x9650;&#x7684;&#x5FFD;&#x7565;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x5C1D;&#x8BD5;&#x53BB;&#x7406;&#x89E3;&#x54C8;&#x7F57;&#x5FB7;&#x7684;&#x672C;&#x610F;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5BF9;&#x6B64;&#x8D8B;&#x4E4B;&#x82E5;&#x9E5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6216;&#x8BB8;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#x4E3A;&#x4EBA;&#x4EEC;&#x6240;&#x7406;&#x89E3;&#x6240;&#x63A8;&#x5D07;&#xFF0C;&#x4EBA;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x79CD;&#x88AB;&#x5173;&#x6CE8;&#x7684;&#x611F;&#x89C9;&#x800C;&#x5DF2;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x653E;&#x4E0B;&#x90A3;&#x9897;&#x6D6E;&#x8E81;&#x7684;&#x5FC3;&#xFF0C;&#x52AA;&#x529B;&#x53BB;&#x8046;&#x542C;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x6211;&#x4EEC;&#x751F;&#x6765;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x4E00;&#x573A;&#x6DFB;&#x6CB9;&#x52A0;&#x918B;&#x7684;&#x4F5C;&#x79C0;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x59CB;&#x7EC8;&#x76F8;&#x4FE1;&#x7231;&#x60C5;&#x662F;&#x4E24;&#x4E2A;&#x4EBA;&#x5F7C;&#x6B64;&#x5438;&#x5F15;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x8D70;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x4E0D;&#x64C5;&#x957F;&#x523B;&#x610F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5929;&#x751F;&#x5C31;&#x559C;&#x6B22;&#x672C;&#x8272;&#x51FA;&#x6F14;&#x3002;</p>
<p>&#x2003;&#x2003;&#x54C8;&#x7F57;&#x5FB7;&#x6700;&#x521D;&#x5F00;&#x59CB;&#x65C5;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x65E0;&#x6240;&#x6709;&#x7684;&#xFF0C;&#x4ED6;&#x817F;&#x811A;&#x4E0D;&#x4FBF;&#x540C;&#x65F6;&#x60A3;&#x6709;&#x8001;&#x5E74;&#x75F4;&#x5446;&#xFF0C;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x72B6;&#x6001;&#x8BA9;&#x59BB;&#x5B50;&#x83AB;&#x7433;&#x5BF9;&#x4ED6;&#x7684;&#x6240;&#x4F5C;&#x6240;&#x5728;&#x56F0;&#x60D1;&#x800C;&#x6124;&#x6012;&#xFF0C;&#x53EF;&#x662F;&#x968F;&#x7740;&#x65C5;&#x9014;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x90A3;&#x4E9B;&#x5728;&#x65C5;&#x9014;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x8DEF;&#x4EBA;&#x4EEC;&#xFF0C;&#x5E38;&#x5E38;&#x4F1A;&#x9988;&#x8D60;&#x7ED9;&#x54C8;&#x7F57;&#x5FB7;&#x5982;&#x5730;&#x56FE;&#x3001;&#x6307;&#x5357;&#x9488;&#x3001;&#x836F;&#x7269;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x54C8;&#x7F57;&#x5FB7;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x88C5;&#x5907;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x4ED6;&#x79BB;&#x76EE;&#x6807;&#x8D8A;&#x6765;&#x8D8A;&#x8FD1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4E0D;&#x5F97;&#x4E0D;&#x5C06;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x8F6C;&#x8D60;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x6216;&#x8005;&#x662F;&#x4E0D;&#x614E;&#x5728;&#x65C5;&#x9014;&#x4E2D;&#x4E22;&#x5931;&#xFF0C;&#x6211;&#x5370;&#x8C61;&#x6BD4;&#x8F83;&#x6DF1;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x4ED6;&#x5728;&#x65C5;&#x9014;&#x4E2D;&#x6536;&#x7559;&#x4E86;&#x4E00;&#x6761;&#x6D41;&#x6D6A;&#x72D7;&#xFF0C;&#x5728;&#x76F8;&#x5904;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x9010;&#x6E10;&#x57F9;&#x517B;&#x51FA;&#x4E86;&#x611F;&#x60C5;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x54C8;&#x7F57;&#x5FB7;&#x60F3;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x513F;&#x5B50;&#x66FE;&#x7ECF;&#x60F3;&#x8981;&#x517B;&#x4E00;&#x6761;&#x5C0F;&#x72D7;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x56FA;&#x6267;&#x548C;&#x61E6;&#x5F31;&#xFF0C;&#x8FD9;&#x4E2A;&#x613F;&#x671B;&#x6700;&#x7EC8;&#x6210;&#x4E3A;&#x6C38;&#x8FDC;&#x7684;&#x9057;&#x61BE;&#xFF0C;&#x6B63;&#x5F53;&#x4ED6;&#x4E3A;&#x6B64;&#x800C;&#x8D39;&#x5FC3;&#x4F24;&#x795E;&#x65F6;&#xFF0C;&#x8FD9;&#x6761;&#x6D41;&#x6D6A;&#x72D7;&#x5FFD;&#x7136;&#x4E0D;&#x77E5;&#x6240;&#x8E2A;&#xFF0C;&#x7B49;&#x54C8;&#x7F57;&#x5FB7;&#x627E;&#x5230;&#x5B83;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x5B83;&#x8DDF;&#x4E0A;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x5973;&#x5B69;&#x513F;&#x4E0A;&#x4E86;&#x4E00;&#x8F86;&#x516C;&#x4EA4;&#x8F66;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x751F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x7B80;&#x81F3;&#x7E41;&#x518D;&#x7531;&#x7E41;&#x81F3;&#x7B80;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x5E74;&#x5C11;&#x8F7B;&#x72C2;&#x3001;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x8FF7;&#x5931;&#x65B9;&#x5411;&#xFF0C;&#x53EF;&#x5F53;&#x6211;&#x4EEC;&#x6D17;&#x51C0;&#x94C5;&#x534E;&#x3001;&#x4E22;&#x6389;&#x4E00;&#x5207;&#x9644;&#x5EB8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x6216;&#x8BB8;&#x4F1A;&#x4E0D;&#x7531;&#x5F97;&#x611F;&#x8C22;&#xFF0C;&#x90A3;&#x4E9B;&#x751F;&#x547D;&#x91CC;&#x6559;&#x4F1A;&#x6211;&#x4EEC;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x4EBA;&#x3002;&#x4ECE;&#x59CB;&#x81F3;&#x7EC8;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x7684;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x60B2;&#x6B22;&#x79BB;&#x5408;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x4EBA;&#x4F1A;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x7136;&#x540E;&#x966A;&#x4F34;&#x6211;&#x4EEC;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x4E9B;&#x8DEF;&#x53EA;&#x80FD;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x4EBA;&#x6765;&#x8D70;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x603B;&#x8981;&#x5C1D;&#x8BD5;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x8981;&#x5B66;&#x4F1A;&#x53BB;&#x653E;&#x4E0B;&#x8FC7;&#x53BB;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6D85;&#x78D0;&#xFF0C;&#x8FD9;&#x662F;&#x54C8;&#x7F57;&#x5FB7;&#x7684;&#x671D;&#x5723;&#x3002;&#x201C;&#x4E5F;&#x8BB8;&#x5F53;&#x4F60;&#x8D70;&#x51FA;&#x8F66;&#x95E8;&#x771F;&#x771F;&#x5207;&#x5207;&#x7528;&#x53CC;&#x817F;&#x8D70;&#x8DEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EF5;&#x5EF6;&#x4E0D;&#x7EDD;&#x7684;&#x571F;&#x5730;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x80FD;&#x770B;&#x5230;&#x7684;&#x552F;&#x4E00;&#x7684;&#x4E8B;&#x7269;&#x201D;&#x3002;&#x6211;&#x5FD8;&#x8BB0;&#x8FD9;&#x53E5;&#x8BDD;&#x662F;&#x6545;&#x4E8B;&#x4E2D;&#x7684;&#x54EA;&#x4E2A;&#x4EBA;&#x7269;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#x7684;&#x8BDD;&#x5566;&#xFF0C;&#x6211;&#x5BF9;&#x5C0F;&#x8BF4;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x80FD;&#x80A1;&#x6295;&#x5165;&#x9605;&#x8BFB;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6211;&#x60F3;&#x4EBA;&#x7684;&#x5927;&#x8111;&#x91CC;&#x6709;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x6211;&#x4EEC;&#x4E0D;&#x660E;&#x767D;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x60F3;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4FE1;&#x5FF5;&#xFF0C;&#x4F60;&#x5C31;&#x4E00;&#x5B9A;&#x80FD;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x6210;&#x3002;&#x4F60;&#x662F;&#x5426;&#x8FD8;&#x8BB0;&#x5F97;&#x6700;&#x521D;&#x5F00;&#x59CB;&#x8FD9;&#x4E2A;&#x65C5;&#x7A0B;&#x65F6;&#x8BF4;&#x8FC7;&#x7684;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x6211;&#x73B0;&#x5728;&#x9A6C;&#x4E0A;&#x51FA;&#x53D1;&#x3002;&#x53EA;&#x8981;&#x6211;&#x4E00;&#x5929;&#x8FD8;&#x5728;&#x8D70;&#xFF0C;&#x5979;&#x4E00;&#x5929;&#x5C31;&#x8981;&#x6D3B;&#x7740;&#x3002;&#x8BF7;&#x544A;&#x8BC9;&#x5979;&#x8FD9;&#x6B21;&#x6211;&#x4E0D;&#x4F1A;&#x8BA9;&#x5979;&#x5931;&#x671B;&#x3002;</p>
</blockquote>
<p>Payne &#x4E8E; 2016/11/12 </p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/786195243/">做最初的自己</a></li><li><a href="https://qinyuanpei.github.io/posts/3111375079/">冬天来了，春天还会远吗？</a></li><li><a href="https://qinyuanpei.github.io/posts/1394521917/">青黄未接的2015</a></li><li><a href="https://zymin.cn/arcticle/nextcloud-file-scan.html">OCC命令给ownCloud/Nextcloud手动添加文件</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/3657008967/" rel="external">生命的朝圣者</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/3657008967/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/3657008967/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/朝圣/">朝圣</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生活/">生活</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/读书/">读书</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3657008967/&title=《生命的朝圣者》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3657008967/&title=《生命的朝圣者》 — PayneQinのBlog&source=&emsp;&emsp;最初开始读这本书的时候，并没有想到这本书会讲这样一个故事，甚至它不像一本畅销书一样让人充满期待，可是当你逐渐理清整个故事的来龙去脉..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3657008967/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《生命的朝圣者》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3657008967/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3657008967/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1152813120/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">在Kindle上阅读Markdown文档</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1254783039/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">基于C#中的Trace实现一个简单的日志系统</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/3657008967/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3657008967/&title=《生命的朝圣者》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3657008967/&title=《生命的朝圣者》 — PayneQinのBlog&source=&emsp;&emsp;最初开始读这本书的时候，并没有想到这本书会讲这样一个故事，甚至它不像一本畅销书一样让人充满期待，可是当你逐渐理清整个故事的来龙去脉..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3657008967/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《生命的朝圣者》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3657008967/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3657008967/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/3657008967/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
