<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        互联网黑洞读书笔记(1) - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;互联网是什么？当我们都渐渐习惯将互联网当作生活的一部分的时候，面对这样一个问题，我们似乎是迷茫和困惑的。因为当互联网渐渐地开始改变我们生活的那一刻起，我们就在和互联网不断地发生着剧烈反应。">
<meta name="keywords" content="互联网,哲学,思维,价值">
<meta property="og:type" content="article">
<meta property="og:title" content="互联网黑洞读书笔记(1)">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1478979553/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;互联网是什么？当我们都渐渐习惯将互联网当作生活的一部分的时候，面对这样一个问题，我们似乎是迷茫和困惑的。因为当互联网渐渐地开始改变我们生活的那一刻起，我们就在和互联网不断地发生着剧烈反应。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="互联网黑洞读书笔记(1)">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;互联网是什么？当我们都渐渐习惯将互联网当作生活的一部分的时候，面对这样一个问题，我们似乎是迷茫和困惑的。因为当互联网渐渐地开始改变我们生活的那一刻起，我们就在和互联网不断地发生着剧烈反应。">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">互联网黑洞读书笔记(1)</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">互联网黑洞读书笔记(1)</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-02-03T09:45:57.000Z" itemprop="datePublished" class="page-time">
  2015-02-03
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-互联网黑洞读书笔记(1)" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">互联网黑洞读书笔记(1)</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-02-03 09:45:57" datetime="2015-02-03T09:45:57.000Z" itemprop="datePublished">2015-02-03</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        9 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5F53;&#x6211;&#x4EEC;&#x90FD;&#x6E10;&#x6E10;&#x4E60;&#x60EF;&#x5C06;&#x4E92;&#x8054;&#x7F51;&#x5F53;&#x4F5C;&#x751F;&#x6D3B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9762;&#x5BF9;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x4F3C;&#x4E4E;&#x662F;&#x8FF7;&#x832B;&#x548C;&#x56F0;&#x60D1;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5F53;&#x4E92;&#x8054;&#x7F51;&#x6E10;&#x6E10;&#x5730;&#x5F00;&#x59CB;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x751F;&#x6D3B;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x8D77;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5728;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x4E0D;&#x65AD;&#x5730;&#x53D1;&#x751F;&#x7740;&#x5267;&#x70C8;&#x53CD;&#x5E94;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x672C;&#x4E66;&#x4F5C;&#x8005;&#x4EF2;&#x662D;&#x5DDD;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7ECF;&#x6D4E;&#x8FD9;&#x4E00;&#x7AE0;&#x66FE;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#xFF1A;</p>
<blockquote>
<p>&#x4E1C;&#x65B9;&#x7684;&#x5148;&#x54F2;&#x66FE;&#x4EE5;&#x201C;&#x5929;&#x4EBA;&#x5408;&#x4E00;&#x8BBA;&#x201D;&#x5174;&#x8D77;&#x4E86;&#x4EE5;&#x9053;&#x5FB7;&#x4E3A;&#x4E3B;&#x7EBF;&#x7684;&#x519C;&#x4E1A;&#x6587;&#x660E;&#xFF0C;&#x968F;&#x540E;&#x897F;&#x65B9;&#x7684;&#x6C11;&#x4E3B;&#x6CD5;&#x6CBB;&#x548C;&#x6D41;&#x6C34;&#x7EBF;&#x5206;&#x5DE5;&#x7387;&#x5148;&#x628A;&#x793E;&#x4F1A;&#x91CD;&#x65B0;&#x7EC4;&#x5408;&#x4E3A;&#x4EE5;&#x91D1;&#x94B1;&#x4E3A;&#x4E3B;&#x7EBF;&#x7684;&#x5DE5;&#x4E1A;&#x6587;&#x660E;&#x3002;&#x800C;Internet&#x5E26;&#x6765;&#x7684;&#x4FE1;&#x606F;&#x9769;&#x547D;&#xFF0C;&#x53C8;&#x6781;&#x5927;&#x5730;&#x7834;&#x574F;&#x4E86;&#x4EE5;&#x8FD9;&#x4E2A;&#x5206;&#x6790;&#x4E3A;&#x54F2;&#x5B66;&#x3001;&#x4EE5;&#x5784;&#x65AD;&#x4E3A;&#x76EE;&#x6807;&#x3001;&#x4EE5;&#x91D1;&#x94B1;&#x4E3A;&#x52A8;&#x529B;&#x7684;&#x897F;&#x65B9;&#x4F53;&#x7CFB;&#xFF0C;&#x4EBA;&#x7C7B;&#x4E16;&#x754C;&#x7684;&#x6587;&#x660E;&#x518D;&#x6B21;&#x8F6C;&#x5411;&#x4EE5;&#x795E;&#x79D8;&#x4E3A;&#x54F2;&#x5B66;&#x3001;&#x4EE5;&#x5206;&#x4EAB;&#x4E3A;&#x76EE;&#x6807;&#x3001;&#x4EE5;&#x9053;&#x5FB7;&#x4E3A;&#x52A8;&#x529B;&#x7684;&#x4E1C;&#x65B9;&#x4F53;&#x7CFB;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x8FD9;&#x6837;&#x7684;&#x63CF;&#x8FF0;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x7684;&#x672C;&#x8D28;&#x662F;&#x6570;&#x636E;&#x5BF9;&#x6570;&#x636E;&#x3001;&#x4FE1;&#x606F;&#x5BF9;&#x4FE1;&#x606F;&#x4EA4;&#x6362;&#xFF0C;&#x8FD9;&#x79CD;&#x7ECF;&#x6D4E;&#x7684;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x5728;&#x7ED9;&#x4E86;&#x4EBA;&#x4EEC;&#x66F4;&#x591A;&#x9009;&#x62E9;&#x7684;&#x81EA;&#x7531;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x9010;&#x6E10;&#x4ECE;&#x9ED1;&#x6697;&#x4E2D;&#x8D70;&#x51FA;&#x6765;&#xFF0C;&#x6210;&#x4E3A;&#x516C;&#x4FE1;&#x529B;&#x5F15;&#x5BFC;&#x4E0B;&#x7684;&#x516C;&#x5F00;&#x535A;&#x5F08;&#xFF0C;&#x800C;&#x66F4;&#x52A0;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x8FD1;&#x4E4E;&#x539F;&#x59CB;&#x65F6;&#x4EE3;&#x7684;&#x4FE1;&#x8A89;&#x4F53;&#x7CFB;&#x5374;&#x662F;&#x4EBA;&#x4EEC;&#x4E3B;&#x52A8;&#x5730;&#x3001;&#x81EA;&#x53D1;&#x5730;&#x5EFA;&#x7ACB;&#x5E76;&#x7EF4;&#x62A4;&#x7684;&#x3002;&#x793E;&#x4F1A;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4EF7;&#x683C;&#x548C;&#x4EF7;&#x503C;&#xFF0C;&#x800C;&#x5230;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x4E00;&#x5207;&#x90FD;&#x53D8;&#x6210;&#x4E86;&#x5229;&#x76CA;&#x548C;&#x5174;&#x8DA3;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5728;&#x4EE5;&#x4EF7;&#x503C;&#x4E3A;&#x5BFC;&#x5411;&#xFF0C;&#x800C;&#x975E;&#x4EE5;&#x6280;&#x672F;&#x4E3A;&#x5BFC;&#x5411;&#x3002;&#x56E0;&#x4E3A;&#x771F;&#x6B63;&#x80FD;&#x6539;&#x53D8;&#x751A;&#x81F3;&#x98A0;&#x8986;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4E00;&#x9879;&#x4F1F;&#x5927;&#x7684;&#x6280;&#x672F;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x800C;&#x662F;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x6A21;&#x5F0F;&#x80FD;&#x4E3A;&#x4EBA;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x5E26;&#x6765;&#x600E;&#x6837;&#x7684;&#x5229;&#x7528;&#x4EF7;&#x503C;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x672C;&#x8D28;&#x662F;&#x670D;&#x52A1;&#x884C;&#x4E1A;&#xFF0C;&#x8FD9;&#x79CD;&#x5C5E;&#x6027;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5730;&#x660E;&#x786E;&#x4E86;&#x3002;</p>
<blockquote>
<p>IT&#x884C;&#x4E1A;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4E24;&#x4E2A;&#x884C;&#x4E1A;&#x3002;&#x8FD9;&#x79CD;&#x754C;&#x5B9A;&#xFF0C;&#x662F;&#x79D1;&#x6280;&#x4E0E;&#x4EBA;&#x6587;&#x3001;&#x6280;&#x672F;&#x4E0E;&#x5173;&#x7CFB;&#x4E4B;&#x95F4;&#x7684;&#x5206;&#x91CE;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x5177;&#x4F53;&#x7684;&#x7406;&#x89E3;&#x662F;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x4E00;&#x4E2A;&#x6CDB;&#x884C;&#x4E1A;&#x6216;&#x8005;&#x8BF4;&#x5168;&#x884C;&#x4E1A;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7EBF;&#x4E0A;&#x7528;&#x6237;&#x5C31;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x3002;&#x800C;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#xFF0C;&#x4EFB;&#x4F55;&#x884C;&#x4E1A;&#x90FD;&#x5C06;&#x5177;&#x6709;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x5C06;&#x6DF1;&#x523B;&#x5730;&#x5F71;&#x54CD;&#x5230;&#x5404;&#x4E2A;&#x884C;&#x4E1A;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5168;&#x65B0;&#x7684;&#x3001;&#x5E7F;&#x6CDB;&#x7684;&#x5173;&#x7CFB;&#x3001;&#x8DE8;&#x8D8A;&#x65F6;&#x7A7A;&#x7684;&#x5173;&#x7CFB;;&#x800C;&#x4E14;&#x662F;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x9700;&#x6C42;&#xFF0C;&#x90FD;&#x8981;&#x53D1;&#x751F;&#x5173;&#x7CFB;;&#x800C;&#x4E14;&#x662F;&#x8DDF;&#x4EFB;&#x4F55;&#x4EBA;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x719F;&#x4EBA;&#x8FD8;&#x662F;&#x964C;&#x751F;&#x4EBA;;&#x800C;&#x4E14;&#x662F;&#x968F;&#x65F6;&#x968F;&#x5730;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x6B64;&#x65F6;&#x6B64;&#x5730;&#x8FD8;&#x662F;&#x5F7C;&#x65F6;&#x5F7C;&#x5730;&#x3002;&#x800C;IT&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;IT&#x662F;&#x79D1;&#x6280;&#xFF0C;&#x89E3;&#x51B3;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x7684;&#x6280;&#x672F;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x8D77;&#x5E76;&#x80FD;&#x6210;&#x529F;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;IT,&#x5F53;&#x6240;&#x6709;&#x6280;&#x672F;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x8D77;&#x800C;&#x4E14;&#x8DB3;&#x591F;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x4FBF;&#x643A;&#xFF0C;&#x4FBF;&#x643A;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x79FB;&#x52A8;&#xFF0C;&#x5F53;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x4FBF;&#x643A;&#x7684;IT&#x4EA7;&#x54C1;&#x76F8;&#x4E92;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#x65F6;&#x5C31;&#x662F;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x3002;</p>
<blockquote>
<p>&#x4E92;&#x8054;&#x7F51;&#x672C;&#x6765;&#x5C31;&#x662F;&#x8981;&#x8BA9;&#x4E0D;&#x540C;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#x5206;&#x5F00;&#xFF0C;&#x8BA9;&#x4E0D;&#x540C;&#x5229;&#x76CA;&#x7684;&#x4EBA;&#x65E9;&#x70B9;&#x5404;&#x5954;&#x524D;&#x7A0B;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x4E92;&#x8054;&#x7F51;&#x8868;&#x9762;&#x4E0A;&#x6CA1;&#x6709;&#x8FB9;&#x754C;&#xFF0C;&#x53EF;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x503E;&#x5411;&#x548C;&#x5F52;&#x5C5E;&#x3002;&#x56E0;&#x6B64;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x5174;&#x8DA3;&#x3001;&#x4E0D;&#x540C;&#x7684;&#x5229;&#x76CA;&#xFF0C;&#x4F7F;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x5230;&#x5904;&#x90FD;&#x8F93;&#x90E8;&#x843D;&#xFF0C;&#x4E0D;&#x7BA1;&#x804A;&#x5929;&#x7FA4;&#x8FD8;&#x662F;&#x7F51;&#x7AD9;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x90FD;&#x662F;&#x4E00;&#x7FA4;&#x5174;&#x8DA3;&#x76F8;&#x6295;&#x7684;&#x4EBA;&#x7EC4;&#x6210;&#x7684;&#x90E8;&#x843D;&#x3002;</p>
<blockquote>
<p>&#x5F53;&#x5927;&#x5BB6;&#x90FD;&#x5E0C;&#x671B;&#x957F;&#x671F;&#x5730;&#x3001;&#x5927;&#x8303;&#x56F4;&#x5730;&#x3001;&#x9891;&#x7E41;&#x5730;&#x3001;&#x6DF1;&#x5165;&#x5730;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x5BF9;&#x54C1;&#x724C;&#x7684;&#x6E34;&#x671B;&#x548C;&#x4F9D;&#x8D56;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x56E0;&#x4E3A;&#x54C1;&#x724C;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x79CD;&#x7A33;&#x5B9A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x5B9E;&#x7528;&#x6027;&#x3001;&#x4FE1;&#x4EFB;&#x5EA6;&#x3001;&#x8363;&#x8A89;&#x611F;&#xFF0C;&#x5373;&#x54C1;&#x724C;&#x6743;&#x5A01;&#x6240;&#x8BF4;&#x7684;&#x4E09;&#x79CD;&#x5173;&#x7CFB;&#xFF1A;&#x5229;&#x76CA;&#x5173;&#x7CFB;&#x3001;&#x60C5;&#x611F;&#x5173;&#x7CFB;&#x3001;&#x793E;&#x4F1A;&#x5173;&#x7CFB;&#x3002;</p>
<blockquote>
<p>&#x4EBA;&#x7C7B;&#x6587;&#x660E;&#x53D1;&#x5C55;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x4EBA;&#x6587;&#x4E0E;&#x79D1;&#x6280;&#x3002;&#x4EBA;&#x6587;&#x5D07;&#x5C1A;&#x611F;&#x53D7;&#xFF0C;&#x79D1;&#x6280;&#x5D07;&#x5C1A;&#x6570;&#x7406;</p>
</blockquote>
<ul>
<li><p>&#x4EBA;&#x6587;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x751F;&#x6765;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x521B;&#x9020;&#x7ECF;&#x5178;&#x5E76;&#x6D41;&#x4F20;&#x540E;&#x4E16;&#xFF0C;&#x4E00;&#x5230;&#x9876;&#x5CF0;&#x5C31;&#x5F88;&#x96BE;&#x88AB;&#x8D85;&#x8D8A;&#xFF0C;&#x7ED9;&#x4E16;&#x4EBA;&#x7559;&#x4E0B;&#x4E86;&#x6052;&#x4E45;&#x7684;&#x4EAB;&#x53D7;&#x6216;&#x9057;&#x4EA7;&#x3002;&#x4EBA;&#x6587;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x662F;&#x7CBE;&#x795E;&#x3001;&#x9053;&#x4E49;&#x3001;&#x7ECF;&#x9A8C;&#x3001;&#x89C4;&#x8303;&#x3001;&#x6A21;&#x5F0F;&#x3001;&#x89C4;&#x5219;&#x7B49;&#xFF0C;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#xFF0C;&#x4EBA;&#x6587;&#x662F;&#x4EBA;&#x4EEC;&#x7528;&#x6765;&#x7BA1;&#x7406;&#x3001;&#x8C03;&#x6574;&#x5E76;&#x4FDD;&#x6301;&#x6B32;&#x671B;&#x7684;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#x3002;</p>
</li>
<li><p>&#x79D1;&#x6280;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x4EBA;&#x4EEC;&#x7528;&#x6765;&#x6EE1;&#x8DB3;&#x65E7;&#x6B32;&#x671B;&#x5E76;&#x523A;&#x6FC0;&#x65B0;&#x6B32;&#x671B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x6CE8;&#x5B9A;&#x6619;&#x82B1;&#x4E00;&#x73B0;&#xFF0C;&#x968F;&#x65F6;&#x51C6;&#x5907;&#x79BB;&#x573A;&#x3001;&#x65F6;&#x523B;&#x7B49;&#x5F85;&#x6DD8;&#x6C70;&#x3002;&#x90A3;&#x4E9B;&#x9A7B;&#x8DB3;&#x5728;&#x65F6;&#x5149;&#x4E4B;&#x6D77;&#x7684;&#x79D1;&#x6280;&#x53D1;&#x660E;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4E0D;&#x4F1F;&#x5927;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;&#x592A;&#x77ED;&#x3002;</p>
</li>
</ul>
<blockquote>
<p>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x672C;&#x8D28;&#x662F;&#x5173;&#x7CFB;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x4F60;&#x4E86;&#x89E3;&#x5173;&#x7CFB;&#xFF0C;&#x5C31;&#x4E86;&#x89E3;&#x76F8;&#x4E92;&#x9700;&#x6C42;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x8BA9;&#x5BF9;&#x8C61;&#x627E;&#x4F60;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x5927;&#x6210;&#x672C;&#x53BB;&#x5BFB;&#x627E;&#x5BF9;&#x8C61;&#x3002;</p>
<blockquote>
<p>&#x4E92;&#x8054;&#x7F51;&#x601D;&#x7EF4;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x70B9;&#xFF1A;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3001;&#x4E0E;&#x5DF1;&#x4E0D;&#x540C;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x5C31;&#x662F;&#x8981;&#x5B58;&#x540C;&#x6C42;&#x5F02;&#xFF0C;&#x56E0;&#x4E3A;&#x591A;&#x5143;&#x5171;&#x751F;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x624D;&#x80FD;&#x6709;&#x521B;&#x65B0;&#x548C;&#x6D3B;&#x529B;&#x3002;<br>&#x2003;&#x2003;&#x4E0E;&#x5DF1;&#x4E0D;&#x540C;&#x5C31;&#x662F;&#x627E;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#x548C;&#x4E0D;&#x8DB3;&#xFF0C;&#x548C;&#x81EA;&#x5DF1;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/1930050594/">互联网黑洞读书笔记(2)</a></li><li><a href="https://qinyuanpei.github.io/posts/1930050594/">互联网黑洞读书笔记(2)</a></li><li><a href="https://blogs.kainy.cn/2010/03/2010年中国互联网的6大问题/">2010年中国互联网的6大问题</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1478979553/" rel="external">互联网黑洞读书笔记(1)</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1478979553/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1478979553/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/互联网/">互联网</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/价值/">价值</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/哲学/">哲学</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/思维/">思维</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1478979553/&title=《互联网黑洞读书笔记(1)》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1478979553/&title=《互联网黑洞读书笔记(1)》 — PayneQinのBlog&source=&emsp;&emsp;互联网是什么？当我们都渐渐习惯将互联网当作生活的一部分的时候，面对这样一个问题，我们似乎是迷茫和困惑的。因为当互联网渐渐地开始改变..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1478979553/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《互联网黑洞读书笔记(1)》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1478979553/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1478979553/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1940333895/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">脚本语言编程：Lua脚本编程入门</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/906436376/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">当Unity3D游戏开发遇上Excel</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1478979553/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1478979553/&title=《互联网黑洞读书笔记(1)》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1478979553/&title=《互联网黑洞读书笔记(1)》 — PayneQinのBlog&source=&emsp;&emsp;互联网是什么？当我们都渐渐习惯将互联网当作生活的一部分的时候，面对这样一个问题，我们似乎是迷茫和困惑的。因为当互联网渐渐地开始改变..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1478979553/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《互联网黑洞读书笔记(1)》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1478979553/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1478979553/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1478979553/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
