<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        一念执着，千山无阻 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x4E0A;&amp;#x5468;&amp;#x770B;&amp;#x4E86;&amp;#x90E8;&amp;#x5370;&amp;#x5EA6;&amp;#x7535;&amp;#x5F71;&amp;#x300A;&amp;#x5C0F;&amp;#x841D;&amp;#x8389;&amp;#x7684;&amp;#x7334;&amp;#x795E;&amp;#x5927;&amp;#x53D4;&amp;#x300B;&amp;#xFF0C;&amp;#x4EE5;&amp;#x4E00;&amp;#x8A00;">
<meta name="keywords" content="影评,电影,印度">
<meta property="og:type" content="article">
<meta property="og:title" content="一念执着，千山无阻">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2613006280/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x4E0A;&amp;#x5468;&amp;#x770B;&amp;#x4E86;&amp;#x90E8;&amp;#x5370;&amp;#x5EA6;&amp;#x7535;&amp;#x5F71;&amp;#x300A;&amp;#x5C0F;&amp;#x841D;&amp;#x8389;&amp;#x7684;&amp;#x7334;&amp;#x795E;&amp;#x5927;&amp;#x53D4;&amp;#x300B;&amp;#xFF0C;&amp;#x4EE5;&amp;#x4E00;&amp;#x8A00;">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/None.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/None.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz68ktdwyxj20zk0k041k.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz05napa0bj218g0tn1aa.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz05jqd82sj20zk0k0q4y.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz05de92mcj20zk0k0qm5.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz01ywfi2bj20zk0k0q5u.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fz01ueoaczj20zk0k0770.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fyzcxzchbqj210o0fvjt5.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fyzcuzsfgjj20zk0k079d.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="一念执着，千山无阻">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x4E0A;&amp;#x5468;&amp;#x770B;&amp;#x4E86;&amp;#x90E8;&amp;#x5370;&amp;#x5EA6;&amp;#x7535;&amp;#x5F71;&amp;#x300A;&amp;#x5C0F;&amp;#x841D;&amp;#x8389;&amp;#x7684;&amp;#x7334;&amp;#x795E;&amp;#x5927;&amp;#x53D4;&amp;#x300B;&amp;#xFF0C;&amp;#x4EE5;&amp;#x4E00;&amp;#x8A00;">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/None.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">一念执着，千山无阻</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">一念执着，千山无阻</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-04-03T09:08:04.000Z" itemprop="datePublished" class="page-time">
  2018-04-03
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-一念执着，千山无阻" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">一念执着，千山无阻</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-04-03 09:08:04" datetime="2018-04-03T09:08:04.000Z" itemprop="datePublished">2018-04-03</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        27 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x4E0A;&#x5468;&#x770B;&#x4E86;&#x90E8;&#x5370;&#x5EA6;&#x7535;&#x5F71;&#x300A;&#x5C0F;&#x841D;&#x8389;&#x7684;&#x7334;&#x795E;&#x5927;&#x53D4;&#x300B;&#xFF0C;&#x4EE5;&#x4E00;&#x8A00;&#x655D;&#x4E4B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x90E8;&#x88AB;&#x540D;&#x5B57;&#x803D;&#x8BEF;&#x7684;&#x597D;&#x7535;&#x5F71;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x6240;&#x719F;&#x77E5;&#x7684;&#x300A;&#x4E09;&#x50BB;&#x5927;&#x95F9;&#x5B9D;&#x83B1;&#x575E;&#x300B;&#x3001;&#x300A;&#x5076;&#x6EF4;&#x4E2A;&#x795E;&#x5450;&#x300B;&#x3001;&#x300A;&#x5916;&#x661F;&#x9189;&#x6C49;PK&#x5730;&#x7403;&#x795E;&#x300B;&#x7B49;&#x7B49;&#x7535;&#x5F71;&#x4E00;&#x6837;&#x3002;&#x4E0D;&#x8FC7;&#x4F5C;&#x4E3A;&#x4E00;&#x90E8;&#x7531;&#x201C;&#x5370;&#x5EA6;&#x4E09;&#x6C57;&#x201D;&#x4E4B;&#x4E00;&#x8428;&#x5C14;&#x66FC;&#xB7;&#x6C57;&#x4E3B;&#x6F14;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x5176;&#x5728;&#x56FD;&#x5185;&#x7684;&#x77E5;&#x540D;&#x5EA6;&#x4E0D;&#x53CA;&#x963F;&#x7C73;&#x5C14;&#xB7;&#x6C57;&#xFF0C;&#x6240;&#x4EE5;&#x65E9;&#x5728;&#x8FD9;&#x90E8;2015&#x5E74;&#x5C31;&#x4E0A;&#x6620;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x5E76;&#x672A;&#x5728;&#x56FD;&#x5185;&#x4EA7;&#x751F;&#x592A;&#x663E;&#x8457;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x540C;&#x6863;&#x7535;&#x5F71;&#x300A;&#x73AF;&#x592A;&#x5E73;&#x6D0B;2&#x300B;&#x7968;&#x623F;&#x70ED;&#x5EA6;&#x5C45;&#x9AD8;&#x4E0D;&#x4E0B;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x56E0;&#x4E3A;&#x666F;&#x751C;&#x59D0;&#x59D0;&#x7EC8;&#x4E8E;&#x4E0D;&#x8D1F;&#x56FD;&#x4EBA;&#x671F;&#x671B;&#x53BB;&#x62EF;&#x6551;&#x5168;&#x4EBA;&#x7C7B;&#x5566;&#x3002;&#x5373;&#x4F7F;&#x5F53;&#x65F6;&#x7535;&#x5F71;&#x9662;&#x91CC;&#x770B;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x7684;&#x4EBA;&#x5BE5;&#x5BE5;&#x65E0;&#x51E0;&#xFF0C;&#x53EF;&#x6211;&#x89C9;&#x5F97;&#x8FD8;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7ED9;&#x5927;&#x5BB6;&#x8BF4;&#x4E00;&#x8BF4;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x4E00;&#x4E2A;&#x5373;&#x4F7F;&#x4F60;&#x80FD;&#x731C;&#x5BF9;&#x6240;&#x6709;&#x60C5;&#x8282;&#x4F9D;&#x7136;&#x4F1A;&#x559C;&#x6B22;&#x7684;&#x7535;&#x5F71;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/None.jpg" alt="&#x5C0F;&#x841D;&#x8389;&#x4E0E;&#x7334;&#x795E;&#x5927;&#x53D4;" title>
                </div>
                <div class="image-caption">&#x5C0F;&#x841D;&#x8389;&#x4E0E;&#x7334;&#x795E;&#x5927;&#x53D4;</div>
            </figure>
<p>&#x2003;&#x2003;&#x5F71;&#x7247;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x8BB2;&#x8FF0;&#x7684;&#x662F;&#x6765;&#x81EA;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x7A46;&#x65AF;&#x6797;&#x5BB6;&#x5EAD;&#x7684;&#x5C0F;&#x5973;&#x5B69;&#x6C99;&#x5E0C;&#x8FBE;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x6C99;&#x5E0C;&#x8FBE;&#x5230;6&#x5C81;&#x8FD8;&#x4E0D;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x5979;&#x7684;&#x7236;&#x6BCD;&#x5BF9;&#x6B64;&#x611F;&#x5230;&#x7126;&#x8651;&#x4E0D;&#x5DF2;&#x3002;&#x7956;&#x7236;&#x5EFA;&#x8BAE;&#x5E26;&#x5979;&#x5230;&#x795E;&#x5E99;&#x91CC;&#x53BB;&#x5411;&#x795E;&#x7948;&#x7977;&#xFF0C;&#x53EF;&#x8FD9;&#x5EA7;&#x795E;&#x5E99;&#x5728;&#x5370;&#x5EA6;&#x5883;&#x5185;&#xFF0C;&#x5E76;&#x4E14;&#x4E24;&#x56FD;&#x95F4;&#x4E92;&#x76F8;&#x4EC7;&#x89C6;&#x8FBE;&#x534A;&#x4E2A;&#x4E16;&#x7EAA;&#x4E4B;&#x4E45;&#x3002;&#x56E0;&#x4E3A;&#x6C99;&#x5E0C;&#x8FBE;&#x7684;&#x7236;&#x4EB2;&#x66FE;&#x5728;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x519B;&#x65B9;&#x670D;&#x8FC7;5&#x5E74;&#x5175;&#x5F79;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7533;&#x8BF7;&#x524D;&#x5F80;&#x5370;&#x5EA6;&#x7684;&#x7B7E;&#x8BC1;&#x3002;&#x65E0;&#x5948;&#x4E4B;&#x4E0B;&#xFF0C;&#x6C99;&#x5E0C;&#x8FBE;&#x7684;&#x6BCD;&#x4EB2;&#x72EC;&#x81EA;&#x5E26;&#x9886;&#x5973;&#x513F;&#x524D;&#x5F80;&#x5370;&#x5EA6;&#xFF0C;&#x4E0D;&#x60F3;&#x5728;&#x8FD4;&#x56DE;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x7684;&#x9014;&#x4E2D;&#xFF0C;&#x6C99;&#x5E0C;&#x8FBE;&#x5728;&#x5217;&#x8F66;&#x505C;&#x9760;&#x671F;&#x95F4;&#xFF0C;&#x4E3A;&#x4E0B;&#x8F66;&#x6551;&#x4E00;&#x53EA;&#x5C0F;&#x7F8A;&#x7F94;&#x800C;&#x548C;&#x6BCD;&#x4EB2;&#x8D70;&#x6563;&#xFF0C;&#x5E76;&#x88AB;&#x4E00;&#x8282;&#x8F7D;&#x6EE1;&#x7CAE;&#x98DF;&#x7684;&#x706B;&#x8F66;&#x5E26;&#x5230;&#x5370;&#x5EA6;&#x3002;&#x6C99;&#x5E0C;&#x8FBE;&#x5728;&#x90A3;&#x91CC;&#x9047;&#x5230;&#x4E86;&#x201C;&#x7334;&#x795E;&#x201D;&#x5E15;&#x4E07;&#xFF0C;&#x9762;&#x5BF9;&#x5370;&#x5EA6;&#x8B66;&#x65B9;&#x7684;&#x65E0;&#x52A8;&#x4E8E;&#x8877;&#xFF0C;&#x5927;&#x4F7F;&#x9986;&#x56E0;&#x4E3A;&#x5370;&#x5DF4;&#x51B2;&#x7A81;&#x800C;&#x5173;&#x95E8;&#xFF0C;&#x9ED1;&#x4E2D;&#x4ECB;&#x62D0;&#x5356;&#x5E7C;&#x7AE5;&#x7B49;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x53D8;&#x6545;&#xFF0C;&#x5E15;&#x4E07;&#x4E0D;&#x5F97;&#x4E0D;&#x8D70;&#x4E0A;&#x4EB2;&#x81EA;&#x9001;&#x6C99;&#x5E0C;&#x8FBE;&#x56DE;&#x5BB6;&#x7684;&#x65C5;&#x7A0B;&#x2026;&#x2026;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/None.jpg" alt="&#x6C99;&#x5E0C;&#x8FBE;&#x4E0E;&#x5C0F;&#x7F8A;&#x7F94;" title>
                </div>
                <div class="image-caption">&#x6C99;&#x5E0C;&#x8FBE;&#x4E0E;&#x5C0F;&#x7F8A;&#x7F94;</div>
            </figure>
<p>&#x2003;&#x2003;&#x7535;&#x5F71;&#x7684;&#x4E3B;&#x7EBF;&#x662F;&#x975E;&#x5E38;&#x6E05;&#x6670;&#x7684;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6574;&#x4E2A;&#x7535;&#x5F71;&#x88AB;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5145;&#x65A5;&#x7740;&#x5B97;&#x6559;&#x77DB;&#x76FE;&#x3001;&#x79CD;&#x59D3;&#x6B67;&#x89C6;&#x3001;&#x5370;&#x5DF4;&#x51B2;&#x7A81;&#x7684;&#x5927;&#x80CC;&#x666F;&#x91CC;&#xFF0C;&#x6240;&#x4EE5;&#x5BFC;&#x6F14;&#x8BD5;&#x56FE;&#x53BB;&#x8868;&#x8FBE;&#x7684;&#x5185;&#x6DB5;&#xFF0C;&#x5C31;&#x4E0D;&#x518D;&#x5355;&#x7EAF;&#x5730;&#x662F;&#x4E3A;&#x4E86;&#x8BB2;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x4E00;&#x5982;&#x201C;&#x4E09;&#x50BB;&#x201D;&#x62A8;&#x51FB;&#x5370;&#x5EA6;&#x6559;&#x80B2;&#x5236;&#x5EA6;&#x3001;OMG/&#x5076;&#x6EF4;&#x4E2A;&#x795E;/PK&#x63A2;&#x8BA8;&#x5B97;&#x6559;&#x548C;&#x795E;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x91CC;&#x6709;&#x8BB8;&#x591A;&#x503C;&#x5F97;&#x53BB;&#x63A2;&#x8BA8;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x7535;&#x5F71;&#x4E24;&#x6761;&#x76F8;&#x4E92;&#x4EA4;&#x53C9;&#x7684;&#x7EBF;&#x7D22;&#x6784;&#x6210;&#xFF0C;&#x7537;&#x4E3B;&#x5E15;&#x592B;&#x662F;&#x4E00;&#x4E2A;&#x8654;&#x8BDA;&#x7684;&#x5B97;&#x6559;&#x4FE1;&#x5F92;&#xFF0C;&#x4ED6;&#x4FE1;&#x5949;&#x7684;&#x662F;&#x5370;&#x5EA6;&#x7334;&#x795E;&#x54C8;&#x5974;&#x66FC;&#xFF0C;&#x5E76;&#x52AA;&#x529B;&#x5C06;&#x5B97;&#x6559;&#x7684;&#x6559;&#x4E49;&#x843D;&#x5B9E;&#x5230;&#x8A00;&#x884C;&#x4E2D;&#x53BB;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x751F;&#x6D3B;&#x4E2D;&#x663E;&#x5F97;&#x61A8;&#x539A;&#x800C;&#x6728;&#x8BB7;&#xFF0C;&#x5BFC;&#x6F14;&#x5728;&#x523B;&#x753B;&#x8FD9;&#x4E2A;&#x4EBA;&#x7269;&#x65F6;&#x660E;&#x663E;&#x5938;&#x5927;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x662F;&#x7537;&#x4E3B;&#x8003;&#x9AD8;&#x4E2D;&#x5C31;&#x8003;&#x4E86;10&#x6B21;&#xFF0C;&#x6700;&#x7EC8;&#x7236;&#x4EB2;&#x5C45;&#x7136;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x201C;&#x60CA;&#x559C;&#x201D;&#x800C;&#x53BB;&#x4E16;&#x3002;&#x7537;&#x4E3B;&#x5BC4;&#x8EAB;&#x5728;&#x7236;&#x4EB2;&#x8EAB;&#x524D;&#x7684;&#x597D;&#x53CB;&#x5BB6;&#x4E2D;&#xFF0C;&#x5E76;&#x9082;&#x9005;&#x4E86;&#x4E00;&#x4EFD;&#x201C;&#x574E;&#x5777;&#x201D;&#x7684;&#x7231;&#x60C5;&#x3002;&#x7537;&#x4E3B;&#x7684;&#x786E;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x4E16;&#x4EF7;&#x503C;&#x4E2D;&#x7684;&#x5931;&#x8D25;&#x8005;&#xFF0C;&#x6CA1;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5CB3;&#x7236;&#x8981;&#x6C42;&#x4ED6;&#x5728;&#x516D;&#x4E2A;&#x6708;&#x5185;&#x4E70;&#x4E00;&#x5957;&#x5A5A;&#x623F;&#xFF0C;&#x751A;&#x81F3;&#x4ECE;&#x88AB;&#x9ED1;&#x4E2D;&#x4ECB;&#x6B3A;&#x9A97;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4ED6;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x4EBA;&#x3002;&#x5584;&#x826F;&#x7684;&#x7537;&#x4E3B;&#x5728;&#x7334;&#x795E;&#x8282;&#x4E0A;&#x7ED9;&#x6C99;&#x5E0C;&#x8FBE;&#x4E70;&#x4E86;&#x8584;&#x997C;&#x548C;&#x996E;&#x6599;&#xFF0C;&#x6C99;&#x5E0C;&#x8FBE;&#x5C31;&#x8BA4;&#x5B9A;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x4FE1;&#x8D56;&#x7684;&#x4EBA;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x6545;&#x4E8B;&#x5C31;&#x6B64;&#x5C55;&#x5F00;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz68ktdwyxj20zk0k041k.jpg" alt="&#x5C0F;&#x5B69;&#x5B50;&#x90FD;&#x61C2;&#x5F97;&#x8BF4;&#x8C0E;" title>
                </div>
                <div class="image-caption">&#x5C0F;&#x5B69;&#x5B50;&#x90FD;&#x61C2;&#x5F97;&#x8BF4;&#x8C0E;</div>
            </figure>
<p>&#x2003;&#x2003;&#x5E15;&#x592B;&#x6700;&#x521D;&#x5E0C;&#x671B;&#x5411;&#x5370;&#x5EA6;&#x8B66;&#x65B9;&#x5BFB;&#x6C42;&#x5E2E;&#x52A9;&#xFF0C;&#x53EF;&#x8B66;&#x65B9;&#x8BA4;&#x4E3A;&#x8B66;&#x5BDF;&#x5C40;&#x5E76;&#x4E0D;&#x662F;&#x5B64;&#x513F;&#x9662;&#xFF0C;&#x62D2;&#x7EDD;&#x4E3A;&#x6C99;&#x5E0C;&#x8FBE;&#x63D0;&#x4F9B;&#x76F8;&#x5173;&#x5E2E;&#x52A9;&#x3002;&#x65E0;&#x5948;&#x4E4B;&#x4E0B;&#xFF0C;&#x5E15;&#x592B;&#x5C06;&#x5C0F;&#x5973;&#x5B69;&#x5E26;&#x56DE;&#x5CB3;&#x7236;&#x5BB6;&#x4E2D;&#xFF0C;&#x8D77;&#x521D;&#x4EBA;&#x4EEC;&#x89C1;&#x5230;&#x8FD9;&#x4E2A;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x5973;&#x5B69;&#xFF0C;&#x4E00;&#x5EA6;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x8FD9;&#x4E2A;&#x5C0F;&#x5973;&#x5B69;&#x6765;&#x81EA;&#x5370;&#x5EA6;&#x7684;&#x67D0;&#x4E2A;&#x9AD8;&#x8D35;&#x79CD;&#x59D3;&#x3002;&#x79CD;&#x59D3;&#x5236;&#x5EA6;&#x662F;&#x4E00;&#x79CD;&#x4EE5;&#x8840;&#x7EDF;&#x8BBA;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x7B49;&#x7EA7;&#x5236;&#x5EA6;&#xFF0C;&#x5E7F;&#x6CDB;&#x5B58;&#x5728;&#x4E8E;&#x5370;&#x5EA6;&#x793E;&#x4F1A;&#x8FD0;&#x4F5C;&#x4E0E;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x867D;&#x7136;&#x5370;&#x5EA6;&#x65E9;&#x5728;1947&#x5E74;&#x5C31;&#x8131;&#x79BB;&#x4E86;&#x82F1;&#x56FD;&#x6B96;&#x6C11;&#x8005;&#x7684;&#x7EDF;&#x6CBB;&#xFF0C;&#x53EF;&#x8FD9;&#x79CD;&#x5728;&#x6B96;&#x6C11;&#x65F6;&#x671F;&#x88AB;&#x56FA;&#x5B9A;&#x548C;&#x50F5;&#x5316;&#x7684;&#x5236;&#x5EA6;&#xFF0C;&#x5728;&#x4ECA;&#x5929;&#x4F9D;&#x65E7;&#x5F71;&#x54CD;&#x6DF1;&#x8FDC;&#x3002;&#x65E0;&#x72EC;&#x6709;&#x5076;&#xFF0C;&#x5370;&#x5DF4;&#x51B2;&#x7A81;&#x6B63;&#x662F;&#x82F1;&#x56FD;&#x6B96;&#x6C11;&#x7EDF;&#x6CBB;&#x8005;&#x5C06;&#x5370;&#x5EA6;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5730;&#x533A;&#x7EDF;&#x6CBB;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x7535;&#x5F71;&#x4E2D;&#x5370;&#x5EA6;&#x7684;&#x5370;&#x5730;&#x8BED;&#x548C;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x7684;&#x4E4C;&#x5C14;&#x90FD;&#x8BED;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x4E24;&#x95E8;&#x8BED;&#x8A00;&#x3002;&#x66FE;&#x7ECF;&#x6709;&#x4E24;&#x4E2A;&#x81EA;&#x547D;&#x4E0D;&#x51E1;&#x7684;&#x6C11;&#x65CF;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5FB7;&#x610F;&#x5FD7;&#x96C5;&#x4E3D;&#x5B89;&#x65CF;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6276;&#x6851;&#x56FD;&#x5927;&#x548C;&#x6C11;&#x65CF;&#xFF0C;&#x4E00;&#x8D77;&#x53D1;&#x52A8;&#x7B2C;&#x4E8C;&#x6B21;&#x4E16;&#x754C;&#x5927;&#x6218;&#xFF0C;&#x4E3A;&#x4E86;&#x6240;&#x8C13;&#x7684;&#x79CD;&#x65CF;&#x4F18;&#x8D8A;&#x6027;&#xFF0C;&#x5927;&#x8086;&#x8FEB;&#x5BB3;&#x72B9;&#x592A;&#x4EBA;&#x548C;&#x4E2D;&#x56FD;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;6&#x5C81;&#x7684;&#x5B69;&#x5B50;&#x56E0;&#x4E3A;&#x53EF;&#x7231;&#x5C31;&#x88AB;&#x8FEB;&#x8D34;&#x4E0A;&#x8FD9;&#x79CD;&#x79CD;&#x65CF;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4EBA;&#x7C7B;&#x7E41;&#x884D;&#x81F3;&#x4ECA;&#xFF0C;&#x8FD9;&#x79CD;&#x75C5;&#x6001;&#x7684;&#x865A;&#x8363;&#x5FC3;&#x4E0D;&#x89C9;&#x5F97;&#x53EF;&#x60B2;&#x5417;&#xFF1F;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz05napa0bj218g0tn1aa.jpg" alt="&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;" title>
                </div>
                <div class="image-caption">&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;</div>
            </figure>
<p>&#x2003;&#x2003;&#x5982;&#x679C;&#x8BF4;&#x8FD9;&#x79CD;&#x81EA;&#x5E26;&#x6B67;&#x89C6;&#x7684;&#x8D34;&#x6807;&#x7B7E;&#x884C;&#x4E3A;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4EBA;&#x7C7B;&#x7684;&#x4E00;&#x53A2;&#x60C5;&#x613F;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x6C99;&#x5E0C;&#x8FBE;&#x6240;&#x5230;&#x7684;&#x4E00;&#x5207;&#x4E8B;&#x60C5;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x672C;&#x80FD;&#x3002;&#x7537;&#x4E3B;&#x7684;&#x5CB3;&#x7236;&#x5BB6;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5370;&#x5EA6;&#x4F5B;&#x6559;&#x5F92;&#x5BB6;&#x5EAD;&#xFF0C;&#x6C99;&#x5E0C;&#x8FBE;&#x56E0;&#x4E3A;&#x53D7;&#x5230;&#x8089;&#x98DF;&#x7684;&#x8BF1;&#x60D1;&#x800C;&#x5230;&#x9886;&#x5C45;&#x5BB6;&#x5403;&#x9E21;&#x8089;&#xFF0C;&#x5F53;&#x5979;&#x9047;&#x5230;&#x6E05;&#x771F;&#x5BFA;&#x5C31;&#x4F1A;&#x50CF;&#x6BCD;&#x4EB2;&#x4E00;&#x6837;&#x88F9;&#x4E0A;&#x5934;&#x5DFE;&#x4E0A;&#x524D;&#x53C2;&#x62DC;&#x2026;&#x2026;&#x7537;&#x4E3B;&#x8D77;&#x521D;&#x4E0D;&#x613F;&#x610F;&#x6216;&#x8005;&#x8BF4;&#x4E0D;&#x6562;&#x53BB;&#x6E05;&#x771F;&#x5BFA;&#x5185;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x5B97;&#x6559;&#x4FE1;&#x4EF0;&#xFF0C;&#x8BA9;&#x4ED6;&#x4E60;&#x60EF;&#x6027;&#x5730;&#x53BB;&#x6392;&#x65A5;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x6587;&#x5316;&#x3002;&#x8FD9;&#x4F55;&#x5C1D;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5462;&#xFF1F;&#x4E00;&#x65E6;&#x957F;&#x5927;&#x4E09;&#x89C2;&#x5C31;&#x7279;&#x522B;&#x96BE;&#x66F4;&#x6539;&#xFF0C;&#x9762;&#x5BF9;&#x4E09;&#x89C2;&#x4E0D;&#x5408;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x51FA;&#x5947;&#x5730;&#x76F8;&#x4FE1;&#x5206;&#x624B;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x53EF;&#x4EBA;&#x7C7B;&#x4E0D;&#x66FE;&#x89C1;&#x8FC7;&#x4E00;&#x9897;&#x6052;&#x661F;&#x7684;&#x8BDE;&#x751F;&#x548C;&#x6D88;&#x4EA1;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x5C31;&#x56FA;&#x6267;&#x5730;&#x76F8;&#x4FE1;&#x8FD9;&#x77ED;&#x77ED;&#x51E0;&#x5341;&#x5E74;&#x91CC;&#x7684;&#x6240;&#x89C1;&#x6240;&#x95FB;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x5927;&#x53EF;&#x4E0D;&#x5FC5;&#x53BB;&#x63A5;&#x53D7;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x4E16;&#x95F4;&#x6709;&#x5343;&#x4E07;&#x79CD;&#x4E66;&#x5343;&#x4E07;&#x53E5;&#x8BDD;&#xFF0C;&#x6E10;&#x6E10;&#x5730;&#x4E30;&#x5BCC;&#x4E86;&#x6211;&#x4EEC;&#x539F;&#x672C;&#x67AF;&#x7AED;&#x7684;&#x751F;&#x547D;&#x3002;&#x7537;&#x4E3B;&#x7EA0;&#x7ED3;&#x4E8E;&#x8BE5;&#x4E0D;&#x8BE5;&#x5230;&#x6E05;&#x771F;&#x5BFA;&#x91CC;&#x62DB;&#x4EBA;&#xFF0C;&#x4ED6;&#x7684;&#x5973;&#x670B;&#x53CB;&#x5219;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x6C99;&#x5E0C;&#x8FBE;&#x53EA;&#x662F;&#x4E00;&#x4E2A;6&#x5C81;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x5B97;&#x6559;&#x5BF9;&#x5979;&#x6765;&#x8BF4;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x5462;&#xFF1F;&#x662F;&#x554A;&#xFF0C;&#x6211;&#x4EEC;&#x7B80;&#x7B80;&#x5355;&#x5355;&#x5730;&#x6765;&#x5230;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x7B49;&#x79BB;&#x5F00;&#x65F6;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x5E73;&#x6DFB;&#x4E86;&#x65E0;&#x6570;&#x4E2A;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x6211;&#x627F;&#x8BA4;&#xFF0C;&#x6C99;&#x5E0C;&#x8FBE;&#x4ECE;&#x80CC;&#x540E;&#x62B1;&#x4F4F;&#x7537;&#x4E3B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x5927;&#x7537;&#x4EBA;&#x5FC3;&#x91CC;&#x50CF;&#x662F;&#x88AB;&#x6E29;&#x6696;&#x5230;&#x4E86;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz05jqd82sj20zk0k0q4y.jpg" alt="&#x6C99;&#x5E0C;&#x8FBE;&#x50CF;&#x6BCD;&#x4EB2;&#x4E00;&#x6837;&#x53C2;&#x62DC;" title>
                </div>
                <div class="image-caption">&#x6C99;&#x5E0C;&#x8FBE;&#x50CF;&#x6BCD;&#x4EB2;&#x4E00;&#x6837;&#x53C2;&#x62DC;</div>
            </figure>
<p>&#x2003;&#x2003;&#x771F;&#x6B63;&#x63ED;&#x5F00;&#x5C0F;&#x5973;&#x5B69;&#x8EAB;&#x4EFD;&#x7684;&#x662F;&#x4E00;&#x573A;&#x7403;&#x8D5B;&#xFF0C;&#x4E00;&#x573A;&#x7279;&#x6B8A;&#x7684;&#x7403;&#x8D5B;&#xFF0C;&#x4E00;&#x573A;&#x53D1;&#x751F;&#x5728;&#x5370;&#x5EA6;&#x548C;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x95F4;&#x7684;&#x7403;&#x8D5B;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x5C0F;&#x5973;&#x5B69;&#x7684;&#x6BCD;&#x4EB2;&#x6000;&#x5B55;&#x671F;&#x95F4;&#x5C31;&#x662F;&#x5728;&#x770B;&#x4E00;&#x573A;&#x677F;&#x7403;&#x6BD4;&#x8D5B;&#x3002;&#x5728;&#x8FD9;&#x573A;&#x6BD4;&#x8D5B;&#x4E2D;&#xFF0C;&#x5370;&#x5EA6;&#x8F93;&#x6389;&#x4E86;&#x6BD4;&#x8D5B;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4E00;&#x8138;&#x5931;&#x843D;&#x65F6;&#xFF0C;&#x552F;&#x72EC;&#x6C99;&#x5E0C;&#x8FBE;&#x9AD8;&#x5174;&#x5730;&#x624B;&#x821E;&#x8DB3;&#x8E48;&#xFF0C;&#x751A;&#x81F3;&#x51B2;&#x5230;&#x7535;&#x89C6;&#x673A;&#x9762;&#x524D;&#xFF0C;&#x4EB2;&#x543B;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x56FD;&#x65D7;&#x3002;&#x7537;&#x4E3B;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x5730;&#x95EE;&#x5C0F;&#x5973;&#x5B69;&#xFF0C;&#x201C;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#xFF1F;&#x201D;&#x3002;&#x5C0F;&#x5973;&#x5B69;&#x7684;&#x786E;&#x8BA4;&#x8BA9;&#x7537;&#x4E3B;&#x60B2;&#x559C;&#x4EA4;&#x52A0;&#xFF0C;&#x559C;&#x7684;&#x662F;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x5C0F;&#x5973;&#x5B69;&#x7684;&#x8EAB;&#x4E16;&#xFF0C;&#x60B2;&#x7684;&#x662F;&#x4E24;&#x56FD;&#x79EF;&#x6028;&#x4E45;&#x77E3;&#x4E3A;&#x5CB3;&#x7236;&#x6240;&#x4E0D;&#x5BB9;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E24;&#x56FD;&#x66FE;&#x56E0;&#x4E3A;&#x6D41;&#x6C11;&#x800C;&#x5F15;&#x53D1;&#x6D41;&#x8840;&#x4E8B;&#x4EF6;&#xFF0C;&#x7535;&#x5F71;&#x4E2D;&#x7537;&#x4E3B;&#x5CB3;&#x7236;&#x4EC7;&#x89C6;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x4EBA;&#x7684;&#x539F;&#x56E0;&#x6070;&#x5728;&#x4E8E;&#x6B64;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x60F3;&#x5230;&#xFF0C;&#x963F;&#x7C73;&#x5C14;&#xB7;&#x6C57;&#x4E3B;&#x6F14;&#x7684;&#x7535;&#x5F71;PK&#x4E2D;&#xFF0C;&#x5973;&#x4E3B;&#x5609;&#x8C37;&#x7231;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x7A46;&#x65AF;&#x6797;&#x7537;&#x5B69;&#xFF0C;&#x7236;&#x6BCD;&#x5BF9;&#x7A46;&#x65AF;&#x6797;&#x7684;&#x504F;&#x89C1;&#x4EE5;&#x53CA;&#x5B97;&#x6559;&#x5BF9;&#x8FD9;&#x6BB5;&#x611F;&#x60C5;&#x7684;&#x5E72;&#x6D89;&#xFF0C;&#x5DEE;&#x70B9;&#x8BA9;&#x4E24;&#x4E2A;&#x771F;&#x5FC3;&#x76F8;&#x7231;&#x7684;&#x4EBA;&#x5206;&#x5F00;&#x3002;&#x7537;&#x4E3B;&#x518D;&#x6B21;&#x906D;&#x9047;&#x65E0;&#x5948;&#xFF0C;&#x4ED6;&#x524D;&#x5F80;&#x9886;&#x4E8B;&#x9986;&#x5E0C;&#x671B;&#x5BFB;&#x6C42;&#x9886;&#x4E8B;&#x9986;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x9886;&#x4E8B;&#x9986;&#x4EE5;&#x6C99;&#x5E0C;&#x8FBE;&#x6CA1;&#x6709;&#x62A4;&#x7167;&#x4E3A;&#x7531;&#xFF0C;&#x62D2;&#x7EDD;&#x4E3A;&#x7537;&#x4E3B;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x91CC;&#x5BFC;&#x6F14;&#x8BA9;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x4E86;&#x4E24;&#x56FD;&#x95F4;&#x7684;&#x51B2;&#x7A81;&#x5230;&#x5E95;&#x6709;&#x591A;&#x4E25;&#x91CD;&#xFF0C;&#x4E00;&#x573A;&#x52A8;&#x4E71;&#x5BFC;&#x81F4;&#x9886;&#x4E8B;&#x9986;&#x6682;&#x505C;&#x8425;&#x4E1A;&#x4E00;&#x4E2A;&#x6708;&#x3002;&#x7537;&#x4E3B;&#x901A;&#x8FC7;&#x5CB3;&#x7236;&#x4ECB;&#x7ECD;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x5BB6;&#x65C5;&#x6E38;&#x4E2D;&#x4ECB;&#x516C;&#x53F8;&#xFF0C;&#x5BF9;&#x65B9;&#x58F0;&#x79F0;&#x9700;&#x8981;12&#x4E07;&#x5362;&#x6BD4;(&#x7EA6;&#x5408;&#x4EBA;&#x6C11;&#x5E01;10000&#x591A;&#x5143;)&#xFF0C;&#x7537;&#x4E3B;&#x7684;&#x5973;&#x670B;&#x53CB;&#x751A;&#x81F3;&#x62FF;&#x51FA;&#x4E86;&#x51C6;&#x5907;&#x4E70;&#x623F;&#x5B50;&#x7684;&#x94B1;&#xFF0C;&#x53EF;&#x9ED1;&#x5FC3;&#x4E2D;&#x4ECB;&#x8F6C;&#x624B;&#x5C31;&#x628A;&#x6C99;&#x5E0C;&#x8FBE;&#x5356;&#x5230;&#x4E86;&#x5993;&#x9662;&#xFF0C;&#x4E00;&#x4E2A;6&#x5C81;&#x7684;&#x5C0F;&#x5973;&#x5B69;&#x554A;&#xFF0C;&#x5993;&#x9662;&#x662F;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF1F;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz05de92mcj20zk0k0qm5.jpg" alt="&#x5B89;&#x5168;&#x611F;&#x5341;&#x8DB3;&#x7684;&#x5927;&#x53D4;" title>
                </div>
                <div class="image-caption">&#x5B89;&#x5168;&#x611F;&#x5341;&#x8DB3;&#x7684;&#x5927;&#x53D4;</div>
            </figure>
<p>&#x2003;&#x2003;&#x7535;&#x5F71;&#x5F00;&#x59CB;&#x4ECB;&#x7ECD;&#x7537;&#x4E3B;&#x65F6;&#x8BF4;&#x4ED6;&#x5B66;&#x4E60;&#x4E0D;&#x597D;&#xFF0C;&#x66F4;&#x4E0D;&#x64C5;&#x957F;&#x4F53;&#x80B2;&#x8FD0;&#x52A8;(&#x6454;&#x8DE4;)&#x3002;&#x5993;&#x9662;&#x91CC;&#x7537;&#x4E3B;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x7684;&#x627E;&#x5C0F;&#x5973;&#x5B69;&#xFF0C;&#x5F53;&#x627E;&#x5230;&#x5C0F;&#x5973;&#x5B69;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#x7A81;&#x7136;&#x71C3;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x867D;&#x7136;&#x6309;&#x7167;&#x89D2;&#x8272;&#x8BBE;&#x5B9A;&#xFF0C;&#x7537;&#x4E3B;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x8EAB;&#x624B;&#xFF0C;&#x53EF;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x540D;&#x5370;&#x5EA6;&#x6F14;&#x5458;&#x8428;&#x5C14;&#x66FC;&#xB7;&#x6C57;&#xFF0C;&#x5C31;&#x662F;&#x4EE5;&#x5065;&#x8EAB;&#x8FBE;&#x4EBA;&#x7684;&#x79F0;&#x53F7;&#x95FB;&#x540D;&#x4E8E;&#x4E16;&#x7684;&#xFF0C;&#x636E;&#x8BF4;&#x4ED6;&#x53C2;&#x4E0E;&#x6F14;&#x51FA;&#x7684;&#x7535;&#x5F71;&#x90FD;&#x4F1A;&#x5B89;&#x6392;&#x88F8;&#x9732;&#x4E0A;&#x8EAB;&#x7684;&#x620F;&#x4EFD;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x6211;&#x4EEC;&#x5C31;&#x5F53;&#x505A;&#x4E3B;&#x89D2;&#x5149;&#x73AF;&#x597D;&#x5566;&#xFF0C;&#x751A;&#x81F3;&#x5F53;&#x770B;&#x5230;&#x9ED1;&#x4E2D;&#x4ECB;&#x5728;&#x7535;&#x7EBF;&#x4E0A;&#x8361;&#x79CB;&#x5343;&#x65F6;&#xFF0C;&#x5C0F;&#x5973;&#x5B69;&#x90A3;&#x7EAF;&#x771F;&#x7684;&#x7B11;&#x8138;&#xFF0C;&#x6211;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x53EA;&#x6709;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;&#x613F;&#x4F60;&#x88AB;&#x4E16;&#x754C;&#x6E29;&#x67D4;&#x5BF9;&#x5F85;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x5973;&#x5B69;&#xFF0C;&#x6211;&#x613F;&#x610F;&#x5979;&#x4E00;&#x76F4;&#x90FD;&#x957F;&#x4E0D;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5979;&#x9047;&#x5230;&#x4E86;&#x5584;&#x826F;&#x7684;&#x7334;&#x795E;&#x5927;&#x53D4;&#x3002;&#x6211;&#x5F88;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4EBA;&#x957F;&#x5927;&#x4EE5;&#x540E;&#xFF0C;&#x53CD;&#x800C;&#x66F4;&#x52A0;&#x4E0D;&#x60EE;&#x4E8E;&#x52C7;&#x9669;&#x6076;&#x7684;&#x7528;&#x5FC3;&#x53BB;&#x731C;&#x5EA6;&#x522B;&#x4EBA;&#xFF0C;&#x8FD9;&#x5230;&#x5E95;&#x662F;&#x4E00;&#x79CD;&#x6210;&#x719F;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x79CD;&#x5012;&#x9000;&#x3002;&#x4F60;&#x5927;&#x6982;&#x4E0D;&#x4F1A;&#x60F3;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x5370;&#x5EA6;&#x4EBA;&#xFF0C;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x4E00;&#x4E2A;&#x840D;&#x6C34;&#x76F8;&#x9022;&#x7684;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x4EBA;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x7B7E;&#x8BC1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5192;&#x7740;&#x88AB;&#x5F53;&#x505A;&#x95F4;&#x8C0D;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5077;&#x5077;&#x7A7F;&#x8FC7;&#x4E24;&#x56FD;&#x8FB9;&#x754C;&#x7684;&#x9632;&#x7EBF;&#xFF0C;&#x53EA;&#x4E3A;&#x4E86;&#x9001;&#x8FD9;&#x4E2A;&#x5C0F;&#x5973;&#x5B69;&#x56DE;&#x5BB6;&#xFF0C;&#x4F60;&#x8BF4;&#x4ED6;&#x4E0D;&#x4E3A;&#x535A;&#x773C;&#x7403;&#x51FA;&#x540D;&#xFF0C;&#x4E0D;&#x4E3A;&#x505A;&#x597D;&#x4E8B;&#x8C0B;&#x5229;&#xFF0C;&#x4ED6;&#x5230;&#x5E95;&#x662F;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x539F;&#x8C05;&#x6211;&#x8BF4;&#x53E5;&#x4FD7;&#x6C14;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7231;&#x554A;&#xFF01;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz01ywfi2bj20zk0k0q5u.jpg" alt="&#x516C;&#x4EA4;&#x8F66;&#x53F8;&#x673A;&#x7684;&#x795E;&#x52A9;&#x653B;" title>
                </div>
                <div class="image-caption">&#x516C;&#x4EA4;&#x8F66;&#x53F8;&#x673A;&#x7684;&#x795E;&#x52A9;&#x653B;</div>
            </figure>
<p>&#x2003;&#x2003;&#x5728;&#x7A7F;&#x8D8A;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x8FB9;&#x9632;&#x7EBF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7537;&#x4E3B;&#x575A;&#x6301;&#x8981;&#x5F97;&#x5230;&#x8FB9;&#x9632;&#x6218;&#x58EB;&#x7684;&#x6279;&#x51C6;&#x540E;&#x518D;&#x5165;&#x5883;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8BB2;&#x8FF0;&#x8BDA;&#x5B9E;&#x548C;&#x4FE1;&#x5FF5;&#x7684;&#x52B1;&#x5FD7;&#x6545;&#x4E8B;&#xFF0C;&#x53EF;&#x6211;&#x8FD8;&#x662F;&#x60F3;&#x8BF4;&#xFF0C;&#x9075;&#x4ECE;&#x67D0;&#x79CD;&#x4FE1;&#x5FF5;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6559;&#x6761;&#x5730;&#x7167;&#x672C;&#x5BA3;&#x79D1;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x9053;&#x5FB7;&#x548C;&#x6CD5;&#x5F8B;&#x5141;&#x8BB8;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x9002;&#x5F53;&#x53D8;&#x901A;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5F3A;&#x8C03;&#x9053;&#x5FB7;&#x548C;&#x6CD5;&#x5F8B;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x4E07;&#x7269;&#x7686;&#x865A;&#xFF0C;&#x4E07;&#x4E8B;&#x7686;&#x5EA7;&#x554A;&#xFF0C;&#x300A;&#x523A;&#x5BA2;&#x4FE1;&#x6761;&#x300B;&#x91CC;&#x523A;&#x5BA2;&#x7684;&#x4FE1;&#x4EF0;&#x662F;&#x6BCF;&#x4E00;&#x4EE3;&#x523A;&#x5BA2;&#x90FD;&#x5728;&#x8FFD;&#x6C42;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EE5;&#x963F;&#x6CF0;&#x5C14;&#x4E3A;&#x4F8B;&#xFF0C;&#x4ED6;&#x5E74;&#x8F7B;&#x65F6;&#x56E0;&#x4E3A;&#x6240;&#x7F57;&#x95E8;&#x795E;&#x6BBF;&#x4EFB;&#x52A1;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x800C;&#x88AB;&#x964D;&#x7EA7;&#x4E3A;&#x65B0;&#x624B;&#x523A;&#x5BA2;&#xFF0C;&#x5728;&#x5B8C;&#x6210;&#x523A;&#x6740;9&#x4E2A;&#x5723;&#x6BBF;&#x9A91;&#x58EB;&#x7684;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x4ED6;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x51B7;&#x9759;&#x800C;&#x6C89;&#x7740;&#xFF0C;&#x201C;&#x4E07;&#x7269;&#x7686;&#x865A;&#xFF0C;&#x4E07;&#x4E8B;&#x7686;&#x5141;&#x201D;&#x7684;&#x7406;&#x5FF5;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x6E05;&#x6670;&#x3002;&#x5E15;&#x592B;&#x5E38;&#x5E38;&#x8BF4;&#x4ED6;&#x5411;&#x54C8;&#x5974;&#x66FC;&#x795E;&#x4FDD;&#x8BC1;&#x6C38;&#x8FDC;&#x4E0D;&#x5077;&#x5077;&#x6478;&#x6478;&#xFF0C;&#x53EF;&#x4ED6;&#x5148;&#x540E;&#x8EB2;&#x5728;&#x6E05;&#x771F;&#x5BFA;&#x91CC;&#x3001;&#x8F66;&#x9876;&#x9003;&#x907F;&#x8B66;&#x5BDF;&#x641C;&#x6355;&#xFF0C;&#x53CD;&#x800C;&#x662F;&#x90A3;&#x4F4D;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x963F;&#x8A07;&#x4EE4;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#xFF0C;&#x7537;&#x4E3B;&#x8BF4;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x8FDB;&#x6E05;&#x771F;&#x5BFA;&#xFF0C;&#x963F;&#x8A07;&#x8BF4;&#x6E05;&#x771F;&#x5BFA;&#x4ECE;&#x6765;&#x4E0D;&#x9501;&#x95E8;&#xFF0C;&#x6240;&#x4EE5;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x53BB;&#x3002;&#x963F;&#x8A07;&#x9001;&#x7537;&#x4E3B;&#x4E00;&#x884C;&#x4E09;&#x4EBA;&#x79BB;&#x5F00;&#x540E;&#xFF0C;&#x4EE5;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x793C;&#x4EEA;&#x795D;&#x798F;&#x7537;&#x4E3B;&#xFF0C;&#x5E76;&#x8BE2;&#x95EE;&#x5728;&#x5370;&#x5EA6;&#x6559;&#x4E2D;&#x5982;&#x4F55;&#x8868;&#x8FBE;&#x795D;&#x798F;&#xFF0C;&#x968F;&#x540E;&#x4EE5;&#x5370;&#x5EA6;&#x6559;&#x793C;&#x4EEA;&#x5411;&#x7537;&#x4E3B;&#x884C;&#x793C;&#xFF0C;&#x5E76;&#x715E;&#x6709;&#x4ECB;&#x4E8B;&#x5730;&#x95EE;&#xFF0C;&#x201C;&#x54C8;&#x5974;&#x66FC;&#x795E;&#x5728;&#x8FD9;&#x91CC;&#x8FD8;&#x7BA1;&#x7528;&#xFF1F;&#x201D;&#x3002;&#x662F;&#x554A;&#xFF0C;&#x4E24;&#x4E2A;&#x4FE1;&#x4EF0;&#x4E0D;&#x540C;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x7D20;&#x6765;&#x76F8;&#x4E92;&#x4EC7;&#x89C6;&#xFF0C;&#x53EF;&#x5230;&#x4E86;&#x4EBA;&#x5BB6;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x8981;&#x7948;&#x6C42;&#x672C;&#x56FD;&#x7684;&#x795E;&#x7075;&#x62A4;&#x4F51;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x8BBD;&#x523A;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#xFF0C;&#x5B97;&#x6559;&#x5E76;&#x4E0D;&#x662F;&#x8981;&#x6559;&#x4F1A;&#x6211;&#x4EEC;&#x53BB;&#x6392;&#x65A5;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x5B66;&#x4F1A;&#x62E5;&#x6709;&#x4E00;&#x9897;&#x5305;&#x5BB9;&#x7684;&#x5FC3;&#xFF0C;&#x53EA;&#x8981;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x662F;&#x5584;&#x826F;&#x7684;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x4E0D;&#x4F1A;&#x8FDD;&#x80CC;&#x4EFB;&#x4F55;&#x5B97;&#x6559;&#x7684;&#x6559;&#x4E49;&#xFF0C;&#x4F5B;&#x5BB6;&#x8BB2;&#x56E0;&#x679C;&#xFF0C;&#x9053;&#x5BB6;&#x8BB2;&#x65E0;&#x4E3A;&#xFF0C;&#x5112;&#x5BB6;&#x8BB2;&#x4FEE;&#x8EAB;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x90FD;&#x662F;&#x529D;&#x4EBA;&#x5411;&#x5584;&#xFF0C;&#x5927;&#x6982;&#x7231;&#x662F;&#x4EBA;&#x7C7B;&#x5171;&#x540C;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x795E;&#x5171;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fz01ueoaczj20zk0k0770.jpg" alt="&#x963F;&#x8A07;&#x4EE5;&#x5370;&#x5EA6;&#x6559;&#x793C;&#x4EEA;&#x795D;&#x798F;&#x4F17;&#x4EBA;" title>
                </div>
                <div class="image-caption">&#x963F;&#x8A07;&#x4EE5;&#x5370;&#x5EA6;&#x6559;&#x793C;&#x4EEA;&#x795D;&#x798F;&#x4F17;&#x4EBA;</div>
            </figure>
<p>&#x2003;&#x2003;&#x4E00;&#x65E6;&#x660E;&#x767D;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x7406;&#x89E3;&#x7537;&#x4E3B;&#x63A5;&#x4E0B;&#x6765;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x7535;&#x8BDD;&#x91CC;&#x5411;&#x8B66;&#x5BDF;&#x6492;&#x8C0E;&#x4EE5;&#x8EB2;&#x907F;&#x8B66;&#x5BDF;&#x8FFD;&#x6355;&#x3001;&#x8EAB;&#x4E3A;&#x4E00;&#x4E2A;&#x5370;&#x5EA6;&#x6559;&#x5F92;&#x53C2;&#x62DC;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x795E;&#x6BBF;&#x3001;&#x5728;&#x8EAB;&#x4E0A;&#x8499;&#x4E0A;&#x9ED1;&#x8272;&#x8863;&#x888D;&#x4F2A;&#x88C5;&#x6210;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x5973;&#x5B50;&#x3001;&#x4EE5;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x793C;&#x4EEA;&#x5411;&#x5E2E;&#x52A9;&#x4ED6;&#x7684;&#x4EBA;&#x8868;&#x793A;&#x611F;&#x8C22;&#x2026;&#x2026;&#x6240;&#x8C13;&#x201C;&#x5927;&#x9053;&#x81F3;&#x7B80;&#x201C;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x76F8;&#x4E92;&#x53BB;&#x501F;&#x9274;&#x548C;&#x5B66;&#x4E60;&#x4E0D;&#x540C;&#x9886;&#x57DF;&#x91CC;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F8;&#x4E92;&#x5BF9;&#x7ACB;&#x548C;&#x6392;&#x65A5;&#x5F7C;&#x6B64;&#x3002;&#x300A;&#x7B11;&#x50B2;&#x6C5F;&#x6E56;&#x300B;&#x91CC;&#x7684;&#x4E94;&#x5CB3;&#x5251;&#x6D3E;&#xFF0C;&#x4E00;&#x5FC3;&#x60F3;&#x6210;&#x4E3A;&#x80FD;&#x548C;&#x5C11;&#x6797;&#x6B66;&#x5F53;&#x6297;&#x8861;&#x7684;&#x6C5F;&#x6E56;&#x52BF;&#x529B;&#xFF0C;&#x5176;&#x5B9E;&#x50CF;&#x5DE6;&#x51B7;&#x7985;&#x8FD9;&#x6837;&#x7684;&#x201C;&#x5B97;&#x5E08;&#x201D;&#x7EA7;&#x4EBA;&#x7269;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x4EE5;&#x534E;&#x5C71;&#x77F3;&#x58C1;&#x4E0A;&#x9B54;&#x6559;&#x957F;&#x8001;&#x7834;&#x9664;&#x5404;&#x6D3E;&#x5251;&#x6CD5;&#x7684;&#x56FE;&#x5F62;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x96C6;&#x7ED3;&#x5404;&#x6D3E;&#x6240;&#x957F;&#xFF0C;&#x521B;&#x9020;&#x4E00;&#x95E8;&#x65B0;&#x7684;&#x6B66;&#x529F;&#x5E76;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x5948;&#x4F55;&#x6C5F;&#x6E56;&#x4EBA;&#x7269;&#x4E00;&#x6837;&#x9003;&#x4E0D;&#x8FC7;&#x6743;&#x52BF;&#x7684;&#x8BF1;&#x60D1;&#xFF0C;&#x60F3;&#x8981;&#x626B;&#x9664;&#x9B54;&#x6559;&#x52BF;&#x529B;&#xFF0C;&#x5148;&#x7834;&#x6B66;&#x5F53;&#xFF0C;&#x518D;&#x706D;&#x5C11;&#x6797;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x72ED;&#x9698;&#x7684;&#x95E8;&#x6237;&#x4E4B;&#x89C1;&#xFF0C;&#x4E94;&#x5CB3;&#x5251;&#x6D3E;&#x7684;&#x8F89;&#x714C;&#x4E0D;&#x8FC7;&#x662F;&#x8F6C;&#x773C;&#x4E91;&#x70DF;&#x3002;&#x60F3;&#x60F3;&#x300A;&#x78A7;&#x8840;&#x5251;&#x300B;&#x91CC;&#x5927;&#x53CD;&#x6D3E;&#x7389;&#x771F;&#x5B50;&#xFF0C;&#x4E00;&#x4EBA;&#x4E00;&#x5251;&#x5C31;&#x6562;&#x4E0A;&#x534E;&#x5C71;&#x6311;&#x6218;&#xFF0C;&#x534E;&#x5C71;&#x6D3E;&#x7684;&#x8870;&#x843D;&#x53EF;&#x89C1;&#x4E00;&#x6591;&#x3002;&#x5982;&#x4ECA;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x88AB;&#x4E92;&#x8054;&#x7F51;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6587;&#x5316;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#xFF0C;&#x5B97;&#x6559;&#x5982;&#x662F;&#xFF0C;&#x6587;&#x5316;&#x5982;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x4EE5;&#x72ED;&#x9698;&#x7684;&#x6C11;&#x65CF;&#x89C2;&#x53BB;&#x5BA1;&#x89C6;&#x6211;&#x4EEC;&#x4E0D;&#x61C2;&#x7684;&#x6587;&#x5316;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x4F60;&#x4E0D;&#x61C2;&#x7684;&#x4E1C;&#x897F;Low&#x4E00;&#x6837;&#xFF0C;&#x5FC3;&#x6001;&#x8981;&#x5F00;&#x653E;&#xFF0C;&#x773C;&#x5149;&#x8981;&#x957F;&#x8FDC;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fyzcxzchbqj210o0fvjt5.jpg" alt="&#x7A81;&#x7136;&#x89C9;&#x5F97;&#x751F;&#x6D3B;&#x7F8E;&#x597D;&#x8D77;&#x6765;" title>
                </div>
                <div class="image-caption">&#x7A81;&#x7136;&#x89C9;&#x5F97;&#x751F;&#x6D3B;&#x7F8E;&#x597D;&#x8D77;&#x6765;</div>
            </figure>
<p>&#x2003;&#x2003;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x6709;&#x592A;&#x591A;&#x7684;&#x610F;&#x6599;&#x4E4B;&#x4E2D;&#xFF0C;&#x540C;&#x6837;&#x6709;&#x592A;&#x591A;&#x7684;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x3002;&#x6211;&#x77E5;&#x9053;&#x5C0F;&#x5973;&#x5B69;&#x4F1A;&#x548C;&#x6BCD;&#x4EB2;&#x91CD;&#x9022;&#xFF0C;&#x53EF;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x771F;&#x6B63;&#x6253;&#x52A8;&#x6211;&#x7684;&#x662F;&#x90A3;&#x4E00;&#x58F0;&#x53D4;&#x53D4;&#xFF1B;&#x6211;&#x77E5;&#x9053;&#x7537;&#x4E3B;&#x4F1A;&#x88AB;&#x8B66;&#x65B9;&#x902E;&#x6355;&#xFF0C;&#x53EF;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5DF4;&#x65B9;&#x4F1A;&#x60F3;&#x5230;&#x5C48;&#x6253;&#x6210;&#x62DB;&#xFF0C;&#x7406;&#x7531;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x5BF9;&#x65B9;&#x662F;&#x4E00;&#x4E2A;&#x5370;&#x5EA6;&#x4EBA;&#xFF1B;&#x6211;&#x77E5;&#x9053;&#x5C0F;&#x5973;&#x5B69;&#x5E76;&#x4E0D;&#x662F;&#x54D1;&#x5DF4;&#xFF0C;&#x53EF;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x539F;&#x6765;&#x8BF4;&#x51FA;&#x4E00;&#x53E5;&#x8BDD;&#x9700;&#x8981;&#x83AB;&#x5927;&#x7684;&#x52C7;&#x6C14;&#x2026;&#x2026;&#x8FD9;&#x91CC;&#x611F;&#x8C22;&#x90A3;&#x4E2A;&#x7535;&#x89C6;&#x53F0;&#x8BB0;&#x8005;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5A92;&#x4F53;&#x4EBA;&#x7684;&#x81EA;&#x6211;&#x4FEE;&#x517B;&#xFF1B;&#x611F;&#x8C22;&#x90A3;&#x4E2A;&#x6B63;&#x76F4;&#x7684;&#x8B66;&#x5B98;&#xFF0C;&#x4ED6;&#x6CA1;&#x6709;&#x7ED9;&#x4ED6;&#x7684;&#x56FD;&#x5BB6;&#x4E22;&#x8138;&#xFF1B;&#x611F;&#x8C22;&#x90A3;&#x4E9B;&#x51B2;&#x5F00;&#x8FB9;&#x9632;&#x7EBF;&#x7684;&#x5DF4;&#x57FA;&#x65AF;&#x5766;&#x4EBA;&#x6C11;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x529B;&#x91CF;&#x53EB;&#x505A;&#x6C11;&#x5FC3;&#x6240;&#x5411;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4E24;&#x4E2A;&#x56FD;&#x5BB6;&#x53EF;&#x4EE5;&#x50CF;&#x7535;&#x5F71;&#x4E00;&#x6837;&#x7F8E;&#x597D;&#xFF0C;&#x4E0D;&#x518D;&#x6709;&#x51B2;&#x7A81;&#xFF0C;&#x4E0D;&#x518D;&#x6709;&#x6D41;&#x8840;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x77E5;&#x9053;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x56F0;&#x96BE;&#x8FDC;&#x6BD4;&#x7535;&#x5F71;&#x4E2D;&#x7684;&#x591A;&#x2026;&#x2026;&#x53EF;&#x8FD9;&#x7684;&#x786E;&#x662F;&#x4E00;&#x7FA4;&#x6210;&#x5E74;&#x4EBA;&#x7684;&#x7AE5;&#x8BDD;&#xFF0C;&#x5C31;&#x50CF;&#x7535;&#x5F71;&#x6700;&#x7EC8;&#x5B9A;&#x683C;&#x5728;&#x6C99;&#x5E0C;&#x8FBE;&#x548C;&#x5979;&#x7684;&#x7334;&#x795E;&#x5927;&#x53D4;&#x62E5;&#x62B1;&#x5728;&#x4E00;&#x8D77;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x4E9B;&#x7F8E;&#x597D;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x53BB;&#x671F;&#x5F85;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x53BB;&#x8FFD;&#x5BFB;&#xFF0C;&#x5B83;&#x4EEC;&#x6216;&#x8BB8;&#x662F;&#x7231;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x6B63;&#x4E49;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x5584;&#x826F;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x4FE1;&#x5FF5;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x548C;&#x5E73;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x52C7;&#x6562;&#x2026;&#x2026;&#x6211;&#x731C;&#x4E2D;&#x4E86;&#x6545;&#x4E8B;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x4F9D;&#x7136;&#x4E3A;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x800C;&#x70ED;&#x6CEA;&#x76C8;&#x7736;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x5E76;&#x975E;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x77EB;&#x60C5;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x7B80;&#x5355;&#xFF0C;&#x7B80;&#x5355;&#x5230;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x4E0D;&#x5FC5;&#x7406;&#x89E3;&#x5F97;&#x90A3;&#x4E48;&#x6DF1;&#x523B;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x5355;&#x7EAF;&#x5730;&#x559C;&#x6B22;&#x7740;&#x4F60;&#x5374;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x6837;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x5F71;&#x8BC4;&#x7EC8;&#x4E8E;&#x5199;&#x5B8C;&#x5566;&#xFF0C;&#x665A;&#x5B89;&#xFF01;<em>^_^</em></p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fyzcuzsfgjj20zk0k079d.jpg" alt="&#x6C38;&#x6052;&#x7684;&#x77AC;&#x95F4;" title>
                </div>
                <div class="image-caption">&#x6C38;&#x6052;&#x7684;&#x77AC;&#x95F4;</div>
            </figure><script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2941880815/">米花之味：永远相信美好的事情</a></li><li><a href="https://qinyuanpei.github.io/posts/2462008667/">关于电影《暗杀》背后的故事和想法</a></li><li><a href="https://qinyuanpei.github.io/posts/1933583281/">愿你和我一样喜欢蛋炒饭</a></li><li><a href="http://www.davidfnck.com/talkshow/no_surprise_in_the_end.html/">预告片好过正片的电影</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2613006280/" rel="external">一念执着，千山无阻</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2613006280/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2613006280/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/印度/">印度</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/影评/">影评</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/电影/">电影</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2613006280/&title=《一念执着，千山无阻》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2613006280/&title=《一念执着，千山无阻》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2613006280/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《一念执着，千山无阻》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2613006280/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2613006280/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3668933172/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">邂逅AOP：说说JavaScript中的修饰器</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/115524443/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">漫谈应用程序重试策略及其实现</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2613006280/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2613006280/&title=《一念执着，千山无阻》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2613006280/&title=《一念执着，千山无阻》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2613006280/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《一念执着，千山无阻》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2613006280/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2613006280/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2613006280/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
