<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        异步Lambda表达式问题的探索 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x5404;&amp;#x4F4D;&amp;#x670B;&amp;#x53CB;&amp;#xFF0C;&amp;#x5927;&amp;#x5BB6;&amp;#x597D;&amp;#xFF0C;&amp;#x6B22;&amp;#x8FCE;&amp;#x5927;&amp;#x5BB6;&amp;#x5173;&amp;#x6CE8;&amp;#x6211;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;Payne&amp;#x">
<meta name="keywords" content="异步,编程,Lambda">
<meta property="og:type" content="article">
<meta property="og:title" content="异步Lambda表达式问题的探索">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/187480982/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x5404;&amp;#x4F4D;&amp;#x670B;&amp;#x53CB;&amp;#xFF0C;&amp;#x5927;&amp;#x5BB6;&amp;#x597D;&amp;#xFF0C;&amp;#x6B22;&amp;#x8FCE;&amp;#x5927;&amp;#x5BB6;&amp;#x5173;&amp;#x6CE8;&amp;#x6211;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;Payne&amp;#x">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix8rsjiej20sh0g0tav.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="异步Lambda表达式问题的探索">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x5404;&amp;#x4F4D;&amp;#x670B;&amp;#x53CB;&amp;#xFF0C;&amp;#x5927;&amp;#x5BB6;&amp;#x597D;&amp;#xFF0C;&amp;#x6B22;&amp;#x8FCE;&amp;#x5927;&amp;#x5BB6;&amp;#x5173;&amp;#x6CE8;&amp;#x6211;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;Payne&amp;#x">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix8rsjiej20sh0g0tav.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">异步Lambda表达式问题的探索</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">异步Lambda表达式问题的探索</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-04-15T21:10:47.000Z" itemprop="datePublished" class="page-time">
  2017-04-15
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/编程语言/">编程语言</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-异步Lambda表达式问题的探索" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">异步Lambda表达式问题的探索</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-04-15 21:10:47" datetime="2017-04-15T21:10:47.000Z" itemprop="datePublished">2017-04-15</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/编程语言/">编程语言</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        23 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5404;&#x4F4D;&#x670B;&#x53CB;&#xFF0C;&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x6211;&#x662F;Payne&#xFF0C;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x5730;&#x5740;&#x662F;:<a href="http://qinyuanpei.com" target="_blank" rel="noopener">http://qinyuanpei.com</a>&#x3002;&#x4ECA;&#x5929;&#x535A;&#x4E3B;&#x60F3;&#x548C;&#x5927;&#x5BB6;&#x63A2;&#x8BA8;&#x7684;&#x662F;&#xFF0C;.NET&#x4E2D;&#x5F02;&#x6B65;Lambda&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x8981;&#x4ECE;&#x516C;&#x53F8;&#x9996;&#x5E2D;&#x67B6;&#x6784;&#x63A8;&#x5E7F;&#x5185;&#x90E8;&#x6846;&#x67B6;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x8BF4;&#x8D77;&#x3002;&#x6211;&#x5176;&#x5B9E;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x5C31;&#x6709;&#x8FD9;&#x79CD;&#x5728;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x505A;&#x6280;&#x672F;&#x6F14;&#x8FDB;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x516C;&#x5171;&#x7C7B;&#x5E93;&#x3001;&#x56E2;&#x961F;Wiki&#x548C;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#x7B49;&#x5F62;&#x5F0F;&#x9010;&#x6B65;&#x5730;&#x63A8;&#x8FDB;&#x548C;&#x5B8C;&#x5584;&#x56E2;&#x961F;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x7684;&#x7EDF;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x5728;&#x4E1A;&#x52A1;&#x65B9;&#x5411;&#x548C;&#x6280;&#x672F;&#x9009;&#x578B;&#x4E0A;&#x57FA;&#x672C;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x56E2;&#x961F;&#x5185;&#x7684;&#x6280;&#x672F;&#x6F14;&#x8FDB;&#x5BF9;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x548C;&#x4EA4;&#x4ED8;&#x8D28;&#x91CF;&#x610F;&#x4E49;&#x91CD;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x80FD;&#x7406;&#x89E3;&#x9996;&#x5E2D;&#x67B6;&#x6784;&#x5728;&#x5185;&#x90E8;&#x63A8;&#x5E7F;&#x516C;&#x5171;&#x7C7B;&#x5E93;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x9664;&#x4E86;KPI&#x8FD9;&#x79CD;&#x529F;&#x5229;&#x6027;&#x7684;&#x76EE;&#x6807;&#x4EE5;&#x5916;&#xFF0C;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5BF9;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#x662F;&#x79EF;&#x6781;&#x800C;&#x6709;&#x5229;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x50B2;&#x6162;&#x7684;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x8BBE;&#x8BA1;&#x5F97;&#x4E0D;&#x597D;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E00;&#x5B9A;&#x4F1A;&#x5C1D;&#x8BD5;&#x53BB;&#x6539;&#x8FDB;&#x751A;&#x81F3;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#xFF0C;&#x6240;&#x4EE5;&#x67B6;&#x6784;&#x5E76;&#x975E;&#x662F;&#x4E00;&#x79CD;&#x865A;&#x65E0;&#x7F25;&#x7F08;&#x7684;&#x3001;&#x51ED;&#x7A7A;&#x60F3;&#x8C61;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x7684;&#x5B58;&#x5728;&#x5FC5;&#x987B;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x67D0;&#x79CD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6240;&#x4EE5;&#x6211;&#x59CB;&#x7EC8;&#x8BA4;&#x4E3A;&#xFF0C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5FC5;&#x987B;&#x7531;&#x4E00;&#x7EBF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x63D0;&#x70BC;&#x548C;&#x62BD;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x771F;&#x6B63;&#x7ECF;&#x5386;&#x8FC7;&#x201D;&#x5751;&#x201D;&#x7684;&#x4EBA;&#xFF0C;&#x624D;&#x4F1A;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#x56E2;&#x961F;&#x91CC;&#x6700;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x67B6;&#x6784;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x7531;&#x67D0;&#x4E9B;&#x6240;&#x8C13;&#x201D;&#x4E13;&#x5BB6;&#x201D;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F60;&#x53EA;&#x6709;&#x771F;&#x6B63;&#x4E86;&#x89E3;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x53BB;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x77E5;&#x9053;&#x76EE;&#x524D;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x4E2D;&#x6700;&#x8FEB;&#x5207;&#x9700;&#x8981;&#x53BB;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x867D;&#x7136;&#x8BF4;&#x56E2;&#x961F;&#x91CC;&#x6280;&#x672F;&#x5C42;&#x6B21;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#xFF0C;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x9009;&#x578B;&#x5FC5;&#x7136;&#x4F1A;&#x548C;&#x666E;&#x901A;&#x793E;&#x4F1A;&#x5B66;&#x95EE;&#x9898;&#x4E00;&#x6837;&#x5B58;&#x5728;&#x4F17;&#x53E3;&#x96BE;&#x8C03;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x53EF;&#x662F;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x8BBE;&#x8BA1;&#x5F97;&#x4E0D;&#x597D;&#x5B83;&#x5C31;&#x662F;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5F3A;&#x8FEB;&#x56E2;&#x961F;&#x6210;&#x5458;&#x5FC5;&#x987B;&#x53BB;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5B9E;&#x5728;&#x6709;&#x6096;&#x4E8E;&#x201D;&#x81EA;&#x7531;&#x201D;&#x548C;&#x201D;&#x5206;&#x4EAB;&#x201D;&#x7684;&#x9ED1;&#x5BA2;&#x6587;&#x5316;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6CA1;&#x6709;&#x94F6;&#x5F39;&#x53EF;&#x8A00;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x4E00;&#x52B3;&#x6C38;&#x9038;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x518D;&#x9AD8;&#x3001;&#x4EE3;&#x7801;&#x9C81;&#x68D2;&#x6027;&#x518D;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x6280;&#x672F;&#x6F14;&#x8FDB;&#x5E94;&#x8BE5;&#x91C7;&#x53D6;&#x201D;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5BF9;&#x5F85;&#x5DE5;&#x7A0B;&#x5E08;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x7ED9;&#x4ED6;&#x4EEC;&#x5145;&#x5206;&#x7684;&#x81EA;&#x7531;&#xFF0C;&#x201D;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x201D;&#x7684;&#x884C;&#x653F;&#x547D;&#x4EE4;&#x4E0D;&#x9002;&#x5408;&#x5DE5;&#x7A0B;&#x5E08;&#x6587;&#x5316;&#xFF0C;&#x81EA;&#x8BA1;&#x7B97;&#x673A;&#x6587;&#x660E;&#x8BDE;&#x751F;&#x4EE5;&#x6765;&#xFF0C;&#x90A3;&#x79CD;&#x6765;&#x81EA;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x7684;&#x201D;&#x6781;&#x5BA2;&#x601D;&#x7EF4;&#x201D;&#x51B3;&#x5B9A;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x57FA;&#x56E0;&#xFF0C;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x201D;&#x8BF7;&#x539F;&#x8C05;&#x6211;&#x4E00;&#x751F;&#x4E0D;&#x7F81;&#x653E;&#x7EB5;&#x7231;&#x81EA;&#x7531;&#x201D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x672C;&#x8EAB;&#xFF0C;&#x95EE;&#x9898;&#x4EA7;&#x751F;&#x7684;&#x6839;&#x6E90;&#x6765;&#x81EA;ICommand&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x8BE5;&#x63A5;&#x53E3;&#x4E3B;&#x8981;&#x627F;&#x62C5;&#x547D;&#x4EE4;&#x7ED1;&#x5B9A;&#x4F5C;&#x7528;&#x3002;&#x901A;&#x8FC7;ICommand&#x63A5;&#x53E3;&#x7684;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#xFF0C;ICommand&#x63A5;&#x53E3;&#x7684;Execute&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5E38;&#x89C4;&#x7684;&#x505A;&#x6CD5;&#x5982;RelayCommand&#x6216;&#x8005;DelegateCommand&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x4F20;&#x5165;&#x4E00;&#x4E2A;Action&#x6765;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x7EC8;ICommand&#x63A5;&#x53E3;&#x4E2D;&#x7684;Execute&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8FD9;&#x4E2A;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x3002;&#x622A;&#x6B62;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B56;&#x7565;&#x5728;&#x4E3B;&#x6D41;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x90FD;&#x5B9E;&#x65BD;&#x5F97;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5F15;&#x5165;Task&#x3001;async/await&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7A81;&#x7136;&#x53D1;&#x73B0;ICommand&#x63A5;&#x53E3;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x4E9F;&#x5F85;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5B83;&#x7F3A;&#x4E4F;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x5F02;&#x6B65;&#x673A;&#x5236;&#x7684;Execute&#x65B9;&#x6CD5;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5386;&#x53F2;&#x9057;&#x7559;&#x95EE;&#x9898;&#x3002;<br>&#x2003;&#x2003;<br>&#x2003;&#x2003;&#x6211;&#x5F00;&#x59CB;&#x5173;&#x6CE8;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5F53;&#x6211;&#x5728;&#x540C;&#x4E8B;John&#x548C;Charles&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x4F18;&#x79C0;&#x7684;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5728;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7406;&#x89E3;&#x548C;&#x63A2;&#x8BA8;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x8981;&#x7279;&#x522B;&#x611F;&#x8C22;&#x4ED6;&#x4EEC;&#x613F;&#x610F;&#x5206;&#x4EAB;&#x4ED6;&#x4EEC;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A;<br></p><figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span> RelayCommand RunCommand</span><br><span class="line">{</span><br><span class="line">  <span class="keyword">get</span></span><br><span class="line">  {</span><br><span class="line">    <span class="keyword">return</span> <span class="keyword">new</span> RelayCommand(<span class="keyword">async</span> ()=&gt;{</span><br><span class="line">      <span class="comment">/* await awaitable */</span></span><br><span class="line">    });</span><br><span class="line">  }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x8BF7;&#x76F8;&#x4FE1;&#x4F60;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6CA1;&#x6709;&#x770B;&#x9519;&#xFF0C;&#x8BA9;&#x6211;&#x500D;&#x611F;&#x7EA0;&#x7ED3;&#x7684;&#x7684;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x8BA9;&#x6211;&#x8FF7;&#x60D1;&#x7684;&#x5730;&#x65B9;&#x6709;&#x4E24;&#x5904;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;RelayCommand&#x5B9E;&#x73B0;&#x4E86;ICommand&#x63A5;&#x53E3;&#xFF0C;&#x800C;ICommand&#x63A5;&#x53E3;&#x7684;Execute&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x91CC;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;Action&#x8FD9;&#x79CD;&#x59D4;&#x6258;&#x7C7B;&#x578B;&#x6765;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5305;&#x88C5;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;Action&#x662F;&#x4E00;&#x4E2A;void&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#x65E0;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x59D4;&#x6258;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x663E;&#x7136;&#x4F7F;&#x7528;async&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x4E86;&#x4E00;&#x4E2A;&#x65E0;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x533F;&#x540D;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x4E86;await&#x8BED;&#x6CD5;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5FAE;&#x8F6F;&#x5B98;&#x65B9;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#xFF0C;&#x4F7F;&#x7528;async&#x5173;&#x952E;&#x5B57;&#x6765;&#x4FEE;&#x9970;&#x4E00;&#x4E2A;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x4E3A;Task&#x6216;&#x8005;Task<t>&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x6211;&#x4E86;&#x89E3;&#x5230;async&#x5173;&#x952E;&#x5B57;&#x8FD8;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x4EE5;&#x540E;&#xFF0C;&#x5BF9;&#x7B2C;&#x4E8C;&#x5904;&#x7591;&#x60D1;&#x6211;&#x7A0D;&#x7A0D;&#x6709;&#x4E9B;&#x8BB8;&#x91CA;&#x6000;&#xFF0C;&#x56E0;&#x4E3A;&#x4E8B;&#x5B9E;&#x4E0A;Charles&#x5C31;&#x662F;&#x6B63;&#x5F0F;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x601D;&#x8DEF;&#x6765;&#x542F;&#x53D1;&#x6211;&#xFF0C;&#x53EF;&#x6211;&#x59CB;&#x7EC8;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x7684;&#x65B9;&#x6CD5;&#x91CC;&#x6267;&#x884C;&#x4E00;&#x6BB5;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x8BD5;&#x56FE;&#x53BB;&#x5B89;&#x6170;&#x81EA;&#x5DF1;&#x8BF4;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x8017;&#x65F6;&#x7684;&#x4EFB;&#x52A1;&#x65F6;&#x754C;&#x9762;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x3002;</t></p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x9700;&#x8981;&#x5728;&#x6574;&#x4E2A;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6D88;&#x606F;&#x4F1A;&#x5B9E;&#x65F6;&#x5730;&#x8F93;&#x51FA;&#x5230;&#x754C;&#x9762;&#x4E0A;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x754C;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4E3A;&#x6B64;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF0C;&#x6240;&#x6709;&#x9700;&#x8981;&#x53D1;&#x9001;&#x5B9E;&#x65F6;&#x6D88;&#x606F;&#x7684;&#x6A21;&#x5757;&#x88AB;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x4E3B;&#x9898;&#xFF0C;&#x800C;&#x754C;&#x9762;&#x6A21;&#x5757;&#x3001;&#x65E5;&#x5FD7;&#x6A21;&#x5757;&#x7B49;&#x88AB;&#x62BD;&#x8C61;&#x4E3A;&#x6D88;&#x606F;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x6240;&#x6709;&#x8BA2;&#x9605;&#x8FC7;&#x7684;&#x6D88;&#x606F;&#x4E3B;&#x9898;&#x90FD;&#x4F1A;&#x5C06;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x5230;&#x6D88;&#x606F;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x76EE;&#x524D;&#x5728;&#x8BBE;&#x8BA1;&#x4E0A;&#x662F;&#x7B26;&#x5408;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x7684;&#x3002;&#x53EF;&#x662F;&#x5F88;&#x5FEB;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x7528;await&#x6216;&#x8005;Wait()&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x6D88;&#x606F;&#x5E76;&#x4E0D;&#x662F;&#x5B9E;&#x65F6;&#x5730;&#x53D1;&#x9001;&#x5230;&#x754C;&#x9762;&#x4E0A;&#x53BB;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x77E5;&#x9053;await&#x6216;&#x8005;Wait()&#x65B9;&#x6CD5;&#x4F1A;&#x4E00;&#x76F4;&#x7B49;&#x5F85;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x6D88;&#x606F;&#x4F1A;&#x5728;&#x4EFB;&#x52A1;&#x7ED3;&#x675F;&#x7684;&#x4E00;&#x77AC;&#x95F4;&#x88AB;&#x5168;&#x90E8;&#x53D1;&#x9001;&#x5230;&#x754C;&#x9762;&#x4E0A;&#xFF0C;&#x8FD9;&#x663E;&#x793A;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x671F;&#x671B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;Execute()&#x65B9;&#x6CD5;&#x91CC;&#x6267;&#x884C;&#x7684;&#x5FC5;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F20;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x65B9;&#x6CD5;&#x800C;&#x6539;&#x53D8;&#xFF0C;&#x51B5;&#x4E14;&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;&#x662F;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;await&#x8BED;&#x6CD5;&#x4FEE;&#x6539;&#x4E3A;Task.Run()&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x5728;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x524D;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#x5C31;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x800C;&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x66F4;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;.NET&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x59D4;&#x6258;&#x3001;&#x533F;&#x540D;&#x65B9;&#x6CD5;&#x3001;Lambda&#x8868;&#x8FBE;&#x5F0F;&#x548C;Task&#x662F;&#x4E0D;&#x540C;&#x65F6;&#x671F;.NET&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;async&#x5173;&#x952E;&#x5B57;&#x6765;&#x4FEE;&#x9970;&#x4E00;&#x4E2A;&#x533F;&#x540D;&#x65B9;&#x6CD5;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x5904;&#x7406;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x5230;&#x5E95;&#x4F1A;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x59D4;&#x6258;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x6210;&#x4E00;&#x4E2A;&#x5305;&#x88C5;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x5B83;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="highlight typescript"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">static</span> <span class="built_in">void</span> Main(<span class="built_in">string</span>[] args)</span><br><span class="line">{</span><br><span class="line">  Action action1 = <span class="keyword">async</span> () =&gt; <span class="keyword">await</span> DoWorkAsync();</span><br><span class="line">  Action action2 = <span class="function"><span class="params">()</span> =&gt;</span> DoWork();</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x91CC;&#x58F0;&#x660E;&#x4E86;&#x4E24;&#x4E2A;Action&#xFF0C;&#x5373;&#x4E24;&#x4E2A;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x59D4;&#x6258;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#x524D;&#x8005;&#x4F7F;&#x7528;&#x4E86;async/await&#x8FD9;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x8005;&#x751F;&#x6210;&#x7684;IL&#x4EE3;&#x7801;&#x662F;&#x5426;&#x6709;&#x533A;&#x522B;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;IL DASM&#x6216;&#x8005;&#x662F;IL Spy&#x8FD9;&#x4E24;&#x4E2A;&#x5DE5;&#x5177;&#x6765;&#x67E5;&#x770B;IL&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzix8rsjiej20sh0g0tav.jpg" alt="&#x67E5;&#x770B;IL&#x4EE3;&#x7801;" title>
                </div>
                <div class="image-caption">&#x67E5;&#x770B;IL&#x4EE3;&#x7801;</div>
            </figure>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x4E24;&#x70B9;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x4E24;&#x4E2A;&#x59D4;&#x6258;&#x7C7B;&#x578B;&#x751F;&#x6210;&#x7684;&#x4E2D;&#x95F4;&#x4EE3;&#x7801;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF0C;&#x90FD;&#x662F;<strong>CachedAnonymousMethodDelegate</strong>&#xFF0C;&#x8FD9;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BF4;&#x660E;&#x4E0D;&#x7BA1;Action&#x91CC;&#x5305;&#x88C5;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x7EC8;&#x751F;&#x6210;&#x7684;IL&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x7B2C;&#x4E8C;&#xFF0C;&#x540C;&#x533F;&#x540D;&#x65B9;&#x6CD5;&#x548C;&#x6269;&#x5C55;&#x65B9;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;async/await&#x5E76;&#x672A;&#x5F15;&#x5165;&#x65B0;&#x7684;IL&#x6307;&#x4EE4;&#xFF0C;async/await&#x5185;&#x90E8;&#x5E94;&#x8BE5;&#x662F;&#x5728;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x673A;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x548C;yield&#x5173;&#x952E;&#x5B57;&#x5E94;&#x8BE5;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x7684;&#x533F;&#x540D;&#x65B9;&#x6CD5;(&#x6307;voild&#x7C7B;&#x578B;)&#xFF0C;&#x901A;&#x8FC7;IL&#x4EE3;&#x7801;&#x53EF;&#x77E5;&#x5B83;&#x662F;&#x7531;<a href="http://msdn.microsoft.com/en-us/library/system.runtime.compilerservices.asyncvoidmethodbuilder.aspx" target="_blank" rel="noopener">AsyncVoidMethodBuilder</a>&#x7C7B;&#x6765;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x7684;&#x65B9;&#x6CD5;(&#x6307;Task&#x548C;Task<t>&#x7C7B;&#x578B;)&#xFF0C;&#x5219;&#x662F;&#x7531;<a href="http://msdn.microsoft.com/en-us/library/system.runtime.compilerservices.asynctaskmethodbuilder.aspx" target="_blank" rel="noopener">AsyncTaskMethodBuilder</a>&#x7C7B;&#x6765;&#x751F;&#x6210;&#xFF0C;&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#x8FD9;&#x4E24;&#x8005;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x76F8;&#x5DEE;&#x65E0;&#x51E0;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#x5C31;&#x5728;&#x4E8E;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3002;</t></p>
<p>&#x2003;&#x2003;&#x5173;&#x4E8E;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x4E2D;&#x5F02;&#x5E38;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x8001;&#x8D75;&#x5728;&#x5176;&#x535A;&#x5BA2;<a href="http://blog.zhaojie.me/2012/04/exception-handling-in-csharp-async-await-1.html" target="_blank" rel="noopener">&#x5173;&#x4E8E;C#&#x4E2D;async/await&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#xFF08;&#x4E0A;&#xFF09;</a>&#x548C; <a href="http://blog.zhaojie.me/2012/04/exception-handling-in-csharp-async-await-2.html" target="_blank" rel="noopener">&#x5173;&#x4E8E;C#&#x4E2D;async/await&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#xFF08;&#x4E0B;&#xFF09;</a>&#x8FD9;&#x4E24;&#x7BC7;&#x535A;&#x5BA2;&#x4E2D;&#x505A;&#x4E86;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x6709;&#x65F6;&#x95F4;&#x7684;&#x8BDD;&#x53BB;&#x9605;&#x8BFB;&#x8FD9;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x5173;&#x6CE8;&#x7ED3;&#x8BBA;&#x5C31;&#x597D;&#x3002;<br>&#x2003;&#x2003;<br>&#x2003;&#x2003;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;async Task&#x6216;&#x8005;async Task<t>&#x65B9;&#x6CD5;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x4F1A;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x5E76;&#x5C06;&#x5176;&#x653E;&#x7F6E;&#x5728;Task&#x5BF9;&#x8C61;&#x91CC;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;Task&#x5BF9;&#x8C61;&#x88AB;await&#x65F6;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002;&#x7279;&#x522B;&#x5730;&#xFF0C;&#x5728;&#x8C03;&#x7528;Task.WhenAll()&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;Task&#x5BF9;&#x8C61;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x542B;&#x6709;&#x591A;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;&#x6B64;&#x65F6;await&#x4EC5;&#x4EC5;&#x4F1A;&#x91CD;&#x65B0;&#x629B;&#x51FA;&#x7B2C;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x5728; Task &#x4E0A;&#x4F7F;&#x7528; Task.Wait &#x6216; Task.Result &#x540C;&#x6B65;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x5F02;&#x5E38;&#x90FD;&#x4F1A;&#x7528; AggregateException &#x5305;&#x88C5;&#x540E;&#x5F15;&#x53D1;&#x3002;&#x5BF9;&#x4E8E;&#x5D4C;&#x5957;&#x7684;Task&#xFF0C;&#x5373;&#x542B;&#x6709;&#x5B50;&#x4EFB;&#x52A1;&#x7684;Task&#xFF0C;&#x5E94;&#x8BE5;&#x91C7;&#x7528;AggregateException&#x6765;&#x83B7;&#x53D6;&#x548C;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#x3002;Task/Task<t>&#x4E2D;&#x672A;&#x6355;&#x83B7;&#x7684;&#x5F02;&#x5E38;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;TaskScheduler.UnobservedTaskException&#x6765;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x4E0D;&#x4F1A;&#x7EE7;&#x7EED;&#x5411;&#x4E0A;&#x629B;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x9000;&#x51FA;&#x3002;<br>&#x2003;&#x2003;<br>&#x2003;&#x2003;async void&#x65B9;&#x6CD5;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;Task&#x5BF9;&#x8C61;&#x6765;&#x653E;&#x7F6E;&#x5F02;&#x5E38;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x7684;&#x5F02;&#x5E38;SynchronizationContext&#x4E0A;&#x5F15;&#x53D1;&#xFF0C;&#x800C;&#x4E14;&#x56E0;&#x4E3A;<a href="http://msdn.microsoft.com/en-us/library/system.runtime.compilerservices.asyncvoidmethodbuilder.aspx" target="_blank" rel="noopener">AsyncVoidMethodBuilder</a>&#x5185;&#x90E8;&#x5E76;&#x6CA1;&#x6709;&#x4F7F;&#x7528;TaskScheduler&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;async void&#x65B9;&#x6CD5;&#x6765;&#x8BF4;&#xFF0C;&#x7EBF;&#x7A0B;&#x6C60;&#x4E2D;&#x672A;&#x6355;&#x83B7;&#x7684;&#x5F02;&#x5E38;&#x5C06;&#x4F1A;&#x4E00;&#x76F4;&#x5411;&#x4E0A;&#x629B;&#x5E76;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;AppDomain.UnhandledException&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E2D;&#x6355;&#x6349;&#x5230;&#x8FD9;&#x4E9B;&#x201D;&#x672A;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x201D;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x80FD;&#x963B;&#x6B62;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#xFF0C;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6CE8;&#x518C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x6765;&#x8BB0;&#x5F55;&#x5F02;&#x5E38;&#x65E5;&#x5FD7;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x3002;</t></t></p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5F00;&#x59CB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x77E5;&#x9053;async Task&#x548C;async Task<t>&#x5F15;&#x53D1;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x662F;&#x7A0B;&#x5E8F;&#x7ACB;&#x5373;&#x7EC8;&#x6B62;&#xFF0C;&#x9664;&#x975E;&#x6211;&#x4EEC;&#x663E;&#x5F0F;&#x5730;&#x53BB;await&#x4E00;&#x4E2A;Task&#x5BF9;&#x8C61;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF0C;&#x53EF;&#x662F;&#x5BF9;async void&#x6765;&#x8BB2;&#xFF0C;&#x4E00;&#x65E6;&#x5B83;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF0C;&#x5E38;&#x89C4;&#x7684;try-catch&#x65F6;&#x65E0;&#x6CD5;&#x6355;&#x6349;&#x5230;&#x5F02;&#x5E38;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x201D;&#x672A;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x201D;&#x4F1A;&#x4E00;&#x76F4;&#x5411;&#x4E0A;&#x629B;&#x5E76;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#x3002;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BF4;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x6587;&#x7AE0;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x7684;lambda&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6700;&#x7EC8;&#x5B83;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x4E3A;async void&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x4F1A;&#x4E86;&#x89E3;&#x5230;&#xFF0C;async void&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5F15;&#x53D1;&#x672A;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x5E76;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x9000;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x5FAE;&#x8F6F;&#x5B98;&#x65B9;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x4E2D;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;async void&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;async void&#x5C31;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x8981;&#x53BB;&#x6355;&#x83B7;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#x3002;&#x53EF;&#x662F;&#x5BF9;&#x6807;&#x8BB0;&#x4E3A;async&#x7684;lambda&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x975E;&#x5E38;&#x9690;&#x853D;&#x800C;&#x4E14;&#x86CB;&#x75BC;&#x7684;&#xFF0C;&#x6216;&#x8BB8;&#x4E0D;&#x4F7F;&#x7528;async void&#x5C31;&#x662F;&#x6700;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#x4E86;&#x5427;&#xFF01;</t></p>
<p>&#x2003;&#x2003;&#x6700;&#x540E;&#xFF0C;&#x5176;&#x5B9E;&#x5766;&#x767D;&#x8BB2;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x6E05;&#x695A;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x6211;&#x5230;&#x5E95;&#x8BF4;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5728;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x91CD;&#x8981;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5BB9;&#x6613;&#x88AB;&#x6211;&#x4EEC;&#x7ED9;&#x5FFD;&#x7565;&#x5566;&#x3002;&#x6211;&#x6700;&#x521D;&#x5173;&#x6CE8;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5B8C;&#x5168;&#x662F;&#x56E0;&#x4E3A;&#x597D;&#x5947;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x89C1;&#x5230;&#x8FC7;&#x8FD9;&#x79CD;lambda&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5199;&#x6CD5;&#xFF0C;&#x867D;&#x7136;&#x7EA0;&#x7ED3;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x548C;&#x5B54;&#x4E59;&#x5DF1;&#x8BA8;&#x8BBA;&#x8334;&#x9999;&#x8C46;&#x7684;&#x201D;&#x8334;&#x201D;&#x5B57;&#x7531;&#x51E0;&#x79CD;&#x5199;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x8FC2;&#x8150;&#x4E0D;&#x582A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x53EF;&#x6211;&#x5E86;&#x5E78;&#x8FD9;&#x4EFD;&#x597D;&#x5947;&#x8BA9;&#x6211;&#x4E86;&#x89E3;&#x5230;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5176;&#x5B9E;&#x603B;&#x7ED3;&#x4E0B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x5173;&#x6CE8;&#x7684;&#x70B9;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x7531;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#x548C;&#x5F02;&#x6B65;&#x65B9;&#x6CD5;&#x5305;&#x88C5;&#x7684;&#x59D4;&#x6258;&#x7C7B;&#x578B;&#x5728;IL&#x5C42;&#x9762;&#x4E0A;&#x662F;&#x65E0;&#x5DEE;&#x522B;&#x7684;&#xFF0C;&#x59D4;&#x6258;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x53C2;&#x6570;&#x5217;&#x8868;&#x548C;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;&#x548C;&#x662F;&#x5426;&#x6709;async&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x3002;</li>
<li>&#x533F;&#x540D;&#x65B9;&#x6CD5;&#x6216;&#x8005;lambda&#x6700;&#x7EC8;&#x4F9D;&#x7136;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x4E3A;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x6709;async&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;Func&#x800C;&#x4E0D;&#x662F;Action&#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x8005;&#x53EF;&#x4EE5;&#x751F;&#x6210;async Task&#x6216;&#x8005;async Task<t>&#xFF0C;&#x800C;&#x540E;&#x8005;&#x4EC5;&#x4EC5;&#x53EF;&#x4EE5;&#x751F;&#x6210;async void&#x3002;</t></li>
<li>async Task/async Task<t>&#x548C;async void&#x5728;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x673A;&#x5236;&#x4E0A;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#xFF0C;&#x524D;&#x8005;&#x672A;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x4E0D;&#x4F1A;&#x7EE7;&#x7EED;&#x5411;&#x4E0A;&#x629B;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x9000;&#x51FA;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x672A;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x4F1A;&#x7EE7;&#x7EED;&#x5411;&#x4E0A;&#x629B;&#x5E76;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x9000;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x575A;&#x6301;&#x8981;&#x4F7F;&#x7528;async void&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x5904;&#x7406;&#x5404;&#x79CD;&#x5F02;&#x5E38;&#x3002;</t></li>
</ul>
<hr>
<p>&#x53C2;&#x8003;&#x6587;&#x7AE0;&#xFF1A;<br><a href="https://www.baidu.com/link?url=f9umAhHAgIYBz5X8dwyjUnu1g8w9RCPtJohhtnWsxDW8BdwLHKFVP0hA1sg0PwOTBF6zKP7AlEPZKiDYgLGleK&amp;wd=&amp;eqid=e9ff05d4000bd133000000035921a2ab" target="_blank" rel="noopener">Microsoft - async/await - &#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x6700;&#x4F73;&#x505A;&#x6CD5;</a><br><a href="http://www.cnblogs.com/TianFang/archive/2012/12/24/2831341.html" target="_blank" rel="noopener">TianFang - C# 5.0 async &#x51FD;&#x7684;&#x63D0;&#x793A;&#x548C;&#x6280;&#x5DE7;</a></p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2041685704/">C#中Socket通信编程的异步实现</a></li><li><a href="https://qinyuanpei.github.io/posts/2171683728/">函数式编程常用术语</a></li><li><a href="http://linfuyan.com/$q_and_promise_in_angular/">形象的讲解 angular 中的 $q 与 promise</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/187480982/" rel="external">异步Lambda表达式问题的探索</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/187480982/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/187480982/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Lambda/">Lambda</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/异步/">异步</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/编程/">编程</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/187480982/&title=《异步Lambda表达式问题的探索》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/187480982/&title=《异步Lambda表达式问题的探索》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/187480982/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《异步Lambda表达式问题的探索》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/187480982/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/187480982/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/570888918/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">基于过滤器实现异常处理的探索</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1444577573/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Redis缓存技术学习系列之发布订阅</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/187480982/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/187480982/&title=《异步Lambda表达式问题的探索》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/187480982/&title=《异步Lambda表达式问题的探索》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/187480982/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《异步Lambda表达式问题的探索》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/187480982/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/187480982/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/187480982/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
