<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        《大护法》—— 花生镇里的成人童话 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x731B;&amp;#x7136;&amp;#x95F4;&amp;#x9A7B;&amp;#x8DB3;&amp;#x56DE;&amp;#x9996;&amp;#x8FD9;&amp;#x4E9B;&amp;#x9519;&amp;#x843D;&amp;#x7684;&amp;#x65E7;&amp;#x65F6;&amp;#x5149;&amp;#xFF0C;&amp;#x6211;&amp;#x6E10;&amp;#x6E10;&amp;#x610F;&amp;#x8BC6;&amp;#x5230;&amp;#x6211;">
<meta name="keywords" content="电影,大护法,童话">
<meta property="og:type" content="article">
<meta property="og:title" content="《大护法》—— 花生镇里的成人童话">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1684318907/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x731B;&amp;#x7136;&amp;#x95F4;&amp;#x9A7B;&amp;#x8DB3;&amp;#x56DE;&amp;#x9996;&amp;#x8FD9;&amp;#x4E9B;&amp;#x9519;&amp;#x843D;&amp;#x7684;&amp;#x65E7;&amp;#x65F6;&amp;#x5149;&amp;#xFF0C;&amp;#x6211;&amp;#x6E10;&amp;#x6E10;&amp;#x610F;&amp;#x8BC6;&amp;#x5230;&amp;#x6211;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《大护法》—— 花生镇里的成人童话">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x731B;&amp;#x7136;&amp;#x95F4;&amp;#x9A7B;&amp;#x8DB3;&amp;#x56DE;&amp;#x9996;&amp;#x8FD9;&amp;#x4E9B;&amp;#x9519;&amp;#x843D;&amp;#x7684;&amp;#x65E7;&amp;#x65F6;&amp;#x5149;&amp;#xFF0C;&amp;#x6211;&amp;#x6E10;&amp;#x6E10;&amp;#x610F;&amp;#x8BC6;&amp;#x5230;&amp;#x6211;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">《大护法》—— 花生镇里的成人童话</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">《大护法》—— 花生镇里的成人童话</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-07-30T20:38:22.000Z" itemprop="datePublished" class="page-time">
  2017-07-30
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-《大护法》—— 花生镇里的成人童话" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">《大护法》—— 花生镇里的成人童话</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-07-30 20:38:22" datetime="2017-07-30T20:38:22.000Z" itemprop="datePublished">2017-07-30</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        22 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x731B;&#x7136;&#x95F4;&#x9A7B;&#x8DB3;&#x56DE;&#x9996;&#x8FD9;&#x4E9B;&#x9519;&#x843D;&#x7684;&#x65E7;&#x65F6;&#x5149;&#xFF0C;&#x6211;&#x6E10;&#x6E10;&#x610F;&#x8BC6;&#x5230;&#x6211;&#x5DF2;&#x7ECF;&#x6709;&#x4E09;&#x4E2A;&#x6708;&#x6CA1;&#x6709;&#x5199;&#x535A;&#x5BA2;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x6211;&#x8BF4;&#x51FA;&#x8FD9;&#x662F;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x4F60;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x6C38;&#x8FDC;&#x5230;&#x5E95;&#x6709;&#x591A;&#x8FDC;&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x559C;&#x6B22;&#x4E0A;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x4EBA;&#xFF0C;&#x6E90;&#x81EA;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x7684;&#x60CA;&#x9E3F;&#x4E00;&#x77A5;&#xFF1B;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x5F00;&#x59CB;&#x538C;&#x5026;&#x4E00;&#x4E2A;&#x719F;&#x6089;&#x7684;&#x4EBA;&#xFF0C;&#x6E90;&#x81EA;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x7684;&#x6005;&#x7136;&#x82E5;&#x5931;&#x3002;&#x65F6;&#x95F4;&#x5982;&#x98CE;&#x8D77;&#x4E91;&#x6D8C;&#xFF0C;&#x4E00;&#x8FB9;&#x719F;&#x6089;&#x7740;&#x4E00;&#x8FB9;&#x964C;&#x751F;&#x7740;&#xFF0C;&#x6C38;&#x8FDC;&#x50CF;&#x6781;&#x4E86;&#x4E00;&#x573A;&#x4F60;&#x8FFD;&#x6211;&#x8D76;&#x7684;&#x62C9;&#x529B;&#x8D5B;&#x3002;&#x4ECE;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#x8D70;&#x51FA;&#x6765;&#x88AB;&#x70ED;&#x98CE;&#x5439;&#x88AD;&#x7684;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x6709;&#x79CD;&#x4E45;&#x8FDD;&#x7684;&#x6696;&#x4EBA;&#x80BA;&#x8151;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x50CF;&#x4E00;&#x7C92;&#x70AD;&#x706B;&#xFF0C;&#x90FD;&#x77E5;&#x9053;&#x8981;&#x901A;&#x8FC7;&#x62B1;&#x56E2;&#x6765;&#x53D6;&#x6696;&#xFF0C;&#x53EF;&#x662F;&#x6709;&#x8C01;&#x4F1A;&#x613F;&#x610F;&#x71C3;&#x70E7;&#x81EA;&#x5DF1;&#x5462;&#xFF1F;&#x6240;&#x4EE5;&#x5B64;&#x72EC;&#x662F;&#x4EBA;&#x7C7B;&#x5982;&#x5BBF;&#x547D;&#x4E00;&#x822C;&#x7684;&#x793E;&#x4F1A;&#x5C5E;&#x6027;&#x3002;&#x6211;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x66FE;&#x5411;&#x6211;&#x8BB2;&#x8FF0;&#x8FC7;&#xFF0C;&#x8FD9;&#x79CD;&#x82E5;&#x5373;&#x82E5;&#x79BB;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x800C;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#xFF0C;&#x6211;&#x60F3;&#x5C06;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x7ED3;&#x5408;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#x6765;&#x8BF4;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x597D;&#x50CF;&#x770B;&#x4E86;&#x633A;&#x591A;&#x7535;&#x5F71;&#x7684;&#xFF0C;&#x501F;&#x6211;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x7684;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#xFF0C;&#x201C;&#x4E24;&#x53EA;&#x5355;&#x8EAB;&#x72D7;&#x8DD1;&#x5230;&#x7535;&#x5F71;&#x9662;&#x91CC;&#x53BB;&#x627E;&#x523A;&#x6FC0;&#x201D;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x300A;&#x5927;&#x62A4;&#x6CD5;&#x300B;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x6211;&#x662F;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x770B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x7684;&#x4E3B;&#x9898;&#x662F;&#x201C;&#x53CD;&#x4E4C;&#x6258;&#x90A6;&#x5F0F;&#x201D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5B81;&#x613F;&#x81EA;&#x5DF1;&#x72EC;&#x81EA;&#x53BB;&#x6D88;&#x5316;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x6D88;&#x6781;&#x60B2;&#x89C2;&#x7684;&#x60C5;&#x7EEA;&#x5728;&#x89C2;&#x5F71;&#x65F6;&#x4F20;&#x64AD;&#x7ED9;&#x522B;&#x4EBA;&#x3002;&#x5BF9;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x6211;&#x5C06;&#x5176;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x4EBA;&#x7AE5;&#x8BDD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x786E;&#x4E0D;&#x9002;&#x5408;&#x5E26;&#x5C0F;&#x5B69;&#x5B50;&#x53BB;&#x89C2;&#x770B;&#xFF0C;&#x800C;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x6070;&#x6070;&#x91C7;&#x7528;&#x4E86;PG-13&#x7684;&#x5F71;&#x7247;&#x5206;&#x7EA7;&#x3002;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#xFF0C;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x73B0;&#x6709;&#x4F53;&#x5236;&#x5185;&#xFF0C;&#x8BB2;&#x8FF0;&#x4E00;&#x7FA4;&#x88AB;&#x5974;&#x5F79;&#x7684;&#x201C;&#x82B1;&#x751F;&#x4EBA;&#x201D;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x5916;&#x4EBA;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#xFF0C;&#x4ECE;&#x611A;&#x6627;&#x9EBB;&#x6728;&#x8F6C;&#x53D8;&#x4E3A;&#x610F;&#x8BC6;&#x6E05;&#x9192;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x4EA7;&#x751F;&#x81EA;&#x6211;&#x610F;&#x8BC6;&#x63A8;&#x7FFB;&#x7EDF;&#x6CBB;&#x8005;&#x66B4;&#x653F;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x89C9;&#x9192;&#x548C;&#x53CD;&#x6297;&#x7684;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x800C;&#x8FD9;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4EBA;&#x7C7B;&#x5386;&#x53F2;&#x91CC;&#x6C38;&#x6052;&#x7684;&#x8BDD;&#x9898;&#x5566;&#xFF0C;&#x719F;&#x6089;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x5386;&#x53F2;&#x7684;&#x670B;&#x53CB;&#x4E00;&#x5B9A;&#x77E5;&#x9053;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x5F53;&#x5E74;&#x66FE;&#x7ECF;&#x62CD;&#x6444;&#x8FC7;&#x4E00;&#x90E8;&#x540D;&#x4E3A;&#x300A;1984&#x300B;&#x7684;&#x5E7F;&#x544A;&#x7247;&#xFF0C;&#x8FD9;&#x90E8;&#x5E7F;&#x544A;&#x7247;&#x53D6;&#x6750;&#x81EA;&#x4E54;&#x6CBB;.&#x5965;&#x5A01;&#x5C14;&#x7684;&#x540C;&#x540D;&#x5C0F;&#x8BF4;&#xFF0C;&#x8BE5;&#x4E66;&#x4E2D;&#x523B;&#x753B;&#x4E86;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x7A92;&#x606F;&#x7684;&#x6050;&#x6016;&#x4E16;&#x754C;&#xFF0C;&#x5728;&#x5047;&#x60F3;&#x7684; &#x672A;&#x6765;&#x793E;&#x4F1A;&#x4E2D;&#xFF0C;&#x72EC;&#x88C1;&#x8005;&#x4EE5;&#x8FFD;&#x6C42;&#x6743;&#x5229;&#x4E3A;&#x6700;&#x7EC8;&#x76EE;&#x6807;&#xFF0C;&#x81EA;&#x7531;&#x88AB;&#x5F7B;&#x5E95;&#x5265;&#x593A;&#xFF0C;&#x601D;&#x60F3;&#x88AB;&#x4E25;&#x9177;&#x63A7;&#x5236;&#xFF0C;&#x4EBA;&#x6C11;&#x88AB;&#x8FEB;&#x5C48;&#x4ECE;&#x4E8E;&#x201C;&#x8001;&#x5927;&#x54E5;&#x201D;&#x7684;&#x7EDF;&#x6CBB;&#x3002;&#x800C;&#x5C06;&#x4E66;&#x4E2D;&#x8FD9;&#x4E2A;&#x80CC;&#x666F;&#x5BF9;&#x5E94;&#x5230;&#x82F9;&#x679C;&#x516C;&#x53F8;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x90E8;&#x96BE;&#x7406;&#x89E3;&#x4E54;&#x5E03;&#x65AF;&#x662F;&#x5728;&#x7528;&#x201C;&#x8001;&#x5927;&#x54E5;&#x201D;&#x6765;&#x5F71;&#x5C04;&#x5F53;&#x65F6;&#x7684;IBM&#x516C;&#x53F8;&#xFF0C;&#x5728;&#x8FD9;&#x5219;&#x5E7F;&#x544A;&#x7247;&#x4E2D;&#x201C;&#x8001;&#x5927;&#x54E5;&#x201D;&#x88AB;&#x94C1;&#x9524;&#x51FB;&#x788E;&#x540E;&#x7F13;&#x7F13;&#x6D88;&#x5931;&#xFF0C;&#x6B64;&#x65F6;&#x65C1;&#x767D;&#x5E73;&#x9759;&#x5730;&#x5FF5;&#x9053;&#xFF1A;&#x201C;1&#x6708;24&#x65E5;&#xFF0C;&#x82F9;&#x679C;&#x7535;&#x8111;&#x516C;&#x53F8;&#x5C06;&#x63A8;&#x51FA;&#x9EA6;&#x91D1;&#x5854;&#x7535;&#x8111;&#xFF0C;&#x4F60;&#x5C06;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;1984&#x4E0D;&#x4F1A;&#x53D8;&#x6210;&#x300A;1984&#x300B;&#x201D;&#xFF0C;&#x8FD9;&#x6BB5;&#x4F20;&#x5947;&#x6545;&#x4E8B;&#x5728;&#x300A;&#x7845;&#x8C37;&#x4F20;&#x5947;&#x300B;&#x548C;&#x300A;&#x4E54;&#x5E03;&#x65AF;&#x300B;&#x4E24;&#x90E8;&#x7535;&#x5F71;&#x4E2D;&#x5747;&#x6709;&#x53CD;&#x6620;&#xFF0C;&#x5BF9;&#x6B64;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x53BB;&#x4E86;&#x89E3;&#xFF0C;&#x663E;&#x7136;&#x4E54;&#x5E03;&#x65AF;&#x5728;&#x5F53;&#x65F6;&#x8BD5;&#x56FE;&#x5411;&#x4E16;&#x754C;&#x8BC1;&#x660E;&#xFF0C;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x6709;&#x5E0C;&#x671B;&#x6253;&#x8D25;IBM&#x7684;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x2003;&#x2003;&#x56E0;&#x6B64;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x6709;&#x60F3;&#x8981;&#x901A;&#x8BFB;&#x300A;1984&#x300B;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x5728;&#x67D0;&#x4E9B;&#x4EBA;&#x770B;&#x6765;&#x662F;&#x77EB;&#x60C5;&#x548C;&#x88C5;&#x903C;&#xFF0C;&#x53EF;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FDE;&#x5468;&#x661F;&#x9A70;&#x90FD;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x8BFB;&#x5B8C;&#x300A;&#x6F14;&#x5458;&#x7684;&#x81EA;&#x6211;&#x4FEE;&#x517B;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x906D;&#x4EBA;&#x538C;&#x6076;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x4EE4;&#x4EBA;&#x538C;&#x6076;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x88AB;&#x9053;&#x5FB7;&#x548C;&#x6CD5;&#x5F8B;&#x7EA6;&#x675F;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x51FA;&#x751F;&#x5C31;&#x5728;&#x9002;&#x5E94;&#x63A5;&#x53D7;&#x67D0;&#x4E00;&#x79CD;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#x6216;&#x8005;&#x793E;&#x4F1A;&#x6CD5;&#x5219;&#xFF0C;&#x53EF;&#x603B;&#x6709;&#x4EBA;&#x8BD5;&#x56FE;&#x544A;&#x8BC9;&#x4F60;&#x751F;&#x6D3B;&#x662F;&#x8FD9;&#x6837;&#x6216;&#x8005;&#x90A3;&#x6837;&#xFF0C;&#x5E76;&#x4E14;&#x51FA;&#x81EA;&#x5C0A;&#x91CD;&#x4F60;&#x5FC5;&#x987B;&#x63A5;&#x53D7;&#x548C;&#x611F;&#x8C22;&#x8FD9;&#x79CD;&#x5EFA;&#x8BAE;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x4EBA;&#x6700;&#x540E;&#x4F1A;&#x8BF4;&#x6211;&#x662F;&#x4E3A;&#x4E86;&#x4F60;&#x597D;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x5BFC;&#x6F14;&#x4E0D;&#x601D;&#x51E1;&#x7684;&#x89C6;&#x89D2;&#x91CC;&#xFF0C;&#x8FD9;&#x79CD;&#x56DE;&#x5F52;&#x54F2;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x6700;&#x4E3A;&#x8FFD;&#x6839;&#x6EAF;&#x6E90;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x6211;&#x662F;&#x8C01;&#xFF0C;&#x662F;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x7535;&#x5F71;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x5462;&#xFF1F;&#x6B27;&#x9633;&#x5409;&#x5B89;&#xFF0C;&#x5373;&#x82B1;&#x751F;&#x9547;&#x6751;&#x540D;&#x773C;&#x4E2D;&#x7684;&#x8001;&#x795E;&#x4ED9;&#xFF0C;&#x4ED6;&#x8BF4;&#x9B3C;&#x8611;&#x83C7;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x4F20;&#x67D3;&#x75C5;&#xFF0C;&#x4E00;&#x65E6;&#x82B1;&#x751F;&#x4EBA;&#x957F;&#x4E86;&#x9B3C;&#x8611;&#x83C7;&#x5C31;&#x5FC5;&#x987B;&#x88AB;&#x7ACB;&#x5373;&#x5904;&#x6B7B;&#xFF0C;&#x82B1;&#x751F;&#x4EBA;&#x4E0D;&#x80FD;&#x5F00;&#x53E3;&#x8BF4;&#x8BDD;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x90FD;&#x8D34;&#x7740;&#x5047;&#x773C;&#x775B;&#x548C;&#x5047;&#x5634;&#x5DF4;&#xFF0C;&#x82B1;&#x751F;&#x4EBA;&#x4E0D;&#x80FD;&#x62E5;&#x6709;&#x610F;&#x8BC6;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x4E00;&#x65E6;&#x8BF4;&#x51FA;&#x4E8B;&#x5B9E;&#x5C31;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x67D3;&#x4E86;&#x75AF;&#x75C5;&#x5FC5;&#x987B;&#x88AB;&#x7ACB;&#x5373;&#x5904;&#x6B7B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6751;&#x6C11;&#x90FD;&#x5FAA;&#x89C4;&#x8E48;&#x77E9;&#x5730;&#x542C;&#x7740;&#x8001;&#x795E;&#x4ED9;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4E8B;&#x5B9E;&#x4E0A;&#x9B3C;&#x8611;&#x83C7;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x662F;&#x4F20;&#x67D3;&#x75C5;&#xFF0C;&#x5B83;&#x662F;&#x82B1;&#x751F;&#x4EBA;&#x6210;&#x719F;&#x7684;&#x6807;&#x5FD7;&#xFF0C;&#x8001;&#x795E;&#x4ED9;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7EDF;&#x6CBB;&#x8005;&#xFF0C;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x5C06;&#x82B1;&#x751F;&#x4EBA;&#x89C6;&#x4E3A;&#x4EBA;&#xFF0C;&#x5B83;&#x4EEC;&#x6D3B;&#x7740;&#x7684;&#x552F;&#x4E00;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x7B49;&#x6B7B;&#x540E;&#xFF0C;&#x7531;&#x5E96;&#x536F;&#x4ECE;&#x8111;&#x888B;&#x91CC;&#x53D6;&#x51FA;&#x9ED1;&#x77F3;&#x5934;&#x3002;&#x53E4;&#x8BDD;&#x8BF4;&#xFF1A;&#x6D41;&#x8A00;&#x6B62;&#x4E8E;&#x667A;&#x8005;&#xFF0C;&#x53EF;&#x5728;&#x8FD9;&#x4E2A;&#x8352;&#x8BDE;&#x8BE1;&#x5F02;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x6D41;&#x8A00;&#x4F1A;&#x56E0;&#x4E3A;&#x6050;&#x60E7;&#x800C;&#x63A9;&#x76D6;&#x771F;&#x76F8;&#xFF0C;&#x6751;&#x6C11;&#x59CB;&#x7EC8;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x79CD;&#x4EE4;&#x4EBA;&#x7A92;&#x606F;&#x7684;&#x6050;&#x6016;&#x9634;&#x5F71;&#x91CC;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6545;&#x4E8B;&#x5F00;&#x7BC7;&#x5373;&#x70B9;&#x660E;&#x4E3B;&#x65E8;&#xFF0C;&#x5373;&#x5955;&#x536B;&#x56FD;&#x5927;&#x62A4;&#x6CD5;&#xFF0C;&#x5373;&#x6545;&#x4E8B;&#x4E3B;&#x89D2;&#x201C;&#x7EA2;&#x51AC;&#x74DC;&#x201D;&#x4E3A;&#x5BFB;&#x627E;&#x592A;&#x5B50;&#x4E0B;&#x843D;&#xFF0C;&#x800C;&#x6765;&#x5230;&#x4E86;&#x5145;&#x65A5;&#x7740;&#x8150;&#x70C2;&#x6C14;&#x606F;&#x7684;&#x82B1;&#x751F;&#x9547;&#xFF0C;&#x867D;&#x7136;&#x4E3B;&#x89D2;&#x5BF9;&#x8FD9;&#x4E9B;&#x50CF;&#x4EBA;&#x800C;&#x53C8;&#x4E0D;&#x50CF;&#x4EBA;&#x7684;&#x201C;&#x82B1;&#x751F;&#x4EBA;&#x201D;&#x8868;&#x793A;&#x4E86;&#x53CD;&#x611F;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5927;&#x62A4;&#x6CD5;&#x6CBF;&#x7740;&#x5C71;&#x8DEF;&#x6765;&#x5230;&#x5C0F;&#x9547;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x62F1;&#x95E8;&#x7684;&#x5EFA;&#x7B51;&#xFF0C;&#x53EF;&#x7EC6;&#x601D;&#x6050;&#x6781;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x62F1;&#x9876;&#x5806;&#x6EE1;&#x4E86;&#x82B1;&#x751F;&#x4EBA;&#x7684;&#x5934;&#x9885;&#xFF0C;&#x800C;&#x4E14;&#x5934;&#x9885;&#x4E0A;&#x7684;&#x773C;&#x775B;&#x662F;&#x771F;&#x6B63;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x800C;&#x6563;&#x843D;&#x5728;&#x5730;&#x9762;&#x4E0A;&#x7684;&#x8D34;&#x7EB8;&#x5176;&#x5B9E;&#x662F;&#x5047;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x8054;&#x60F3;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x60C5;&#x8282;&#xFF0C;&#x5728;&#x82B1;&#x751F;&#x9547;&#x6562;&#x4E8E;&#x63ED;&#x9732;&#x771F;&#x76F8;&#x3001;&#x5BFB;&#x627E;&#x771F;&#x76F8;&#x7684;&#x4EBA;&#x90FD;&#x88AB;&#x6740;&#x9E21;&#x5106;&#x7334;&#x5730;&#x5904;&#x7406;&#x6389;&#x4E86;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6545;&#x4E8B;&#x5F00;&#x7BC7;&#x57CB;&#x4E0B;&#x5730;&#x4E00;&#x4E2A;&#x4F0F;&#x7B14;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x4E3A;&#x4E86;&#x5BFB;&#x627E;&#x592A;&#x5B50;&#x7684;&#x4E0B;&#x843D;&#xFF0C;&#x5927;&#x62A4;&#x6CD5;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x5411;&#x8FD9;&#x4E9B;&#x6751;&#x6C11;&#x6253;&#x63A2;&#x6D88;&#x606F;&#x3002;&#x53EF;&#x662F;&#x5927;&#x62A4;&#x6CD5;&#x5F88;&#x5FEB;&#x5C31;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x82B1;&#x751F;&#x9547;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5947;&#x602A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x968F;&#x65F6;&#x968F;&#x5730;&#x90FD;&#x4F1A;&#x6709;&#x4EBA;&#x6740;&#x622E;&#x6751;&#x6C11;&#x548C;&#x5916;&#x6765;&#x8005;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x88AB;&#x79F0;&#x4E3A;&#x5211;&#x6CD5;&#x8005;&#xFF0C;&#x8D1F;&#x8D23;&#x5E2E;&#x52A9;&#x8001;&#x795E;&#x4ED9;&#x6B27;&#x9633;&#x5409;&#x5B89;&#x6740;&#x6B7B;&#x201C;&#x8BE5;&#x6B7B;&#x201D;&#x5730;&#x6751;&#x6C11;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6545;&#x4E8B;&#x4E00;&#x5F00;&#x59CB;&#x5927;&#x62A4;&#x6CD5;&#x5728;&#x6751;&#x5B50;&#x91CC;&#x5C31;&#x906D;&#x5230;&#x4E86;&#x88AD;&#x51FB;&#xFF0C;&#x53EF;&#x662F;&#x8BF4;&#x8D77;&#x5927;&#x62A4;&#x6CD5;&#x6765;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6218;&#x6597;&#x529B;&#x7206;&#x8868;&#x7684;&#x53CD;&#x5DEE;&#x840C;&#x7CFB;&#x8BBE;&#x5B9A;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x6545;&#x4E8B;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E9B;&#x5211;&#x6CD5;&#x8005;&#x7531;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x7F57;&#x5355;&#x7684;&#x4EBA;&#x7BA1;&#x7406;&#xFF0C;&#x4ED6;&#x4E0D;&#x5C5E;&#x4E8E;&#x82B1;&#x751F;&#x9547;&#xFF0C;&#x548C;&#x6B27;&#x9633;&#x5409;&#x5B89;&#x8FD9;&#x4E9B;&#x4EBA;&#x7C7B;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x5BF9;&#x5F69;&#x8FD9;&#x4E2A;&#x795E;&#x79D8;&#x5973;&#x5B50;&#x6709;&#x79CD;&#x5F3A;&#x70C8;&#x7684;&#x5360;&#x6709;&#x6B32;&#xFF0C;&#x4ED6;&#x5077;&#x770B;&#x5979;&#x6D17;&#x6FA1;&#x88AB;&#x53D1;&#x73B0;&#x4FBF;&#x8F6C;&#x8EAB;&#x79BB;&#x5F00;&#xFF0C;&#x53EF;&#x5F53;&#x4ED6;&#x53D1;&#x73B0;&#x4E0B;&#x5C5E;&#x4EA7;&#x751F;&#x611F;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x6BEB;&#x4E0D;&#x7559;&#x60C5;&#x5730;&#x6740;&#x6B7B;&#x4E86;&#x4ED6;&#x4EEC;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x6982;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BA4;&#x8BC6;&#x7684;&#x4E16;&#x754C;&#x5B58;&#x5728;&#x7740;&#x4E25;&#x683C;&#x7684;&#x7B49;&#x7EA7;&#x533A;&#x5206;&#xFF0C;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x4ECE;&#x6B64;&#x5B9A;&#x6027;&#xFF0C;&#x7F57;&#x5355;&#x538B;&#x6291;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x6B32;&#xFF0C;&#x5374;&#x4E0D;&#x5141;&#x8BB8;&#x4E0B;&#x5C5E;&#x4EA7;&#x751F;&#x60C5;&#x6B32;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x4ED6;&#x6740;&#x6B7B;&#x6B27;&#x9633;&#x5409;&#x5B89;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x611F;&#x5230;&#x592A;&#x610F;&#x5916;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x5FC3;&#x91CC;&#x9690;&#x85CF;&#x4E86;&#x592A;&#x591A;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x592A;&#x5B50;&#x662F;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x91CC;&#xFF0C;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x6E05;&#x695A;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#x7684;&#x4EBA;&#x3002;&#x4ED6;&#x4E0D;&#x559C;&#x6B22;&#x671D;&#x5EF7;&#x91CC;&#x7684;&#x7EB7;&#x4E89;&#xFF0C;&#x4FBF;&#x9041;&#x8D70;&#x6C5F;&#x6E56;&#x5BC4;&#x60C5;&#x5C71;&#x6C34;&#xFF0C;&#x53BB;&#x5BFB;&#x627E;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4EBA;&#x5C06;&#x82B1;&#x751F;&#x4EBA;&#x5F53;&#x4F5C;&#x4EBA;&#xFF0C;&#x4ED6;&#x5374;&#x89C6;&#x5C0F;&#x59DC;&#x4E3A;&#x82B1;&#x751F;&#x9547;&#x91CC;&#x6700;&#x597D;&#x7684;&#x670B;&#x53CB;&#x3002;&#x53EF;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x54EA;&#x6709;&#x4EC0;&#x4E48;&#x5C81;&#x6708;&#x9759;&#x597D;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6709;&#x4EBA;&#x8D1F;&#x91CD;&#x524D;&#x884C;&#x3002;&#x5728;&#x6574;&#x4E2A;&#x6545;&#x4E8B;&#x8BBE;&#x5B9A;&#x4E2D;&#xFF0C;&#x5927;&#x62A4;&#x6CD5;&#x7684;&#x7237;&#x7237;&#x7684;&#x7237;&#x7237;&#x8D77;&#x5C31;&#x4E00;&#x76F4;&#x662F;&#x5F08;&#x536B;&#x56FD;&#x7684;&#x5927;&#x62A4;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x62A4;&#x6CD5;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x8981;&#x4FDD;&#x62A4;&#x592A;&#x5B50;&#xFF0C;&#x5728;&#x6545;&#x4E8B;&#x5B89;&#x6392;&#x4E0A;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x76F8;&#x5BF9;&#x67AF;&#x71E5;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x671F;&#x57FA;&#x672C;&#x4E0A;&#x4E00;&#x76F4;&#x5728;&#x627E;&#x592A;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x592A;&#x5B50;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x53BB;&#x9009;&#x62E9;&#x505A;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x5927;&#x62A4;&#x6CD5;&#x5728;&#x4E00;&#x76F4;&#x4FDD;&#x62A4;&#x4ED6;&#xFF0C;&#x76F8;&#x53CD;&#x666E;&#x901A;&#x4EBA;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x4F1A;&#x63D0;&#x5230;&#x3002;&#x592A;&#x5B50;&#x9664;&#x4E86;&#x627F;&#x62C5;&#x6574;&#x90E8;&#x7535;&#x5F71;&#x7684;&#x7B11;&#x70B9;&#x4EE5;&#x5916;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x6700;&#x51FA;&#x5F69;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x4ED6;&#x5728;&#x88AB;&#x5E96;&#x536F;&#x6253;&#x5F97;&#x5934;&#x7834;&#x8840;&#x6D41;&#x65F6;&#xFF0C;&#x4EB2;&#x773C;&#x76EE;&#x7779;&#x4E86;&#x5C0F;&#x59DC;&#x7684;&#x6B7B;&#xFF0C;&#x4ECE;&#x90A3;&#x4E00;&#x523B;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4ED6;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#x4E86;&#x8EAB;&#x4E3A;&#x5E1D;&#x738B;&#x7684;&#x90A3;&#x79CD;&#x62C5;&#x5F53;&#xFF0C;&#x4ED6;&#x4E0D;&#x518D;&#x662F;&#x4EE5;&#x524D;&#x90A3;&#x4E2A;&#x907F;&#x4E16;&#x9003;&#x8131;&#x7684;&#x592A;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x6210;&#x957F;&#x7684;&#x611F;&#x89C9;&#x4F1A;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x4ED6;&#x5728;&#x770B;&#x5230;&#x5927;&#x62A4;&#x6CD5;&#x4EE5;&#x540E;&#x91CD;&#x590D;&#x4E86;&#x4E24;&#x6B21;&#x201C;&#x6740;&#x4E86;&#x4ED6;&#x201D;&#xFF0C;&#x800C;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x4ED6;&#x662F;&#x575A;&#x51B3;&#x53CD;&#x5BF9;&#x6740;&#x4EBA;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5C0F;&#x59DC;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x81EA;&#x6211;&#x610F;&#x8BC6;&#x89C9;&#x9192;&#x7684;&#x82B1;&#x751F;&#x4EBA;&#xFF0C;&#x4ED6;&#x901A;&#x8FC7;&#x9690;&#x5A46;&#x4E86;&#x89E3;&#x5230;&#x81EA;&#x5DF1;&#x662F;&#x600E;&#x4E48;&#x6765;&#x5230;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#xFF0C;&#x4E86;&#x89E3;&#x5230;&#x6BD2;&#x8611;&#x83C7;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x4E00;&#x56DE;&#x4E8B;&#x60C5;&#xFF0C;&#x4E86;&#x89E3;&#x5230;&#x82B1;&#x751F;&#x4EBA;&#x6765;&#x81EA;&#x8681;&#x7334;&#x5B50;&#x5374;&#x53C8;&#x4EE5;&#x8681;&#x7334;&#x5B50;&#x4E3A;&#x98DF;&#x7684;&#x771F;&#x76F8;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x8BBE;&#x5B9A;&#xFF0C;&#x82B1;&#x751F;&#x4EBA;&#x662F;&#x4EE5;&#x8681;&#x7334;&#x5B50;&#x4F5C;&#x4E3A;&#x98DF;&#x7269;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x597D;&#x50CF;&#x5582;&#x732A;&#x7684;&#x6CD4;&#x6C34;&#x91CC;&#x4F1A;&#x6709;&#x732A;&#x8089;&#x4E00;&#x6837;&#xFF0C;&#x60F3;&#x901A;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6216;&#x8BB8;&#x4EBA;&#x5403;&#x732A;&#x8089;&#x548C;&#x4EBA;&#x5403;&#x4EBA;&#x5E76;&#x6CA1;&#x6709;&#x672C;&#x8D28;&#x7684;&#x533A;&#x522B;&#x3002;&#x5C0F;&#x59DC;&#x4F1A;&#x8BF4;&#x8BDD;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x8BA9;&#x6B27;&#x9633;&#x5409;&#x5B89;&#x548C;&#x75B1;&#x536F;&#x90FD;&#x611F;&#x5230;&#x5F02;&#x6837;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x62C5;&#x5FC3;&#x5371;&#x53CA;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x7EDF;&#x6CBB;&#xFF0C;&#x540E;&#x8005;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x4EA7;&#x751F;&#x4E86;&#x6000;&#x7591;&#x3002;&#x5C0F;&#x59DC;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x6B7B;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x88AB;&#x5E96;&#x536F;&#x6740;&#x6B7B;&#x7684;&#x90A3;&#x4E9B;&#x82B1;&#x751F;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x90A3;&#x9897;&#x77F3;&#x5934;&#x4E0D;&#x518D;&#x662F;&#x9ED1;&#x77F3;&#x5934;&#xFF0C;&#x800C;&#x662F;&#x6676;&#x83B9;&#x5254;&#x900F;&#x7684;&#x5B9D;&#x77F3;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x60F3;&#x8D77;&#x868C;&#x8FD9;&#x79CD;&#x53EF;&#x4EE5;&#x5B55;&#x80B2;&#x51FA;&#x73CD;&#x73E0;&#x7684;&#x6D77;&#x6D0B;&#x751F;&#x7269;&#xFF0C;&#x666E;&#x901A;&#x7684;&#x7802;&#x783E;&#x7ECF;&#x8FC7;&#x65F6;&#x95F4;&#x7684;&#x78E8;&#x6D17;&#x53EF;&#x4EE5;&#x53D8;&#x6210;&#x7F8E;&#x4E3D;&#x7684;&#x73CD;&#x73E0;&#x3002;&#x6216;&#x8BB8;&#x7B54;&#x6848;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x5185;&#x5FC3;&#x8D2B;&#x7620;&#x7684;&#x571F;&#x58E4;&#x5BF8;&#x8349;&#x4E0D;&#x751F;&#xFF0C;&#x5185;&#x5FC3;&#x80A5;&#x6C83;&#x7684;&#x571F;&#x58E4;&#x9C9C;&#x82B1;&#x904D;&#x5730;&#x3002;&#x5C0F;&#x59DC;&#x5185;&#x5FC3;&#x5584;&#x826F;&#x6240;&#x4EE5;&#x61C2;&#x5F97;&#x56DE;&#x62A5;&#x592A;&#x5B50;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5584;&#x826F;&#x8D8A;&#x6765;&#x8D8A;&#x88AB;&#x4EBA;&#x5FFD;&#x89C6;&#xFF0C;&#x5C0F;&#x59DC;&#x88AB;&#x8001;&#x795E;&#x4ED9;&#x89C6;&#x4F5C;&#x5708;&#x517B;&#x7684;&#x732A;&#x5570;&#xFF0C;&#x53EF;&#x592A;&#x5B50;&#x4F1A;&#x628A;&#x4ED6;&#x5F53;&#x4F5C;&#x597D;&#x670B;&#x53CB;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x9009;&#x62E9;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x5566;&#xFF0C;&#x9075;&#x4ECE;&#x5185;&#x5FC3;&#x7684;&#x9009;&#x62E9;&#x66F4;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5E96;&#x536F;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x5176;&#x5B9E;&#x633A;&#x60B2;&#x54C0;&#x7684;&#xFF0C;&#x4ED6;&#x4EE3;&#x8868;&#x662F;&#x90A3;&#x4E00;&#x7C7B;&#x88AB;&#x7406;&#x60F3;&#x7ED1;&#x67B6;&#x800C;&#x5931;&#x53BB;&#x81EA;&#x6211;&#x7684;&#x4EBA;&#x3002;&#x201C;&#x5E96;&#x201D;&#x5728;&#x53E4;&#x4EE3;&#x5C31;&#x662F;&#x6307;&#x53A8;&#x5E08;&#x8FD9;&#x4E00;&#x7C7B;&#x804C;&#x4E1A;&#xFF0C;&#x6211;&#x4EEC;&#x719F;&#x6089;&#x7684;&#x5E96;&#x4E01;&#x89E3;&#x725B;&#x8FD9;&#x4E2A;&#x8BCD;&#x5C31;&#x662F;&#x51FA;&#x81EA;&#x8FD9;&#x91CC;&#x3002;&#x53EF;&#x5728;&#x5F71;&#x7247;&#x4E2D;&#x9887;&#x4E3A;&#x8BBD;&#x523A;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x60F3;&#x6210;&#x4E3A;&#x53A8;&#x5E08;&#x7684;&#x4EBA;&#x7684;&#x6700;&#x5927;&#x7406;&#x60F3;&#xFF0C;&#x5C45;&#x7136;&#x662F;&#x60F3;&#x8981;&#x4E00;&#x5200;&#x53D6;&#x4EBA;&#x5FC3;&#x810F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x8BF4;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x4E0D;&#x662F;&#x4E00;&#x4EFD;&#x7406;&#x60F3;&#xFF0C;&#x7528;&#x5927;&#x62A4;&#x6CD5;&#x7684;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#x201C;&#x4F60;&#x7684;&#x7406;&#x60F3;&#xFF0C;&#x6740;&#x6C14;&#x8FD9;&#x4E48;&#x91CD;&#xFF0C;&#x6015;&#x662F;&#x5B9E;&#x73B0;&#x5F97;&#x4E00;&#x5929;&#xFF0C;&#x4F1A;&#x662F;&#x4F60;&#x7684;&#x7EC8;&#x5E74;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x536F;&#x548C;&#x4E01;&#x4E00;&#x5B57;&#x4E4B;&#x5DEE;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x4E01;&#x662F;&#x4E01;&#xFF0C;&#x536F;&#x662F;&#x536F;&#x201D;&#xFF0C;&#x5F53;&#x4F60;&#x88AB;&#x4EC7;&#x6068;&#x8499;&#x853D;&#x53CC;&#x773C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x548C;&#x5B9E;&#x9645;&#x76F8;&#x6BD4;&#x5927;&#x6982;&#x4F1A;&#x76F8;&#x5DEE;&#x5F88;&#x591A;&#x5427;&#xFF01;&#x5E96;&#x536F;&#x5728;&#x542C;&#x89C1;&#x82B1;&#x751F;&#x4EBA;&#x8BF4;&#x8BDD;&#x4EE5;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x5455;&#x5410;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x8BA9;&#x4ED6;&#x5F00;&#x59CB;&#x601D;&#x8003;&#xFF0C;&#x81EA;&#x5DF1;&#x6BCF;&#x5929;&#x5C60;&#x6740;&#x7684;&#x5230;&#x5E95;&#x662F;&#x4E9B;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x3002;&#x8BD5;&#x60F3;&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x5403;&#x7684;&#x8FD9;&#x4E9B;&#x98DF;&#x7269;&#x5F00;&#x53E3;&#x8BF4;&#x8BDD;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x6837;&#x4F1A;&#x611F;&#x5230;&#x6050;&#x60E7;&#x7684;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x60F3;&#x548C;&#x75B1;&#x536F;&#x4E00;&#x6837;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x7EDD;&#x4E16;&#x5927;&#x53A8;&#xFF0C;&#x4F46;&#x73B0;&#x5B9E;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x5374;&#x662F;&#x4E00;&#x4EFD;&#x6740;&#x4EBA;&#x7684;&#x5DEE;&#x4E8B;&#xFF0C;&#x6211;&#x60F3;&#x575A;&#x6301;&#x521D;&#x5FC3;&#xFF0C;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#x8981;&#x5230;&#x54EA;&#x91CC;&#x53BB;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x5728;&#x8DEF;&#x4E0A;&#x8FF7;&#x5931;&#x65B9;&#x5411;&#xFF0C;&#x4ED6;&#x7684;&#x6B7B;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x89E3;&#x8131;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x91CC;&#x7B97;&#x662F;&#x5584;&#x7EC8;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x59CB;&#x7EC8;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x62A4;&#x6CD5;&#xFF0C;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x7ED9;&#x6211;&#x7684;&#x5370;&#x8C61;&#x786E;&#x5B9E;&#x4E0D;&#x591F;&#x6DF1;&#x523B;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x53E4;&#x9F99;&#x5F0F;&#x7684;&#x4FA0;&#x5BA2;&#x5F62;&#x8C61;&#xFF0C;&#x62E5;&#x6709;&#x548C;&#x5916;&#x8868;&#x6781;&#x4E0D;&#x76F8;&#x79F0;&#x7684;&#x6B66;&#x529B;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x751F;&#x547D;&#x5728;&#x6218;&#x6597;&#x7684;&#x4EBA;&#xFF0C;&#x4ECE;&#x6545;&#x4E8B;&#x5F00;&#x5934;&#x4E00;&#x76F4;&#x6218;&#x6597;&#x5230;&#x6545;&#x4E8B;&#x7ED3;&#x5C3E;&#xFF0C;&#x4E3B;&#x89D2;&#x5149;&#x73AF;&#x8BA9;&#x5B83;&#x5728;&#x65AD;&#x4E86;&#x6570;&#x6839;&#x808B;&#x9AA8;&#x540E;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x6D3B;&#x5230;&#x6700;&#x540E;&#x4E00;&#x523B;&#xFF0C;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x5462;&#xFF1F;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x6717;&#x8BF5;&#x8BD7;&#x6B4C;&#x3001;&#x81EA;&#x5E26;&#x838E;&#x58EB;&#x6BD4;&#x4E9A;&#x8154;&#x8C03;&#x7684;&#x6587;&#x827A;&#x5927;&#x62A4;&#x6CD5;&#xFF0C;&#x4ECE;&#x53F0;&#x8BCD;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x6574;&#x90E8;&#x7535;&#x5F71;&#x6DF1;&#x523B;&#x4E2D;&#x5E26;&#x7740;&#x4E9B;&#x8BB8;&#x4E2D;&#x4E8C;&#xFF0C;&#x4F46;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x5438;&#x5F15;&#x7684;&#x6211;&#xFF0C;&#x6070;&#x6070;&#x662F;&#x8FD9;&#x4E9B;&#x786C;&#x4F24;&#x5F88;&#x7A81;&#x51FA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5B83;&#x6574;&#x4F53;&#x7684;&#x753B;&#x98CE;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x602A;&#x8BDE;&#x548C;&#x865A;&#x65E0;&#xFF0C;&#x53EF;&#x5B83;&#x7684;&#x6545;&#x4E8B;&#x5728;&#x56FD;&#x5185;&#x5BA1;&#x67E5;&#x4F53;&#x5236;&#x4E0B;&#x8BA9;&#x4EBA;&#x8033;&#x76EE;&#x4E00;&#x65B0;&#xFF0C;&#x7535;&#x5F71;&#x91CC;&#x8BF4;&#x201C;&#x5047;&#x773C;&#x775B;&#x3001;&#x5047;&#x5634;&#x5DF4;&#x90FD;&#x8BF4;&#x8D34;&#x7740;&#x96BE;&#x53D7;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x8D34;&#xFF1F;&#x90FD;&#x6458;&#x6389;&#x5B83;&#x4EEC;&#x4F1A;&#x600E;&#x4E48;&#x7B11;&#x8BDD;&#x6211;&#xFF1F;&#x5C31;&#x56E0;&#x4E3A;&#x6015;&#x88AB;&#x7B11;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6D3B;&#x6210;&#x4E86;&#x7B11;&#x8BDD;&#x201D;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x662F;&#x4E00;&#x90E8;&#x7ED9;&#x6210;&#x4EBA;&#x770B;&#x7684;&#x7AE5;&#x8BDD;&#xFF0C;&#x4F46;&#x900F;&#x8FC7;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x591A;&#x4E00;&#x70B9;&#x601D;&#x8003;&#x3001;&#x591A;&#x4E00;&#x70B9;&#x60F3;&#x8C61;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x6211;&#x4EEC;&#x56DE;&#x62A5;&#x5BFC;&#x6F14;&#x4E0D;&#x601D;&#x51E1;&#x7684;&#x6700;&#x597D;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x60F3;&#x8BF4;&#x7684;&#x6216;&#x8BB8;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8BF4;&#x7684;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2941880815/">米花之味：永远相信美好的事情</a></li><li><a href="https://qinyuanpei.github.io/posts/1358971951/">致前任：愿余生各自安好</a></li><li><a href="https://qinyuanpei.github.io/posts/2613006280/">一念执着，千山无阻</a></li><li><a href="https://zymin.cn/arcticle/100-children-movies.html">百部经典儿童电影推荐</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1684318907/" rel="external">《大护法》—— 花生镇里的成人童话</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1684318907/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1684318907/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/大护法/">大护法</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/电影/">电影</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/童话/">童话</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1684318907/&title=《《大护法》—— 花生镇里的成人童话》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1684318907/&title=《《大护法》—— 花生镇里的成人童话》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1684318907/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《《大护法》—— 花生镇里的成人童话》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1684318907/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1684318907/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3873710624/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">基于特性(Attribute)的实体属性验证方案设计</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/570888918/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">基于过滤器实现异常处理的探索</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1684318907/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1684318907/&title=《《大护法》—— 花生镇里的成人童话》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1684318907/&title=《《大护法》—— 花生镇里的成人童话》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1684318907/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《《大护法》—— 花生镇里的成人童话》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1684318907/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1684318907/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1684318907/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
