<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        2017，在驻足间回首 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x5F53;&amp;#x670B;&amp;#x53CB;&amp;#x5708;&amp;#x5F00;&amp;#x59CB;&amp;#x96C6;&amp;#x4F53;&amp;#x7F05;&amp;#x6000;18&amp;#x5C81;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8BF4;&amp;#xFF0C;&amp;#x4ECE;&amp;#x6B64;&amp;#x4EE5;&amp;#x540">
<meta name="keywords" content="总结,回首,展望">
<meta property="og:type" content="article">
<meta property="og:title" content="2017，在驻足间回首">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2676125676/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x5F53;&amp;#x670B;&amp;#x53CB;&amp;#x5708;&amp;#x5F00;&amp;#x59CB;&amp;#x96C6;&amp;#x4F53;&amp;#x7F05;&amp;#x6000;18&amp;#x5C81;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8BF4;&amp;#xFF0C;&amp;#x4ECE;&amp;#x6B64;&amp;#x4EE5;&amp;#x540">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.512Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2017，在驻足间回首">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x5F53;&amp;#x670B;&amp;#x53CB;&amp;#x5708;&amp;#x5F00;&amp;#x59CB;&amp;#x96C6;&amp;#x4F53;&amp;#x7F05;&amp;#x6000;18&amp;#x5C81;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8BF4;&amp;#xFF0C;&amp;#x4ECE;&amp;#x6B64;&amp;#x4EE5;&amp;#x540">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">2017，在驻足间回首</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">2017，在驻足间回首</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-12-31T21:30:45.000Z" itemprop="datePublished" class="page-time">
  2017-12-31
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#多情应笑我"><span class="post-toc-number">1.</span> <span class="post-toc-text">多情应笑我</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#做人没意思"><span class="post-toc-number">2.</span> <span class="post-toc-text">做人没意思</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#New-TodoList-“2018”"><span class="post-toc-number">3.</span> <span class="post-toc-text">New TodoList(“2018”)</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">4.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-2017，在驻足间回首" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">2017，在驻足间回首</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-12-31 21:30:45" datetime="2017-12-31T21:30:45.000Z" itemprop="datePublished">2017-12-31</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        25 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5F53;&#x670B;&#x53CB;&#x5708;&#x5F00;&#x59CB;&#x96C6;&#x4F53;&#x7F05;&#x6000;18&#x5C81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#xFF0C;&#x4ECE;&#x6B64;&#x4EE5;&#x540E;&#x662F;00&#x540E;&#x7684;&#x5929;&#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x4EE5;&#x7684;90&#x540E;&#x90FD;&#x6210;&#x5E74;&#x4E86;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x559C;&#x6B22;&#x6000;&#x65E7;&#x7684;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4EE5;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x72C2;&#x6B22;&#x4E2D;&#x5931;&#x53BB;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x5931;&#x53BB;&#x4E2D;&#x7F05;&#x6000;&#x7740;&#xFF0C;&#x4EFF;&#x4F5B;&#x8FD9;&#x79CD;&#x6B7B;&#x78D5;&#x5230;&#x5E95;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x4F1A;&#x8BA9;&#x8FD9;&#x4E00;&#x5207;&#x6765;&#x5F97;&#x66F4;&#x665A;&#x4E00;&#x4E9B;&#x3002;&#x4E00;&#x7FA4;&#x4EBA;&#x62B1;&#x7740;&#x624B;&#x673A;&#x7B49;&#x5F85;&#x7740;&#x65B0;&#x5E74;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x548C;&#x66FE;&#x7ECF;&#x65E0;&#x6570;&#x4E2A;&#x65E0;&#x7720;&#x7684;&#x591C;&#x665A;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x660E;&#x5929;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x50CF;&#x949F;&#x8868;&#x7684;&#x6307;&#x9488;&#x54D2;&#x54D2;&#x5730;&#x4F5C;&#x54CD;&#xFF0C;&#x751F;&#x547D;&#x7684;&#x9F7F;&#x8F6E;&#x6C38;&#x4E0D;&#x505C;&#x6B47;&#x5730;&#x8F6C;&#x52A8;&#x3002;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x6027;&#x5730;&#x671F;&#x76FC;&#x660E;&#x5929;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x201C;&#x5F80;&#x8005;&#x4E0D;&#x53EF;&#x8C0F;&#xFF0C;&#x6765;&#x8005;&#x72B9;&#x53EF;&#x8FFD;&#x201D;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x65B0;&#x5E74;&#x949F;&#x58F0;&#x6572;&#x54CD;&#x4EE5;&#x524D;&#xFF0C;&#x8BA9;&#x8BB0;&#x5FC6;&#x5F7B;&#x5E95;&#x6765;&#x4E00;&#x573A;&#x72EC;&#x81EA;&#x7684;&#x72C2;&#x6B22;&#x5427;&#xFF01;</p>
<h1 id="&#x591A;&#x60C5;&#x5E94;&#x7B11;&#x6211;"><a href="#&#x591A;&#x60C5;&#x5E94;&#x7B11;&#x6211;" class="headerlink" title="&#x591A;&#x60C5;&#x5E94;&#x7B11;&#x6211;"></a>&#x591A;&#x60C5;&#x5E94;&#x7B11;&#x6211;</h1><p>&#x2003;&#x2003;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x4ECE;&#x54EA;&#x91CC;&#x5F00;&#x59CB;&#x56DE;&#x987E;&#x6211;&#x7684;2017&#x5E74;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#x5F00;&#x59CB;&#x8BF4;&#xFF0C;&#x6211;&#x60F3;&#x5E94;&#x8BE5;&#x662F;&#x88F4;&#x6B66;&#x521A;&#x79BB;&#x5F00;&#x897F;&#x5B89;&#x3002;&#x90A3;&#x65F6;&#x9752;&#x9F99;&#x5BFA;&#x6A31;&#x82B1;&#x6B63;&#x5728;&#x76DB;&#x5F00;&#xFF0C;&#x5728;&#x4ED6;&#x79BB;&#x5F00;&#x897F;&#x5B89;&#x4EE5;&#x524D;&#xFF0C;&#x6211;&#x66FE;&#x5E26;&#x4ED6;&#x4E00;&#x8D77;&#x53BB;&#x90A3;&#x91CC;&#x6E38;&#x73A9;&#x3002;&#x4ED6;&#x66FE;&#x9057;&#x61BE;&#x6CA1;&#x6709;&#x597D;&#x597D;&#x5728;&#x897F;&#x5B89;&#x6E38;&#x73A9;&#x4E00;&#x756A;&#xFF0C;&#x5728;&#x5206;&#x522B;&#x524D;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x53BB;&#x5403;&#x7F8A;&#x8089;&#x6CE1;&#x998D;&#xFF0C;&#x771F;&#x6B63;&#x4F53;&#x4F1A;&#x5230;&#x4EC0;&#x4E48;&#x53EB;&#x505A;&#x76F8;&#x987E;&#x65E0;&#x8A00;&#xFF0C;&#x76F4;&#x5230;&#x5341;&#x4E00;&#x56DE;&#x5BB6;&#x53BB;&#x5170;&#x5DDE;&#x8F6C;&#x8F66;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8054;&#x7CFB;&#x5230;&#x5F7C;&#x6B64;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x60F3;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x597D;&#x5C31;&#x662F;&#x8D81;&#x7740;&#x73B0;&#x5728;&#x53BB;&#x505A;&#xFF0C;&#x4E00;&#x4E2A;&#x8FC7;&#x671F;&#x7684;&#x627F;&#x8BFA;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x4EBA;&#x751F;&#x672C;&#x5C31;&#x662F;&#x5927;&#x6D77;&#x91CC;&#x822A;&#x884C;&#x7684;&#x4E00;&#x53F6;&#x6241;&#x821F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7948;&#x7977;&#x5B83;&#x4E0D;&#x906D;&#x9047;&#x72C2;&#x98CE;&#x66B4;&#x96E8;&#xFF0C;&#x53EF;&#x4E8B;&#x5B9E;&#x4E0A;&#x4F60;&#x5E76;&#x4E0D;&#x80FD;&#x66FF;&#x4EFB;&#x4F55;&#x4EBA;&#x505A;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51B3;&#x5B9A;&#xFF0C;&#x8D8A;&#x60F3;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x8D8A;&#x662F;&#x8981;&#x51CF;&#x5C11;&#x62D6;&#x5EF6;&#x3002;&#x201C;&#x4EBA;&#x751F;&#x4E0D;&#x76F8;&#x89C1;&#xFF0C;&#x52A8;&#x5982;&#x53C2;&#x4E0E;&#x5546;&#x201D;&#xFF0C;&#x4EBA;&#x751F;&#x672C;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x7F3A;&#x61BE;&#x80FD;&#x5C11;&#x4E00;&#x5206;&#x4FBF;&#x662F;&#x4E00;&#x5206;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x5403;&#x5B8C;&#x6CE1;&#x998D;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x62A2;&#x7740;&#x4ED8;&#x94B1;&#xFF0C;&#x8001;&#x677F;&#x5A18;&#x7B11;&#x7740;&#x8BF4;&#xFF1A;&#x201C;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x597D;&#x670B;&#x53CB;&#xFF0C;&#x8C01;&#x4ED8;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x6709;&#x673A;&#x4F1A;&#x201D;&#x3002;&#x4E24;&#x4E2A;&#x4EBA;&#x4E00;&#x9635;&#x9ED8;&#x7136;&#x3002;&#x4ECE;&#x90A3;&#x65F6;&#x7B97;&#x8D77;&#xFF0C;&#x5230;&#x4ECA;&#x5929;&#x5DEE;&#x4E0D;&#x591A;8&#x4E2A;&#x6708;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x9762;&#xFF0C;&#x5076;&#x5C14;&#x4F1A;&#x5728;&#x5FAE;&#x4FE1;&#x4E0A;&#x804A;&#x804A;&#x5929;&#x3002;&#x4EBA;&#x751F;&#x7684;&#x65E0;&#x5948;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x4F60;&#x57CB;&#x5934;&#x5FD9;&#x788C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x79BB;&#x522B;&#x7684;&#x5904;&#x5883;&#x6BEB;&#x4E0D;&#x5728;&#x610F;&#xFF0C;&#x7B49;&#x5230;&#x4F60;&#x8FC7;&#x5934;&#x6765;&#x518D;&#x770B;&#x65F6;&#xFF0C;&#x4E0D;&#x7981;&#x6005;&#x7136;&#x82E5;&#x5931;&#xFF0C;&#x611F;&#x60C5;&#x5C31;&#x8FD9;&#x6837;&#x4E00;&#x5929;&#x5929;&#x53D8;&#x6DE1;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x662F;&#x4F60;&#x52AA;&#x529B;&#x878D;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x7559;&#x4F4F;&#x5F7C;&#x6B64;&#x5728;&#x5FC3;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x5462;&#xFF1F;&#x6709;&#x4EBA;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5979;&#x4E0D;&#x5C5E;&#x4E8E;&#x4F60;&#xFF0C;&#x5979;&#x4E0D;&#x9002;&#x5408;&#x4F60;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x662F;&#x6362;&#x4E00;&#x4E2A;&#x6027;&#x683C;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x662F;&#x5408;&#x9002;&#x7684;&#x4EBA;&#x9009;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#xFF0C;&#x540C;&#x7EDD;&#x5BF9;&#x7406;&#x6027;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8BC4;&#x4EF7;&#x548C;&#x8BA4;&#x8BC6;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6C38;&#x8FDC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8FBE;&#x5230;&#x7EDF;&#x4E00;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x559C;&#x6B22;&#x5403;&#x8471;&#xFF0C;&#x800C;&#x6211;&#x559C;&#x6B22;&#x5403;&#x9999;&#x83DC;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x56E0;&#x6B64;&#x6307;&#x8D23;&#x522B;&#x4EBA;&#x4E09;&#x89C2;&#x4E0D;&#x6B63;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x4EC5;&#x4EC5;&#x662F;&#x4F60;&#x4EEC;&#x7684;&#x559C;&#x597D;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF0C;&#x8FD9;&#x4E2A;&#x7406;&#x6027;&#x800C;&#x611F;&#x6027;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x6709;&#x65F6;&#x771F;&#x7684;&#x8BA9;&#x4EBA;&#x6293;&#x72C2;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x6211;&#x548C;&#x5C0F;&#x53E4;&#x5206;&#x5F00;&#x5FEB;&#x4E24;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x65F6;&#x95F4;&#x4F1A;&#x6162;&#x6162;&#x78E8;&#x53BB;&#x4E00;&#x5207;&#x75D5;&#x8FF9;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5979;&#xFF0C;&#x59CB;&#x7EC8;&#x5C31;&#x50CF;&#x6211;&#x5FC3;&#x4E0A;&#x7684;&#x4E00;&#x9897;&#x75E3;&#xFF0C;&#x65F6;&#x95F4;&#x4F1A;&#x628A;&#x5B83;&#x53D8;&#x6210;&#x4E00;&#x9897;&#x7425;&#x73C0;&#xFF0C;&#x65F6;&#x95F4;&#x8D8A;&#x4E45;&#x8D8A;&#x663E;&#x5F97;&#x73CD;&#x8D35;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x6709;&#x4EBA;&#x4F1A;&#x5632;&#x7B11;&#x8FD9;&#x56FA;&#x6267;&#x7684;&#x611F;&#x60C5;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4F1A;&#x5728;&#x5206;&#x5F00;&#x4E00;&#x5E74;&#x540E;&#xFF0C;&#x5750;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x7684;&#x706B;&#x8F66;&#x5230;&#x6D1B;&#x9633;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x89C1;&#x5979;&#x4E00;&#x9762;&#x800C;&#x5DF2;&#xFF0C;&#x6211;&#x6C38;&#x8FDC;&#x8BB0;&#x5F97;&#x5979;&#x7A7F;&#x88D9;&#x5B50;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x6C38;&#x8FDC;&#x8BB0;&#x5F97;&#x90A3;&#x6761;&#x6302;&#x6EE1;&#x706F;&#x7B3C;&#x7684;&#x8DEF;&#xFF0C;&#x6211;&#x6C38;&#x8FDC;&#x90FD;&#x60F3;&#x518D;&#x62B1;&#x5979;&#x4E00;&#x6B21;&#x2026;&#x2026;&#x6211;&#x542C;&#x5230;&#x838E;&#x8389;&#x82B1;&#x56ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x7A81;&#x7136;&#x60F3;&#x8D77;&#x90A3;&#x4E2A;&#x4E0B;&#x5348;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x542C;&#x5230;&#x4E00;&#x5BB6;&#x5E97;&#x91CC;&#x4F20;&#x6765;&#x7684;&#x97F3;&#x4E50;&#x58F0;&#xFF0C;&#x6211;&#x4EEC;&#x4E92;&#x76F8;&#x5BF9;&#x5F7C;&#x6B64;&#x8BF4;&#x6211;&#x77E5;&#x9053;&#x2026;&#x2026;&#x6211;&#x4EEC;&#x5728;&#x5F7C;&#x6B64;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x5E74;&#x9F84;&#x6DF1;&#x7231;&#x4E0A;&#x5F7C;&#x6B64;&#xFF0C;&#x7B49;&#x4E00;&#x5929;&#x5E61;&#x7136;&#x9192;&#x609F;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x8FFD;&#x6094;&#x83AB;&#x53CA;&#xFF0C;&#x79BB;&#x5F00;&#x5979;&#x4EE5;&#x540E;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x4F1A;&#x5355;&#x8EAB;&#x5F88;&#x4E45;&#xFF0C;&#x56E0;&#x4E3A;&#x9664;&#x4E86;&#x5979;&#x6211;&#x597D;&#x50CF;&#x90FD;&#x4E0D;&#x4F1A;&#x540C;&#x522B;&#x4EBA;&#x8C08;&#x604B;&#x7231;&#xFF0C;&#x8FD9;&#x79CD;&#x8FF9;&#x8C61;&#x5728;&#x6211;&#x8EAB;&#x4E0A;&#x66F4;&#x52A0;&#x660E;&#x663E;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x4F60;&#x600E;&#x4E48;&#x5C1D;&#x8BD5;&#x53BB;&#x6539;&#x53D8;&#xFF0C;&#x4F60;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x9003;&#x5F00;&#x88AB;&#x62D2;&#x7EDD;&#x7684;&#x547D;&#x8FD0;&#x3002;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x5E38;&#x9760;&#x773C;&#x7F18;&#x8FD9;&#x79CD;&#x7279;&#x522B;&#x4E3B;&#x89C2;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x592A;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECE;&#x524D;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x559C;&#x6B22;&#x7231;&#x5F97;&#x8F70;&#x8F70;&#x70C8;&#x70C8;&#xFF0C;&#x76F8;&#x4FE1;&#x7231;&#x60C5;&#x53EF;&#x4EE5;&#x6218;&#x80DC;&#x4E00;&#x5207;&#xFF1B;&#x7B49;&#x5230;&#x957F;&#x5927;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x7231;&#x5F97;&#x5C0F;&#x5FC3;&#x8C28;&#x614E;&#xFF0C;&#x8BD5;&#x63A2;&#x548C;&#x5957;&#x8DEF;&#x6DF7;&#x6742;&#x4E0D;&#x6E05;&#x771F;&#x771F;&#x5047;&#x5047;&#x3002;&#x6709;&#x4EBA;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x8981;&#x76F8;&#x4FE1;&#x7231;&#x60C5;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F60;&#x53EA;&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x7B49;&#x5230;&#x90A3;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x4EBA;&#x51FA;&#x73B0;&#xFF1B;&#x6709;&#x7684;&#x4EBA;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x4E00;&#x68F5;&#x6811;&#x4E0A;&#x540A;&#x6B7B;&#x3002;&#x6210;&#x5E74;&#x4EBA;&#x7684;&#x611F;&#x60C5;&#x548C;&#x65F6;&#x95F4;&#x90FD;&#x975E;&#x5E38;&#x6709;&#x9650;&#xFF0C;&#x4E0D;&#x8981;&#x628A;&#x7CBE;&#x529B;&#x6D6A;&#x8D39;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x559C;&#x6B22;&#x4F60;&#x7684;&#x4EBA;&#x8EAB;&#x4E0A;&#x3002;&#x53EF;&#x515C;&#x515C;&#x8F6C;&#x8F6C;&#x5C31;&#x5230;&#x4E86;25&#x5C81;&#xFF0C;&#x4E00;&#x4E2A;&#x8C08;&#x7231;&#x5DF2;&#x665A;&#x3001;&#x8C08;&#x6B7B;&#x5C1A;&#x65E9;&#x7684;&#x5C34;&#x5C2C;&#x5E74;&#x7EAA;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x60F3;&#xFF0C;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x4E86;&#x5C31;&#x53EF;&#x4EE5;&#x7ED3;&#x5A5A;&#x6210;&#x5BB6;&#x7684;&#x4EBA;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x6700;&#x5E78;&#x798F;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x518D;&#x627E;&#x4E0D;&#x5230;&#x90A3;&#x6837;&#x5355;&#x7EAF;&#x7684;&#x7231;&#x60C5;&#x3002;&#x6211;&#x89C1;&#x8FC7;&#x60C5;&#x4FA3;&#x95F4;&#x5435;&#x67B6;&#x65E0;&#x6570;&#x5206;&#x5206;&#x5408;&#x5408;&#xFF0C;&#x6211;&#x89C1;&#x8FC7;&#x5411;&#x73B0;&#x5B9E;&#x59A5;&#x534F;&#x968F;&#x4FBF;&#x627E;&#x4E2A;&#x4EBA;&#x7ED3;&#x5A5A;&#x2026;&#x2026;&#x6211;&#x60F3;&#x627E;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6258;&#x4ED8;&#x7EC8;&#x751F;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x7236;&#x6BCD;&#x603B;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x5148;&#x6211;&#x4EEC;&#x800C;&#x53BB;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x6709;&#x4EBA;&#x966A;&#x4F34;&#x5728;&#x6211;&#x751F;&#x547D;&#x7684;&#x4E00;&#x523B;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x90A3;&#x4E2A;&#x4EBA;&#x4F1A;&#x662F;&#x4F60;&#xFF0C;&#x53EF;&#x6211;&#x51B3;&#x4E0D;&#x4F1A;&#x5982;&#x6B64;&#x81EA;&#x79C1;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x60F3;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x91CC;&#x5B64;&#x5355;&#x3002;&#x6211;&#x66FE;&#x88AB;&#x4EBA;&#x6E29;&#x67D4;&#x5730;&#x5BF9;&#x5F85;&#x8FC7;&#xFF0C;&#x6211;&#x60F3;&#x6E29;&#x67D4;&#x5730;&#x5BF9;&#x5F85;&#x4F60;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4E8F;&#x6B20;&#x6216;&#x8005;&#x5185;&#x759A;&#x800C;&#x5F25;&#x8865;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x77E5;&#x9053;&#x201C;&#x7231;&#x4EBA;&#x8005;&#x4EBA;&#x6052;&#x7231;&#x4E4B;&#x201D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x66FE;&#x7ECF;&#x88AB;&#x4E00;&#x4E2A;&#x5973;&#x5B69;&#x5B50;&#x62D2;&#x7EDD;&#x8FC7;&#xFF0C;&#x6211;&#x5929;&#x771F;&#x7684;&#x4EE5;&#x4E3A;&#xFF0C;&#x51FA;&#x573A;&#x987A;&#x5E8F;&#x4F1A;&#x51B3;&#x5B9A;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x547D;&#x8FD0;&#xFF0C;&#x76F4;&#x5230;&#x5979;&#x5E73;&#x9759;&#x5730;&#x8BF4;&#x51FA;&#xFF0C;&#x201C;&#x5C31;&#x7B97;&#x6211;&#x4E0D;&#x548C;&#x4ED6;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x7EDD;&#x4E0D;&#x4F1A;&#x548C;&#x4F60;&#x5728;&#x4E00;&#x8D77;&#x201C;&#xFF0C;&#x539F;&#x6765;&#x4E00;&#x4E2A;&#x5728;&#x5C0F;&#x53E4;&#x5FC3;&#x91CC;&#x5F85;&#x5979;&#x7279;&#x522B;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x522B;&#x4EBA;&#x773C;&#x4E2D;&#x5C45;&#x7136;&#x662F;&#x5982;&#x6B64;&#x7684;&#x4E0D;&#x582A;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x6211;&#x5728;&#x5979;&#x9762;&#x524D;&#x7ED3;&#x7ED3;&#x5DF4;&#x5DF4;&#x8BF4;&#x82F1;&#x8BED;&#x7684;&#x7A98;&#x8FEB;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x5979;&#x544A;&#x8BC9;&#x6211;&#x5979;&#x8981;&#x8BA2;&#x5A5A;&#x65F6;&#x6211;&#x5199;&#x6EE1;&#x96BE;&#x8FC7;&#x7684;&#x8138;&#x2026;&#x2026;&#x6211;&#x597D;&#x50CF;&#x88AB;&#x65BD;&#x8BC5;&#x5492;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x548C;&#x5C0F;&#x53E4;&#x5206;&#x5F00;&#x540E;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x8FC7;&#x4E24;&#x4E2A;&#x6709;&#x7537;&#x670B;&#x53CB;&#x7684;&#x5973;&#x751F;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x90FD;&#x60F3;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x4E0D;&#x518D;&#x662F;&#x90A3;&#x4E2A;&#x5341;&#x516B;&#x4E5D;&#x5C81;&#x7684;&#x5C11;&#x5E74;&#xFF0C;&#x957F;&#x5927;&#x4EE5;&#x540E;&#x7684;&#x7231;&#x60C5;&#x5939;&#x6742;&#x7740;&#x73B0;&#x5B9E;&#xFF0C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x8BA9;&#x4EBA;&#x8FF7;&#x60D1;&#xFF0C;&#x53EF;&#x6211;&#x518D;&#x627E;&#x4E0D;&#x56DE;&#x90A3;&#x79CD;&#x201C;&#x8D4C;&#x4E66;&#x6CFC;&#x8336;&#x201D;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6216;&#x8BB8;&#x6C42;&#x800C;&#x4E0D;&#x5F97;&#x662F;&#x4EBA;&#x751F;&#x5E38;&#x6001;&#xFF0C;&#x738B;&#x5C14;&#x5FB7;&#x8BF4;&#x201C;&#x4EBA;&#x751F;&#x6709;&#x4E24;&#x79CD;&#x60B2;&#x5267;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x60F3;&#x5F97;&#x5230;&#x7684;&#x5F97;&#x4E0D;&#x5230;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x60F3;&#x5F97;&#x5230;&#x7684;&#x5F97;&#x5230;&#x4E86;&#x201D;&#xFF0C;&#x6211;&#x5BF9;&#x5C0F;&#x53E4;&#x8BF4;&#xFF0C;&#x7ED9;&#x6211;&#x7559;&#x4E00;&#x4E2A;&#x68A6;&#x597D;&#x5417;&#xFF1F;&#x5979;&#x8BF4;&#x597D;&#x7684;&#x5440;&#x3002;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6216;&#x8BB8;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x7F8E;&#x4E3D;&#x3002;&#x53EF;&#x771F;&#x6B63;&#x8BA9;&#x6211;&#x6000;&#x5FF5;&#x7684;&#xFF0C;&#x6070;&#x597D;&#x662F;&#x8FD9;&#x4E9B;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x5206;&#x4E0D;&#x6E05;&#xFF0C;&#x559C;&#x6B22;&#x7684;&#x5230;&#x5E95;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x5979;&#xFF0C;&#x8FD8;&#x662F;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x5979;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x771F;&#x6B63;&#x559C;&#x6B22;&#x7684;&#xFF0C;&#x662F;&#x66FE;&#x7ECF;&#x90A3;&#x4E2A;&#x5E74;&#x8F7B;&#x800C;&#x52C7;&#x6562;&#x7684;&#x5C11;&#x5E74;&#xFF0C;&#x4F5B;&#x5BB6;&#x6709;&#x201D;&#x8D2A;&#x55D4;&#x75F4;&#x6162;&#x7591;&#x201C;&#xFF0C;&#x6240;&#x8C13;&#x4E94;&#x6BD2;&#x5FC3;&#x8005;&#xFF0C;&#x90FD;&#x8BF4;&#x4EBA;&#x8981;&#x5B66;&#x4F1A;&#x653E;&#x4E0B;&#x6267;&#x5FF5;&#xFF0C;&#x53EF;&#x5982;&#x679C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x8FC7;&#xFF0C;&#x53C8;&#x8981;&#x653E;&#x4E0B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4EBA;&#x56E0;&#x4E3A;&#x201C;&#x6C42;&#x800C;&#x4E0D;&#x5F97;&#x201D;&#x800C;&#x75DB;&#x82E6;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x62E5;&#x6709;&#x8FC7;&#x7684;&#x4EBA;&#xFF0C;&#x662F;&#x65E0;&#x6240;&#x8C13;&#x62FF;&#x8D77;&#x548C;&#x653E;&#x4E0B;&#x7684;&#x3002;</p>
<h1 id="&#x505A;&#x4EBA;&#x6CA1;&#x610F;&#x601D;"><a href="#&#x505A;&#x4EBA;&#x6CA1;&#x610F;&#x601D;" class="headerlink" title="&#x505A;&#x4EBA;&#x6CA1;&#x610F;&#x601D;"></a>&#x505A;&#x4EBA;&#x6CA1;&#x610F;&#x601D;</h1><p>&#x2003;&#x2003;&#x5927;&#x6982;&#x4ECE;8&#x6708;&#x4EFD;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x505A;&#x996D;&#xFF0C;&#x800C;&#x5B66;&#x4E60;&#x505A;&#x996D;&#x7684;&#x52A8;&#x673A;&#x65E9;&#x5C31;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#xFF0C;&#x6211;&#x53EA;&#x77E5;&#x9053;&#xFF0C;&#x4ECE;&#x90A3;&#x4E00;&#x523B;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x4E0D;&#x77E5;&#x9053;&#x505A;&#x996D;&#x9700;&#x8981;&#x4E70;&#x4EC0;&#x4E48;&#x8C03;&#x5473;&#x54C1;&#x7684;&#x4EBA;&#xFF0C;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x901B;&#x8D85;&#x5E02;&#x3001;&#x559C;&#x6B22;&#x770B;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#x7684;&#x4EBA;&#xFF0C;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x5468;&#x672B;&#x53BB;&#x8D85;&#x5E02;&#x8D2D;&#x7269;&#x3001;&#x559C;&#x6B22;&#x94BB;&#x7814;&#x7F8E;&#x98DF;&#x7684;&#x4EBA;&#xFF0C;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x7167;&#x987E;&#x81EA;&#x5DF1;&#x3001;&#x7231;&#x60DC;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x3002;&#x897F;&#x5B89;&#x7684;&#x9762;&#x98DF;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x662F;&#x7C97;&#x72B7;&#x7684;&#xFF0C;&#x5982;&#x540C;&#x8FD9;&#x7247;&#x5173;&#x4E2D;&#x5927;&#x5730;&#x4E0A;&#x7C97;&#x72B7;&#x7684;&#x6C11;&#x98CE;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x521D;&#x5C31;&#x4E70;&#x4E86;&#x672C;&#x83DC;&#x8C31;&#x5B66;&#x4E60;&#x505A;&#x996D;&#xFF0C;&#x6211;&#x5B66;&#x505A;&#x996D;&#x7684;&#x52A8;&#x673A;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x6700;&#x4F4E;&#x8981;&#x6C42;&#x662F;&#x4EE5;&#x540E;&#x8BA8;&#x4E0D;&#x7740;&#x8001;&#x5A46;&#x4E0D;&#x4F1A;&#x997F;&#x6B7B;&#x81EA;&#x5DF1;&#xFF0C;&#x8FDB;&#x9636;&#x8981;&#x6C42;&#x662F;&#x4E24;&#x53E3;&#x5B50;&#x8FC7;&#x65E5;&#x5B50;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5177;&#x5907;&#x8FD9;&#x9879;&#x751F;&#x6D3B;&#x6280;&#x80FD;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x6709;&#x628A;&#x5403;&#x4F5C;&#x4E3A;&#x7231;&#x597D;&#x7684;&#x5403;&#x8D27;&#xFF0C;&#x53EF;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x662F;&#x4E0D;&#x80FD;&#x79F0;&#x4E4B;&#x4E3A;&#x5403;&#x8D27;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5403;&#x8D27;&#x5982;&#x679C;&#x5C31;&#x662F;&#x82B1;&#x82B1;&#x94B1;&#x52A8;&#x52A8;&#x5634;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x5BF9;&#x4E0D;&#x8D77;&#x53E4;&#x5F80;&#x4ECA;&#x6765;&#x7684;&#x5403;&#x8D27;&#x4EEC;&#xFF0C;&#x8B6C;&#x5982;&#x82CF;&#x4E1C;&#x5761;&#x4E4B;&#x4E8E;&#x7EA2;&#x70E7;&#x8089;&#xFF0C;&#x5B63;&#x9E70;&#x4E4B;&#x4E8E;&#x9C88;&#x9C7C;&#xFF0C;&#x8881;&#x679A;&#x4E4B;&#x4E8E;&#x300A;&#x968F;&#x56ED;&#x98DF;&#x5355;&#x300B;&#xFF0C;&#x80FD;&#x505A;&#x4F1A;&#x5403;&#x8FD9;&#x662F;&#x771F;&#x5403;&#x8D27;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x5F81;&#x670D;&#x4E00;&#x4E2A;&#x5403;&#x8D27;&#x7684;&#x5FC3;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x5F81;&#x670D;&#x5979;&#x7684;&#x80C3;&#x3002;&#x53EF;&#x4E5F;&#x8BB8;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x7531;&#xFF0C;&#x5F53;&#x4F60;&#x5F81;&#x670D;&#x5979;&#x7684;&#x80C3;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x7B49;&#x4F60;&#x53BB;&#x5F81;&#x670D;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5148;&#x8BA9;&#x6211;&#x5F81;&#x670D;&#x8FD9;&#x672C;&#x83DC;&#x8C31;&#xFF0C;&#x6211;&#x521A;&#x521A;&#x5B66;&#x4F1A;&#x5176;&#x4E2D;&#x7684;10&#x6765;&#x9053;&#x5BB6;&#x5E38;&#x5C0F;&#x7092;&#x3002;</p>
<p>&#x2003;&#x2003;&#x9664;&#x4E86;&#x505A;&#x996D;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x4EE5;&#x5916;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x575A;&#x6301;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x8BFB;&#x4E66;&#xFF0C;&#x53BB;&#x5E74;&#x56FD;&#x5E86;&#x7684;&#x65F6;&#x5019;&#x4E70;&#x4E86;Kindle&#xFF0C;&#x800C;&#x5E74;&#x521D;&#x5219;&#x529E;&#x7406;&#x4E86;&#x7701;&#x56FE;&#x7684;&#x501F;&#x4E66;&#x5361;&#x3002;&#x4E00;&#x65E6;&#x8FD9;&#x4E24;&#x8005;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x4EE5;&#x540E;&#xFF0C;&#x8BFB;&#x4E66;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4EF6;&#x8DA3;&#x4E8B;&#x3002;&#x56E0;&#x4E3A;Kindle&#x4E0D;&#x64C5;&#x957F;&#x9605;&#x8BFB;&#x6280;&#x672F;&#x7C7B;&#x4E66;&#x7C4D;&#xFF0C;&#x6240;&#x4EE5;&#x6280;&#x672F;&#x7C7B;&#x4E66;&#x7C4D;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x7EB8;&#x8D28;&#x4E66;&#xFF0C;&#x800C;&#x4EBA;&#x6587;&#x7C7B;&#x4E66;&#x7C4D;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x6700;&#x65E9;&#x662F;Wesley&#x63A8;&#x8350;&#x8BFB;&#x9648;&#x5FE0;&#x5B9E;&#x7684;&#x300A;&#x767D;&#x9E7F;&#x539F;&#x300B;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x8BA9;&#x6211;&#x4E86;&#x89E3;&#x4E86;&#x8BB8;&#x591A;&#x9655;&#x897F;&#x7684;&#x98CE;&#x571F;&#x4EBA;&#x60C5;&#x3002;&#x5728;&#x540C;&#x540D;&#x7535;&#x89C6;&#x5267;&#x4E2D;&#xFF0C;&#x5F20;&#x5609;&#x6021;&#x9970;&#x6F14;&#x7684;&#x767D;&#x5609;&#x8F69;&#xFF0C;&#x751F;&#x5E73;&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x7684;&#x662F;&#x59BB;&#x5B50;&#x4EB2;&#x624B;&#x505A;&#x7684;&#x6CB9;&#x6CFC;&#x9762;&#x3002;&#x9655;&#x897F;&#x7684;&#x9762;&#x98DF;&#x7684;&#x786E;&#x8BA9;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#xFF0C;&#x539F;&#x672C;&#x51FA;&#x751F;&#x5728;&#x5317;&#x65B9;&#x7684;&#x6211;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4EFF;&#x4F5B;&#x7B2C;&#x4E00;&#x6B21;&#x6765;&#x5230;&#x5317;&#x65B9;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7531;&#x7535;&#x5F71;&#x300A;&#x5ACC;&#x7591;&#x4EBA;X&#x7684;&#x732E;&#x8EAB;&#x300B;&#x8FFD;&#x6EAF;&#x5230;&#x539F;&#x8457;&#xFF0C;&#x9010;&#x6E10;&#x63A5;&#x89E6;&#x4E86;&#x300A;&#x767D;&#x591C;&#x884C;&#x300B;&#x548C;&#x300A;&#x89E3;&#x5FE7;&#x6742;&#x8D27;&#x5E97;&#x300B;&#x8FD9;&#x6837;&#x5178;&#x578B;&#x7684;&#x4E1C;&#x91CE;&#x572D;&#x543E;&#x4F5C;&#x54C1;&#xFF0C;&#x7A0B;&#x6D69;&#x7684;&#x300A;&#x7AD9;&#x5728;&#x4E24;&#x4E2A;&#x4E16;&#x754C;&#x8FB9;&#x7F18;&#x300B;&#xFF0C;&#x6BDB;&#x59C6;&#x7684;&#x300A;&#x6708;&#x4EAE;&#x4E0E;&#x516D;&#x4FBF;&#x58EB;&#x300B;&#xFF0C;&#x5800;&#x8FB0;&#x96C4;&#x7684;&#x300A;&#x8D77;&#x98CE;&#x4E86;&#x300B;&#xFF0C;&#x300A;&#x5C0F;&#x738B;&#x5B50;&#x300B;&#xFF0C;&#x6C88;&#x590D;&#x7684;&#x300A;&#x6D6E;&#x751F;&#x516D;&#x8BB0;&#x300B;&#x4EE5;&#x53CA;&#x300A;&#x8FFD;&#x98CE;&#x7B5D;&#x7684;&#x4EBA;&#x300B;&#xFF0C;&#x800C;&#x7EB8;&#x8D28;&#x4E66;&#x57FA;&#x672C;&#x90FD;&#x662F;Web&#x524D;&#x540E;&#x7AEF;(JavaScript/ASP.NET/SPA)&#x76F8;&#x5173;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;Python&#x76F8;&#x5173;&#x7684;&#x4E66;&#x7C4D;&#x548C;&#x6570;&#x5B66;&#x76F8;&#x5173;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E66;&#x7C4D;&#x4E0D;&#x80FD;&#x5728;&#x8FD9;&#x91CC;&#x5C55;&#x5F00;&#x8BA8;&#x8BBA;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x5728;&#x535A;&#x5BA2;&#x91CC;&#x7559;&#x8A00;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x770B;&#x7535;&#x5F71;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x662F;&#x5355;&#x7EAF;&#x5730;&#x559C;&#x6B22;&#x542C;&#x4EBA;&#x8BB2;&#x6545;&#x4E8B;&#xFF0C;&#x8FD9;&#x548C;&#x7EA6;&#x4F1A;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x770B;&#x7535;&#x5F71;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x5355;&#x7EAF;&#x5730;&#x53BB;&#x770B;&#x4E2A;&#x7535;&#x5F71;&#x800C;&#x5DF2;&#x3002;&#x4E0D;&#x8FC7;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x65E5;&#x5E38;&#x5355;&#x8EAB;&#x72D7;&#xFF0C;&#x603B;&#x662F;&#x8981;&#x5B66;&#x4F1A;&#x9762;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x91CC;&#x6EE1;&#x6EE1;&#x7684;&#x6076;&#x610F;&#x3002;2017&#x5E74;&#x770B;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#x662F;&#x97E9;&#x5BD2;&#x7684;&#x300A;&#x4E58;&#x98CE;&#x7834;&#x6D6A;&#x300B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B11;&#x70B9;&#x4E2D;&#x5939;&#x6742;&#x7740;&#x6CEA;&#x70B9;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5267;&#x60C5;&#x4E0A;&#x501F;&#x9274;&#x4E86;&#x9648;&#x53EF;&#x8F9B;&#x5BFC;&#x6F14;&#x7684;&#x300A;&#x96BE;&#x5144;&#x96BE;&#x5F1F;&#x300B;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;2017&#x5E74;&#x770B;&#x8FC7;&#x7684;&#x8D85;&#x7EA7;&#x82F1;&#x96C4;&#x7535;&#x5F71;&#x6709;&#x300A;&#x795E;&#x5947;&#x5973;&#x4FA0;&#x300B;&#x3001;&#x300A;&#x8718;&#x86DB;&#x4FA0; : &#x5F52;&#x6765;&#x300B;&#x3001;&#x300A;&#x96F7;&#x795E; : &#x8BF8;&#x795E;&#x7684;&#x9EC4;&#x660F;&#x300B;&#x3001;&#x300A;&#x7329;&#x7403;&#x5D1B;&#x8D77;&#x300B;&#x3002;2017&#x5E74;&#x770B;&#x8FC7;&#x7684;&#x52A8;&#x753B;&#x7535;&#x5F71;&#x6709;&#x300A;&#x5927;&#x62A4;&#x6CD5;&#x300B;&#x548C;&#x300A;&#x5BFB;&#x68A6;&#x73AF;&#x6E38;&#x8BB0;&#x300B;&#xFF0C;&#x5176;&#x4E2D;&#x524D;&#x8005;&#x662F;&#x7535;&#x5F71;&#x98CE;&#x683C;&#x548C;&#x653F;&#x6CBB;&#x9690;&#x5BD3;&#x5438;&#x5F15;&#x4E86;&#x6211;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x662F;&#x8BB2;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x4EA1;&#x7075;&#x8282;&#x80CC;&#x666F;&#x4E0B;&#x7684;&#x6696;&#x5FC3;&#x6545;&#x4E8B;&#xFF0C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x53BB;&#x9762;&#x5BF9;&#x6B7B;&#x4EA1;&#x3001;&#x5982;&#x4F55;&#x5E73;&#x8861;&#x5BB6;&#x5EAD;&#x4E0E;&#x68A6;&#x60F3;&#x7B49;&#x3002;2017&#x5E74;&#x770B;&#x8FC7;&#x4E00;&#x90E8;&#x8BB2;&#x8FF0;&#x91CE;&#x5916;&#x63A2;&#x9669;&#x7684;&#x7535;&#x5F71;&#x300A;&#x4E03;&#x5341;&#x4E03;&#x5929;&#x300B;&#xFF0C;&#x7531;&#x8D75;&#x6C49;&#x5510;&#x548C;&#x6C5F;&#x4E00;&#x71D5;&#x4E3B;&#x8981;&#xFF0C;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#x662F;&#x90E8;&#x65C5;&#x6E38;&#x98CE;&#x666F;&#x7247;&#xFF0C;&#x6C5F;&#x4E00;&#x71D5;&#x7684;&#x5B58;&#x5728;&#x611F;&#x7565;&#x5F31;&#xFF0C;&#x7537;&#x4E3B;&#x6700;&#x7EC8;&#x5728;&#x96F7;&#x96E8;&#x591C;&#x91CC;&#x4E27;&#x751F;&#xFF0C;&#x544A;&#x8BEB;&#x4EBA;&#x4EEC;&#x8981;&#x61C2;&#x5F97;&#x91CF;&#x529B;&#x800C;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x53BB;&#x8D9F;&#x897F;&#x85CF;&#x5C31;&#x80FD;&#x51C0;&#x5316;&#x5FC3;&#x7075;&#xFF0C;&#x53EF;&#x6BD4;&#x51C0;&#x5316;&#x5FC3;&#x7075;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x597D;&#x597D;&#x6D3B;&#x7740;&#x3002;2017&#x5E74;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#x662F;&#x9648;&#x51EF;&#x6B4C;&#x7684;&#x300A;&#x5996;&#x732B;&#x4F20;&#x300B;&#xFF0C;&#x6539;&#x7F16;&#x81EA;&#x68A6;&#x6795;&#x8C98;&#x7684;&#x300A;&#x6C99;&#x95E8;&#x7A7A;&#x6D77;&#x300B;&#xFF0C;&#x4EE5;&#x5510;&#x671D;&#x65F6;&#x671F;&#x50E7;&#x4EBA;&#x7A7A;&#x6D77;&#x548C;&#x8BD7;&#x4EBA;&#x767D;&#x5C45;&#x6613;&#x4E3A;&#x4E3B;&#x89D2;&#xFF0C;&#x8BB2;&#x8FF0;&#x5510;&#x7384;&#x5B97;&#x548C;&#x6768;&#x7389;&#x73AF;&#x7684;&#x7231;&#x6068;&#x7EA0;&#x845B;&#xFF0C;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x89C6;&#x89C9;&#x7F8E;&#x662F;&#x65E0;&#x4E0E;&#x4F26;&#x6BD4;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x540E;&#x671F;&#x5267;&#x60C5;&#x5448;&#x73B0;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#x7455;&#x75B5;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x611F;&#x53D7;&#x5927;&#x5510;&#x76DB;&#x666F;&#xFF0C;&#x4EE5;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x8BFB;&#x300A;&#x957F;&#x6068;&#x6B4C;&#x300B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x5C31;&#x5F88;&#x597D;&#x5566;&#xFF01;</p>
<p>emsp;&#x2003;2017&#x5E74;&#x5199;&#x4F5C;&#x65B9;&#x9762;&#x76F8;&#x5BF9;&#x53BB;&#x5E74;&#x660E;&#x663E;&#x9000;&#x6B65;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E24;&#x4E2A;&#x6708;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5199;&#x4E1C;&#x897F;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x62D6;&#x5EF6;&#x75C7;&#x53D1;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x5927;&#x6982;&#x4E24;&#x4E09;&#x4E2A;&#x5468;&#x751A;&#x81F3;&#x4E00;&#x4E2A;&#x6708;&#x65B9;&#x80FD;&#x5199;&#x5B8C;&#xFF0C;&#x8FD9;&#x5927;&#x6982;&#x662F;2017&#x5E74;&#x6700;&#x8BA9;&#x4EBA;&#x9057;&#x61BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;2017&#x5E74;&#x5171;&#x64B0;&#x5199;&#x535A;&#x5BA2;16&#x7BC7;&#xFF0C;&#x8BBF;&#x5BA2;&#x91CF;&#x589E;&#x52A0;&#x7EA6;30&#x4E07;&#xFF0C;&#x53D7;&#x5230;CSDN&#x8FD0;&#x8425;&#x68A6;&#x59D0;&#x7684;&#x79BB;&#x5F00;&#x4EE5;&#x53CA;CSDN&#x6218;&#x7565;&#x8C03;&#x6574;&#x7684;&#x5F71;&#x54CD;&#xFF0C;2017&#x5E74;&#x535A;&#x5BA2;&#x6D41;&#x91CF;&#x7684;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x662F;&#x65E7;&#x6587;&#x7AE0;&#x3002;2017&#x5E74;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x7684;&#x5199;&#x4F5C;&#xFF0C;&#x57FA;&#x672C;&#x5EF6;&#x7EED;2016&#x5E74;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4E0D;&#x518D;&#x5199;&#x9762;&#x5411;&#x65B0;&#x624B;&#x7684;&#x6559;&#x7A0B;&#x7C7B;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x662F;&#x4FA7;&#x91CD;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x6574;&#x5408;&#x548C;&#x6539;&#x8FDB;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x53BB;&#x5199;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#x6216;&#x8005;&#x60F3;&#x6CD5;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x5E0C;&#x671B;&#x5728;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x4EE5;&#x5916;&#x6269;&#x5C55;&#x66F4;&#x591A;&#x7684;&#xFF0C;&#x8B6C;&#x5982;&#x5199;&#x5BF9;&#x751F;&#x6D3B;&#x7684;&#x611F;&#x609F;&#x3001;&#x5BF9;&#x7535;&#x5F71;&#x7684;&#x601D;&#x8003;&#x7B49;&#x7B49;&#xFF0C;&#x8BA1;&#x5212;&#x4E2D;&#x6253;&#x7B97;&#x5F00;&#x901A;&#x77E5;&#x4E4E;&#x4E13;&#x680F;(&#x5DF2;&#x5F00;&#x901A;)&#x3001;&#x5F00;&#x901A;&#x4E2A;&#x4EBA;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;(&#x6B63;&#x5728;&#x51C6;&#x5907;)&#x3002;&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5E0C;&#x671B;&#x62D3;&#x5BBD;&#x535A;&#x5BA2;&#x7684;&#x6D41;&#x91CF;&#x6E20;&#x9053;&#xFF0C;&#x63D0;&#x5347;&#x4E2A;&#x4EBA;&#x54C1;&#x724C;&#x7684;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x957F;&#x5F97;&#x7279;&#x522B;&#x5E05;&#xFF0C;&#x4F46;&#x8981;&#x6709;&#x4E00;&#x79CD;&#x4E0D;&#x6012;&#x81EA;&#x5A01;&#x7684;&#x6C14;&#x573A;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x60F3;&#x6210;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x8FD9;&#x662F;&#x4EF6;&#x4EFB;&#x91CD;&#x800C;&#x9053;&#x8FDC;&#x7684;&#x4E8B;&#x60C5;&#xFF01;</p>
<h1 id="New-TodoList-&#x201C;2018&#x201D;"><a href="#New-TodoList-&#x201C;2018&#x201D;" class="headerlink" title="New TodoList(&#x201C;2018&#x201D;)"></a>New TodoList(&#x201C;2018&#x201D;)</h1><p>&#x2003;&#x2003;&#x5199;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;TodoList&#xFF0C;&#x6211;&#x603B;&#x89C9;&#x5F97;&#x50CF;&#x5728;&#x7ACB;&#x4E00;&#x4E2A;&#x4E2A;flag&#xFF0C;&#x56E0;&#x4E3A;2017&#x5E74;&#x8BA1;&#x5212;&#x7684;MongoDB&#x5C31;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#xFF0C;&#x6240;&#x4EE5;2018&#x7684;TodoList&#x6211;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x66F4;&#x63A5;&#x5730;&#x6C14;&#x4E00;&#x70B9;&#xFF0C;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4ECE;&#x6280;&#x672F;&#x3001;&#x751F;&#x6D3B;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x5236;&#x5B9A;&#x76EE;&#x6807;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5E0C;&#x671B;2018&#x5E74;&#x7684;&#x6211;&#x5728;&#x6280;&#x672F;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li>&#x5B66;&#x4F1A;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x6846;&#x67B6;(Vue/Angular/React)</li>
<li>&#x7EE7;&#x7EED;&#x5B8C;&#x5584;HttpServer(&#x652F;&#x6301;RESTful)</li>
<li>Web&#x540E;&#x7AEF;&#x8BA4;&#x8BC1;&#x6388;&#x6743;&#x53CA;&#x4E2D;&#x95F4;&#x4EF6;(OWIN/OAuth)</li>
<li>&#x7EE7;&#x7EED;&#x5B66;&#x4E60;Python&#x6570;&#x636E;&#x5206;&#x6790;(Pandas)</li>
<li>&#x5199;&#x4E00;&#x4E2A;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;(&#x8BCD;&#x5178;/&#x5C0F;&#x5DE5;&#x5177;)</li>
<li>&#x5EFA;&#x7ACB;&#x77E5;&#x4E4E;&#x4E13;&#x680F;/&#x4E2A;&#x4EBA;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;</li>
</ul>
<p>&#x5176;&#x6B21;&#xFF0C;&#x5E0C;&#x671B;2018&#x5E74;&#x7684;&#x6211;&#x5728;&#x751F;&#x6D3B;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li>&#x8BA4;&#x771F;&#x8C08;&#x604B;&#x7231;&#xFF0C;&#x627E;&#x4E2A;&#x5973;&#x670B;&#x53CB;</li>
<li>&#x63D0;&#x5347;&#x6574;&#x4F53;&#x5BA1;&#x7F8E;&#x53CA;&#x54C1;&#x5473;(&#x7A7F;&#x8863;/&#x5403;&#x996D;/&#x5065;&#x8EAB;)</li>
<li>&#x53BB;&#x4E00;&#x8D9F;&#x83AB;&#x9AD8;&#x7A9F;&#x6216;&#x8005;&#x82CF;&#x5DDE;&#x56ED;&#x6797;(&#x505A;&#x60F3;&#x505A;&#x7684;&#x4E8B;)</li>
<li>&#x4E89;&#x53D6;&#x6DA8;&#x85AA;&#xFF0C;&#x7EE7;&#x7EED;&#x5B58;&#x94B1;</li>
<li>&#x79DF;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x505A;&#x996D;&#x7684;&#x623F;&#x5B50;</li>
<li>&#x548C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x804A;&#x5F97;&#x6765;(&#x6C9F;&#x901A;&#x6280;&#x5DE7;/&#x60C5;&#x5546;)</li>
</ul>
<p>2018&#xFF0C;&#x613F;&#x671F;&#x671B;&#x4E0D;&#x8D1F;&#xFF0C;&#x613F;&#x4F60;&#x88AB;&#x6E29;&#x67D4;&#x5BF9;&#x5F85;&#xFF0C;&#x5C81;&#x6708;&#x9759;&#x597D;&#xFF0C;&#x73B0;&#x4E16;&#x5B89;&#x7A33;&#xFF0C;&#x5FC3;&#x5B89;&#x5904;&#x5373;&#x543E;&#x5BB6;&#xFF0C;&#x665A;&#x5B89;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="http://www.buildupchao.cn/2019/01/23/2018年度复盘，2019年度规划/">2018年度复盘，2019年度规划</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2676125676/" rel="external">2017，在驻足间回首</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2676125676/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2676125676/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/回首/">回首</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/展望/">展望</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/总结/">总结</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2676125676/&title=《2017，在驻足间回首》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2676125676/&title=《2017，在驻足间回首》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2676125676/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《2017，在驻足间回首》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2676125676/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2676125676/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/345410188/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">《C#多线程编程实战》读书笔记</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1386017461/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">基于新浪微博的男女性择偶观数据分析(上)</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2676125676/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2676125676/&title=《2017，在驻足间回首》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2676125676/&title=《2017，在驻足间回首》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2676125676/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《2017，在驻足间回首》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2676125676/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2676125676/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2676125676/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
