<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        当梦想照进现实 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;回到学校将近一周了，工作依然没有着落。每天穿梭在校园里，看着身边熙熙攘攘的人群来来往往，面对着许许多多陌生的面孔，看着太阳每天的起起落落，听着校园广播吟唱那些恍若隔世的时光。我深切地感受到作为一名即将毕业的大四学生，此时此刻站在这里是多么的多余。">
<meta name="keywords" content="梦想,现实,毕业季">
<meta property="og:type" content="article">
<meta property="og:title" content="当梦想照进现实">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/3321992673/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;回到学校将近一周了，工作依然没有着落。每天穿梭在校园里，看着身边熙熙攘攘的人群来来往往，面对着许许多多陌生的面孔，看着太阳每天的起起落落，听着校园广播吟唱那些恍若隔世的时光。我深切地感受到作为一名即将毕业的大四学生，此时此刻站在这里是多么的多余。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="当梦想照进现实">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;回到学校将近一周了，工作依然没有着落。每天穿梭在校园里，看着身边熙熙攘攘的人群来来往往，面对着许许多多陌生的面孔，看着太阳每天的起起落落，听着校园广播吟唱那些恍若隔世的时光。我深切地感受到作为一名即将毕业的大四学生，此时此刻站在这里是多么的多余。">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">当梦想照进现实</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">当梦想照进现实</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-03-10T10:45:51.000Z" itemprop="datePublished" class="page-time">
  2015-03-10
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-当梦想照进现实" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">当梦想照进现实</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-03-10 10:45:51" datetime="2015-03-10T10:45:51.000Z" itemprop="datePublished">2015-03-10</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        9 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x56DE;&#x5230;&#x5B66;&#x6821;&#x5C06;&#x8FD1;&#x4E00;&#x5468;&#x4E86;&#xFF0C;&#x5DE5;&#x4F5C;&#x4F9D;&#x7136;&#x6CA1;&#x6709;&#x7740;&#x843D;&#x3002;&#x6BCF;&#x5929;&#x7A7F;&#x68AD;&#x5728;&#x6821;&#x56ED;&#x91CC;&#xFF0C;&#x770B;&#x7740;&#x8EAB;&#x8FB9;&#x7199;&#x7199;&#x6518;&#x6518;&#x7684;&#x4EBA;&#x7FA4;&#x6765;&#x6765;&#x5F80;&#x5F80;&#xFF0C;&#x9762;&#x5BF9;&#x7740;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x964C;&#x751F;&#x7684;&#x9762;&#x5B54;&#xFF0C;&#x770B;&#x7740;&#x592A;&#x9633;&#x6BCF;&#x5929;&#x7684;&#x8D77;&#x8D77;&#x843D;&#x843D;&#xFF0C;&#x542C;&#x7740;&#x6821;&#x56ED;&#x5E7F;&#x64AD;&#x541F;&#x5531;&#x90A3;&#x4E9B;&#x604D;&#x82E5;&#x9694;&#x4E16;&#x7684;&#x65F6;&#x5149;&#x3002;&#x6211;&#x6DF1;&#x5207;&#x5730;&#x611F;&#x53D7;&#x5230;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x5373;&#x5C06;&#x6BD5;&#x4E1A;&#x7684;&#x5927;&#x56DB;&#x5B66;&#x751F;&#xFF0C;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x7AD9;&#x5728;&#x8FD9;&#x91CC;&#x662F;&#x591A;&#x4E48;&#x7684;&#x591A;&#x4F59;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x6211;&#x4E00;&#x76F4;&#x60F3;&#x5230;&#x5916;&#x9762;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#x53EA;&#x6709;&#x5230;&#x5916;&#x9762;&#x53BB;&#x624D;&#x80FD;&#x627E;&#x5230;&#x8BA9;&#x6211;&#x68A6;&#x60F3;&#x624E;&#x6839;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6211;&#x548C;&#x5BB6;&#x91CC;&#x4EBA;&#x8BF4;&#x4E86;&#x6211;&#x7684;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x5BB6;&#x91CC;&#x5EFA;&#x8BAE;&#x6211;&#x5148;&#x5728;&#x5B81;&#x590F;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5B81;&#x590F;&#x5B9E;&#x5728;&#x627E;&#x4E0D;&#x5230;&#x5DE5;&#x4F5C;&#x518D;&#x8003;&#x8651;&#x51FA;&#x53BB;&#x3002;&#x6211;&#x542C;&#x4ECE;&#x4E86;&#x8FD9;&#x4E2A;&#x5EFA;&#x8BAE;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x5F00;&#x59CB;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5374;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x9519;&#x4E86;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x4EE5;&#x524D;&#x60F3;&#x53BB;&#x5916;&#x9762;&#x662F;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x5916;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x627E;&#x8D77;&#x6765;&#x5BB9;&#x6613;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x5F53;&#x6211;&#x5728;&#x5BBF;&#x820D;&#x91CC;&#x5199;&#x4E0B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x65E0;&#x7591;&#x662F;&#x4E00;&#x79CD;&#x8D64;&#x88F8;&#x88F8;&#x7684;&#x8BBD;&#x523A;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x5728;&#x94F6;&#x5DDD;&#x90FD;&#x627E;&#x4E0D;&#x5230;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x63A8;&#x5F00;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x95E8;&#xFF0C;&#x6211;&#x4EE5;&#x4E3A;&#x53EA;&#x8981;&#x6211;&#x7684;&#x6280;&#x672F;&#x8FBE;&#x5230;&#x4E86;&#x5E94;&#x8058;&#x7684;&#x8981;&#x6C42;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x80DC;&#x4EFB;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x9519;&#x4E86;&#xFF0C;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#x4F1A;&#x7262;&#x7262;&#x5730;&#x62F4;&#x4F4F;&#x6211;&#x4E00;&#x8F88;&#x5B50;&#x3002;&#x5F53;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x6295;&#x9012;&#x7B80;&#x5386;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EE5;&#x4E3A;&#x6211;&#x7684;&#x4E13;&#x4E1A;&#x5BF9;&#x6211;&#x7684;&#x6C42;&#x804C;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x53C8;&#x9519;&#x4E86;&#xFF0C;&#x6211;&#x90FD;&#x6CA1;&#x60F3;&#x5230;&#x6211;&#x7684;&#x7B80;&#x5386;&#x4F1A;&#x56E0;&#x4E3A;&#x4E13;&#x4E1A;&#x4E0D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x800C;&#x88AB;&#x76F4;&#x63A5;&#x5FFD;&#x7565;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x597D;&#x540E;&#x6094;&#x5F53;&#x521D;&#x7684;&#x51B3;&#x5B9A;&#xFF0C;&#x6211;&#x540E;&#x6094;&#x9009;&#x62E9;&#x4E86;&#x5B81;&#x590F;&#x5927;&#x5B66;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7684;211 &#xFF0C;&#x6211;&#x540E;&#x6094;&#x9009;&#x62E9;&#x4E86;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x559C;&#x6B22;&#x8FC7;&#x5374;&#x8981;&#x7F81;&#x7ECA;&#x6211;&#x4E00;&#x751F;&#x7684;&#x4E13;&#x4E1A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E09;&#x53D4;&#x4ECE;&#x6211;&#x5927;&#x4E09;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x59CB;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x5F53;&#x5E74;&#x519C;&#x6821;&#x6BD5;&#x4E1A;&#x540E;&#x5DE5;&#x4F5C;&#x8F97;&#x8F6C;&#x591A;&#x6B21;&#x7EC8;&#x4E8E;&#x5728;&#x9547;&#x4E0A;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x53F8;&#x6CD5;&#x6240;&#x7684;&#x6240;&#x957F;&#xFF0C;&#x6709;&#x6B21;&#x4ED6;&#x8DDF;&#x6211;&#x8BF4;&#x8D77;&#x5F53;&#x5E74;&#x519C;&#x6821;&#x91CC;&#x540C;&#x5B66;&#x73B0;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x4E0D;&#x52A1;&#x6B63;&#x4E1A;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5F53;&#x5E74;&#x519C;&#x6821;&#x91CC;&#x7684;&#x90A3;&#x4E9B;&#x540C;&#x5B66;&#x73B0;&#x5728;&#x90FD;&#x662F;&#x5728;&#x505A;&#x7740;&#x548C;&#x519C;&#x6821;&#x65F6;&#x5019;&#x5B66;&#x5230;&#x65E0;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x8C61;&#x662F;&#x4E0D;&#x662F;&#x4E2D;&#x56FD;&#x6559;&#x80B2;&#x7684;&#x4E00;&#x4E2A;&#x7F29;&#x5F71;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4E0D;&#x80FD;&#x8BC4;&#x4EF7;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x5230;&#x5E95;&#x662F;&#x5BF9;&#x8FD8;&#x662F;&#x9519;&#x3002;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x90A3;&#x5929;&#x628A;&#x53BB;&#x5E74;&#x4E70;&#x7684;&#x6559;&#x6750;&#x9001;&#x7ED9;&#x4E00;&#x540D;&#x524D;&#x6765;&#x501F;&#x4E66;&#x7684;&#x5B66;&#x5F1F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x6C89;&#x9ED8;&#x4E86;&#x597D;&#x4E45;&#x3002;&#x6211;&#x7684;&#x7236;&#x6BCD;&#x542B;&#x8F9B;&#x8339;&#x82E6;&#x5730;&#x4F9B;&#x6211;&#x4E0A;&#x5927;&#x5B66;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x559C;&#x6B22;&#x7684;&#x4E13;&#x4E1A;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x5374;&#x8F7B;&#x800C;&#x6613;&#x4E3E;&#x5730;&#x5C06;&#x8FD9;&#x79CD;&#x4ED8;&#x51FA;&#x50CF;&#x4E22;&#x5783;&#x573E;&#x4E00;&#x6837;&#x6487;&#x5728;&#x4E00;&#x8FB9;&#xFF0C;&#x5230;&#x5E95;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x4E13;&#x4E1A;&#x5BF9;&#x6211;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;&#x5230;&#x5E95;&#x8FD9;&#x5927;&#x5B66;&#x56DB;&#x5E74;&#x5BF9;&#x6211;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x52AA;&#x529B;&#x60F3;&#x8981;&#x60F3;&#x660E;&#x767D;&#x5374;&#x59CB;&#x7EC8;&#x60F3;&#x4E0D;&#x660E;&#x767D;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x5C31;&#x662F;&#x60F3;&#x5355;&#x7EAF;&#x5730;&#x53BB;&#x89E3;&#x51B3;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x6280;&#x672F;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x4E00;&#x751F;&#x90FD;&#x53BB;&#x594B;&#x6597;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x56DE;&#x987E;&#x56DB;&#x5468;&#x7684;&#x65F6;&#x5019;&#x770B;&#x5230;&#x6709;&#x7684;&#x4EBA;&#x65E9;&#x5DF2;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x660E;&#x767D;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#x592A;&#x591A;&#x4E0D;&#x80AF;&#x653E;&#x4E0B;&#x8EAB;&#x6BB5;&#x53BB;&#x505A;&#x4E9B;&#x6CA1;&#x6709;&#x6280;&#x672F;&#x542B;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x4EF7;&#x503C;&#x5B58;&#x5728;&#x67D0;&#x79CD;&#x626D;&#x66F2;&#xFF1A;&#x4E00;&#x4E2A;&#x4EBA;&#x8981;&#x82B1;&#x8D39;&#x56DB;&#x5E74;&#x7684;&#x65F6;&#x5149;&#x53BB;&#x505A;&#x4E9B;&#x4E00;&#x8F88;&#x5B50;&#x91CC;&#x53EA;&#x80FD;&#x505A;&#x4E00;&#x6B21;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x4ED8;&#x51FA;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x4EE5;&#x540E;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x751F;&#x547D;&#x91CC;&#x65E9;&#x5DF2;&#x6709;&#x4E86;&#x5B9A;&#x6570;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x8BD5;&#x56FE;&#x6539;&#x53D8;&#x7684;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#x5C31;&#x53D8;&#x6210;&#x7A7A;&#x60F3;&#xFF0C;&#x4F60;&#x6700;&#x7EC8;&#x8E0F;&#x4E0A;&#x7684;&#x6CE8;&#x5B9A;&#x662F;&#x548C;&#x5927;&#x90E8;&#x5206;&#x4E00;&#x6837;&#x5E73;&#x51E1;&#x7684;&#x751F;&#x547D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#xFF0C;&#x6211;&#x5904;&#x5728;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x548C;&#x6E38;&#x620F;&#x7684;&#x5939;&#x7F1D;&#x91CC;&#xFF0C;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x6211;&#x672C;&#x4E0D;&#x559C;&#x6B22;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x60F3;&#x8981;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x8C0B;&#x751F;&#x7684;&#x6253;&#x7B97;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x60F3;&#x8981;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5374;&#x5728;&#x8FD9;&#x5EA7;&#x57CE;&#x5E02;&#x91CC;&#x6E10;&#x6E10;&#x8FF7;&#x5931;&#x4E86;&#x65B9;&#x5411;&#x3002;&#x7F51;&#x9875;&#x5F00;&#x53D1;&#x3001;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x3001;&#x8BBE;&#x5907;&#x7EF4;&#x62A4;&#x8FD9;&#x4E9B;&#x4EC5;&#x4EC5;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x884C;&#x4E1A;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x8BA4;&#x4E3A;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x559C;&#x6B22;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x884C;&#x4E1A;&#xFF0C;&#x8FD9;&#x662F;&#x5417;&#xFF1F;&#x6211;&#x5728;&#x5FC3;&#x91CC;&#x6697;&#x6697;&#x95EE;&#x81EA;&#x5DF1;&#x3002;&#x6211;&#x53BB;&#x90A3;&#x5BB6;&#x516C;&#x53F8;&#x5E94;&#x8058;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x516C;&#x53F8;&#x91CC;&#x6709;&#x4E2A;&#x4EBA;&#x5EFA;&#x8BAE;&#x6211;&#x5230;&#x5916;&#x9762;&#x53BB;&#x62A5;&#x4E2A;&#x57F9;&#x8BAD;&#x73ED;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x89C9;&#x5F97;&#x6211;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x5B66;&#x7684;&#x548C;&#x4F01;&#x4E1A;&#x9700;&#x6C42;&#x5B8C;&#x5168;&#x662F;&#x4E24;&#x56DE;&#x4E8B;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5E94;&#x5C4A;&#x6BD5;&#x4E1A;&#x751F;&#xFF0C;&#x6211;&#x539F;&#x672C;&#x5C31;&#x662F;&#x5E0C;&#x671B;&#x5230;&#x516C;&#x53F8;&#x91CC;&#x53BB;&#x5B66;&#x4E60;&#x5B9E;&#x9645;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x7684;&#xFF0C;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x5C31;&#x8981;&#x8981;&#x6C42;&#x6211;&#x6709;&#x4E24;&#x5230;&#x4E09;&#x5E74;&#x7684;&#x7ECF;&#x9A8C;&#x5462;&#xFF0C;&#x6211;&#x60F3;&#x5C31;&#x7B97;&#x662F;&#x7814;&#x7A76;&#x751F;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x5929;&#x5929;&#x5F85;&#x5728;&#x516C;&#x53F8;&#x91CC;&#x6162;&#x6162;&#x79EF;&#x7D2F;&#x7ECF;&#x9A8C;&#x5427;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x62B1;&#x6028;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x60F3;&#x8BA9;&#x81EA;&#x5DF1;&#x5FEB;&#x4E9B;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x5B9E;&#x5728;&#x4E0D;&#x60F3;&#x7EE7;&#x7EED;&#x5728;&#x8FD9;&#x6837;&#x7EA0;&#x7ED3;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x660E;&#x5929;&#x5230;&#x62DB;&#x8058;&#x4F1A;&#x4E0A;&#x4F1A;&#x6709;&#x6240;&#x6536;&#x83B7;&#x5427;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/786195243/">做最初的自己</a></li><li><a href="https://qinyuanpei.github.io/posts/3461518355/">毕业就像指尖流沙</a></li><li><a href="https://blog.yuanpei.me/posts/786195243/">做最初的自己</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/3321992673/" rel="external">当梦想照进现实</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/3321992673/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/3321992673/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/梦想/">梦想</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/毕业季/">毕业季</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/现实/">现实</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3321992673/&title=《当梦想照进现实》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3321992673/&title=《当梦想照进现实》 — PayneQinのBlog&source=&emsp;&emsp;回到学校将近一周了，工作依然没有着落。每天穿梭在校园里，看着身边熙熙攘攘的人群来来往往，面对着许许多多陌生的面孔，看着太阳每天的起..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3321992673/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《当梦想照进现实》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3321992673/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3321992673/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/426338252/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">使用Love2D引擎开发贪吃蛇游戏</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/2038378679/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">HTML5游戏开发技术基础整理</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/3321992673/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3321992673/&title=《当梦想照进现实》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3321992673/&title=《当梦想照进现实》 — PayneQinのBlog&source=&emsp;&emsp;回到学校将近一周了，工作依然没有着落。每天穿梭在校园里，看着身边熙熙攘攘的人群来来往往，面对着许许多多陌生的面孔，看着太阳每天的起..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3321992673/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《当梦想照进现实》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3321992673/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3321992673/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/3321992673/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
