<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        长安不见使人愁 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x201C;&amp;#x5927;&amp;#x9053;&amp;#x5982;&amp;#x9752;&amp;#x5929;&amp;#xFF0C;&amp;#x6211;&amp;#x72EC;&amp;#x4E0D;&amp;#x5F97;&amp;#x51FA;&amp;#x201D;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x5510;&amp;#x671D;&amp;#x5927;&amp;#x8BD7;&amp;#x4EBA;&amp;#x674E;&amp;#x767D;">
<meta name="keywords" content="感悟,西安,矫情">
<meta property="og:type" content="article">
<meta property="og:title" content="长安不见使人愁">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/3417652955/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x201C;&amp;#x5927;&amp;#x9053;&amp;#x5982;&amp;#x9752;&amp;#x5929;&amp;#xFF0C;&amp;#x6211;&amp;#x72EC;&amp;#x4E0D;&amp;#x5F97;&amp;#x51FA;&amp;#x201D;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x5510;&amp;#x671D;&amp;#x5927;&amp;#x8BD7;&amp;#x4EBA;&amp;#x674E;&amp;#x767D;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="长安不见使人愁">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x201C;&amp;#x5927;&amp;#x9053;&amp;#x5982;&amp;#x9752;&amp;#x5929;&amp;#xFF0C;&amp;#x6211;&amp;#x72EC;&amp;#x4E0D;&amp;#x5F97;&amp;#x51FA;&amp;#x201D;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x5510;&amp;#x671D;&amp;#x5927;&amp;#x8BD7;&amp;#x4EBA;&amp;#x674E;&amp;#x767D;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">长安不见使人愁</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">长安不见使人愁</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-08-10T20:42:23.000Z" itemprop="datePublished" class="page-time">
  2018-08-10
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-长安不见使人愁" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">长安不见使人愁</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-08-10 20:42:23" datetime="2018-08-10T20:42:23.000Z" itemprop="datePublished">2018-08-10</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        15 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x201C;&#x5927;&#x9053;&#x5982;&#x9752;&#x5929;&#xFF0C;&#x6211;&#x72EC;&#x4E0D;&#x5F97;&#x51FA;&#x201D;&#x3002;&#x8FD9;&#x662F;&#x5510;&#x671D;&#x5927;&#x8BD7;&#x4EBA;&#x674E;&#x767D;&#x5728;&#x300A;&#x884C;&#x8DEF;&#x96BE;&#x300B;(&#x5176;&#x4E8C;)&#x4E2D;&#x7684;&#x611F;&#x6168;&#xFF0C;&#x76F8;&#x6BD4;&#x201C;&#x957F;&#x98CE;&#x7834;&#x6D6A;&#x76F4;&#x6D4E;&#x6CA7;&#x6D77;&#x201D;&#x7684;&#x8C6A;&#x8FC8;&#xFF0C;&#x8FD9;&#x9996;&#x8BD7;&#x53CD;&#x800C;&#x663E;&#x5F97;&#x77EB;&#x60C5;&#x5566;&#xFF0C;&#x4EFF;&#x4F5B;&#x751F;&#x6D3B;&#x5C31;&#x5E94;&#x8BE5;&#x966A;&#x7740;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x7B11;&#xFF0C;&#x6211;&#x8FD9;&#x79CD;&#x795E;&#x7ECF;&#x516E;&#x516E;&#x7684;&#x6587;&#x827A;Boy&#xFF0C;&#x5C31;&#x53EA;&#x6709;&#x8FD9;&#x7247;&#x624B;&#x673A;&#x5C4F;&#x5E55;&#x5927;&#x5C0F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6765;&#x8BF4;&#x4E9B;&#x4E0D;&#x5408;&#x65F6;&#x5B9C;&#x7684;&#x51B7;&#x7B11;&#x8BDD;&#x3002;&#x8FD9;&#x5927;&#x6982;&#x662F;&#x535A;&#x5BA2;&#x80FD;&#x8BA9;&#x6211;&#x575A;&#x6301;&#x5199;&#x4E0B;&#x53BB;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x7684;&#x786E;&#x786E;&#x662F;&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x539F;&#x8C05;&#x6211;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x8981;&#x5728;&#x8FD9;&#x91CC;&#x5199;&#x70B9;&#x77EB;&#x60C5;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0A;&#x5468;&#x4E00;&#x4E2A;&#x4EBA;&#x72EC;&#x81EA;&#x4ECE;&#x516C;&#x53F8;&#x529E;&#x7406;&#x5B8C;&#x79BB;&#x804C;&#x624B;&#x7EED;&#xFF0C;&#x539F;&#x6765;&#x90A3;&#x5929;&#x4E0B;&#x5348;&#x662F;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x4E0B;&#x73ED;&#x6253;&#x5361;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x597D;&#x50CF;&#x662F;&#xFF0C;&#x4F60;&#x575A;&#x6301;&#x5E76;&#x4E14;&#x5728;&#x4E4E;&#x4E86;&#x5F88;&#x4E45;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x67D0;&#x4E00;&#x77AC;&#x95F4;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x4E0D;&#x518D;&#x91CD;&#x8981;&#x3002;&#x6211;&#x7A81;&#x7136;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x5DF2;&#x7ECF;&#x5728;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x91CC;&#x751F;&#x6D3B;&#x4E86;&#x4E24;&#x5E74;&#x591A;&#x3002;&#x4E24;&#x5E74;&#x591A;&#x662F;&#x79CD;&#x4EC0;&#x4E48;&#x4F53;&#x9A8C;&#x5462;&#xFF1F;&#x6216;&#x8BB8;&#x662F;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#x518D;&#x89C1;&#x7684;&#x670B;&#x53CB;&#x518D;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x9762;&#xFF0C;&#x53C8;&#x6216;&#x8BB8;&#x662F;&#x66FE;&#x7ECF;&#x62D2;&#x7EDD;&#x8FC7;&#x4F60;&#x7684;&#x5973;&#x5B69;&#x5B50;&#x7EC8;&#x4E8E;&#x7ED3;&#x4E86;&#x5A5A;&#xFF0C;&#x53C8;&#x6216;&#x8BB8;&#x662F;&#x9752;&#x9F99;&#x5BFA;&#x91CC;&#x7684;&#x6A31;&#x82B1;&#x4EEC;&#x5F00;&#x4E86;&#x4E00;&#x5E74;&#x53C8;&#x4E00;&#x5E74;&#xFF0C;&#x53C8;&#x6216;&#x8BB8;&#x662F;&#x9057;&#x5740;&#x516C;&#x56ED;&#x91CC;&#x77F3;&#x69B4;&#x53C8;&#x4ECE;&#x9752;&#x8272;&#x53D8;&#x6210;&#x4E86;&#x7EA2;&#x8272;&#x2026;&#x2026;&#x4F60;&#x8111;&#x6D77;&#x4E2D;&#x7684;&#x8BB0;&#x5FC6;&#x8D8A;&#x6765;&#x8D8A;&#x6D45;&#xFF0C;&#x800C;&#x989D;&#x5934;&#x4E0A;&#x7684;&#x76B1;&#x7EB9;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#xFF0C;&#x8BB0;&#x5FC6;&#x679C;&#x771F;&#x90FD;&#x88AB;&#x65F6;&#x95F4;&#x4ECE;&#x989D;&#x5934;&#x4E0A;&#x51FF;&#x4E86;&#x53BB;&#x5417;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x548C;&#x670B;&#x53CB;&#x4EEC;&#x804A;&#x5929;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x611F;&#x6168;&#x7740;&#x81EA;&#x5DF1;&#x5A5A;&#x540E;&#x7684;&#x6708;&#x5149;&#x751F;&#x6D3B;&#xFF0C;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x7FA1;&#x6155;&#x7740;&#x6211;&#x63A5;&#x8FD1;&#x4ED6;&#x4EEC;&#x4E09;&#x500D;&#x7684;&#x9AD8;&#x85AA;&#x5DE5;&#x8D44;&#xFF0C;&#x603B;&#x8981;&#x5728;&#x804A;&#x5929;&#x5FEB;&#x8981;&#x7ED3;&#x675F;&#x65F6;&#x4FAF;&#xFF0C;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x95EE;&#x6211;&#xFF1A;&#x771F;&#x7684;&#x4E0D;&#x6253;&#x7B97;&#x56DE;&#x6765;&#x4E86;&#x5417;&#xFF1F;&#x4E5F;&#x8BB8;&#xFF0C;&#x7B49;&#x5230;&#x94F6;&#x897F;&#x9AD8;&#x94C1;&#x901A;&#x8F66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x4E0D;&#x7528;&#x518D;&#x5750;&#x5C06;&#x8FD1;12&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x706B;&#x8F66;&#x56DE;&#x5BB6;&#x3002;&#x201C;&#x9E1F;&#x5026;&#x98DE;&#x800C;&#x77E5;&#x8FD8;&#x201D;&#xFF0C;&#x53EF;&#x6211;&#x662F;&#x5426;&#x662F;&#x300A;&#x963F;&#x98DE;&#x6B63;&#x4F20;&#x300B;&#x91CC;&#x7684;&#x90A3;&#x4E00;&#x53EA;&#xFF0C;&#x90A3;&#x53EA;&#x6CA1;&#x6709;&#x811A;&#x7684;&#x9E1F;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x591F;&#x4E00;&#x76F4;&#x98DE;&#x5440;&#x98DE;&#x5440;&#xFF0C;&#x98DE;&#x7D2F;&#x4E86;&#x5C31;&#x5728;&#x98CE;&#x91CC;&#x7761;&#x89C9;&#x3002;&#x6211;&#x8BA4;&#x8BC6;&#x7684;&#x4EBA;&#x91CC;&#xFF0C;&#x6709;&#x4ECE;&#x5927;&#x5B66;&#x65F6;&#x4EE3;&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x9A7B;&#x8DB3;&#x7684;&#x4EBA;&#xFF0C;&#x6709;&#x8FDC;&#x79BB;&#x6545;&#x4E61;&#x5728;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x624E;&#x6839;&#x7684;&#x4EBA;&#xFF0C;&#x65E0;&#x4E00;&#x4F8B;&#x5916;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x79BB;&#x6545;&#x4E61;&#x8D8A;&#x6765;&#x8D8A;&#x8FDC;&#xFF0C;&#x4EA4;&#x901A;&#x7684;&#x4FBF;&#x5229;&#x548C;&#x53D1;&#x8FBE;&#xFF0C;&#x5E76;&#x4E0D;&#x8DB3;&#x4EE5;&#x5F25;&#x8865;&#x8FD9;&#x79CD;&#x5FC3;&#x7075;&#x4E0A;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x4ECE;&#x5730;&#x56FE;&#x4E0A;&#x770B;&#x5404;&#x4E2A;&#x7701;&#x4EFD;&#x597D;&#x50CF;&#x90FD;&#x79BB;&#x5F97;&#x4E0D;&#x8FDC;&#x3002;&#x53EF;&#x6CA1;&#x6CD5;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x4EBA;&#x4EEC;&#x554A;&#xFF0C;&#x8FDE;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x9065;&#x8FDC;&#x554A;&#xFF01;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x627F;&#x8BA4;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x5929;&#x751F;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x5FE7;&#x65E0;&#x8651;&#x7684;&#x6F02;&#x6CCA;&#x8005;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x6D1B;&#x9633;&#x8FD8;&#x662F;&#x957F;&#x5B89;&#xFF0C;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x90FD;&#x4E0D;&#x662F;&#x6545;&#x4E61;&#x3002;</p>
<p>&#x2003;&#x2003;&#x65E9;&#x5DF2;&#x5FD8;&#x8BB0;&#x662F;&#x4ECE;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x4E0D;&#x5403;&#x8FA3;&#x7684;&#xFF0C;&#x771F;&#x6B63;&#x4EE4;&#x6211;&#x611F;&#x5230;&#x795E;&#x5947;&#x7684;&#xFF0C;&#x662F;&#x8FD9;&#x79CD;&#x4E60;&#x60EF;&#x7EC8;&#x4E8E;&#x8BA9;&#x6211;&#x5E26;&#x53BB;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x5F88;&#x96BE;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x6709;&#x591A;&#x5C11;&#x662F;&#x6765;&#x81EA;&#x559C;&#x6B22;&#xFF0C;&#x53C8;&#x6709;&#x591A;&#x5C11;&#x662F;&#x6765;&#x81EA;&#x4E60;&#x60EF;&#x3002;&#x5468;&#x672B;&#x57FA;&#x672C;&#x56FA;&#x5B9A;&#x7684;&#x53BB;&#x4E66;&#x5E97;&#x770B;&#x4E66;&#xFF0C;&#x770B;&#x4E66;&#x7684;&#x540C;&#x65F6;&#x4EA6;&#x770B;&#x5306;&#x5306;&#x7684;&#x884C;&#x4EBA;&#x3002;&#x5C0F;&#x5BE8;&#x548C;&#x949F;&#x697C;&#x6C38;&#x8FDC;&#x4E0D;&#x4E4F;&#x5149;&#x9C9C;&#x4EAE;&#x4E3D;&#x7684;&#x7537;&#x7537;&#x5973;&#x5973;&#xFF0C;&#x4FE8;&#x7136;&#x662F;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x91CC;&#x6700;&#x7E41;&#x534E;&#x7684;&#x5730;&#x5E26;&#xFF0C;&#x4EBA;&#x4EEC;&#x7684;&#x81EA;&#x62CD;&#x65E0;&#x4E00;&#x4E0D;&#x900F;&#x9732;&#x7740;&#x65F6;&#x5C1A;&#x4E0E;&#x7CBE;&#x81F4;&#xFF0C;&#x5728;&#x67D0;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x8BA9;&#x6211;&#x8FD9;&#x4E2A;&#x6765;&#x81EA;&#x4E09;&#x56DB;&#x7EBF;&#x5C0F;&#x57CE;&#x5E02;&#x7684;&#x4EBA;&#xFF0C;&#x76F8;&#x5F62;&#x89C1;&#x7ECC;&#x5230;&#x6C89;&#x9ED8;&#x4E0D;&#x8A00;&#x3002;&#x60F3;&#x8C61;&#x4E0B;&#x5927;&#x5510;&#x76DB;&#x4E16;&#x91CC;&#x7684;&#x957F;&#x5B89;&#x57CE;&#xFF0C;&#x6700;&#x7E41;&#x534E;&#x7684;&#x5E02;&#x96C6;&#x65E0;&#x5916;&#x4E1C;&#x897F;&#x4E24;&#x5E02;&#xFF0C;&#x9A6C;&#x4EB2;&#x738B;&#x7684;&#x300A;&#x957F;&#x5B89;&#x5341;&#x4E8C;&#x65F6;&#x8FB0;&#x300B;&#x6240;&#x5C55;&#x73B0;&#x7684;&#x76DB;&#x5510;&#x98CE;&#x7269;&#xFF0C;&#x5BF9;&#x771F;&#x5B9E;&#x7684;&#x5386;&#x53F2;&#x800C;&#x8A00;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x96EA;&#x6CE5;&#x9E3F;&#x722A;&#x3001;&#x60CA;&#x9E3F;&#x4E00;&#x77A5;&#x3002;&#x5982;&#x4ECA;&#x897F;&#x5E02;&#x4E3A;&#x5546;&#x4E1A;&#x8857;&#x6240;&#x5305;&#x56F4;&#xFF0C;&#x4E00;&#x5EA7;&#x5927;&#x5510;&#x897F;&#x5E02;&#x535A;&#x7269;&#x9986;&#x6084;&#x7ACB;&#x5176;&#x4E2D;&#xFF0C;&#x5176;&#x5F62;&#x582A;&#x79F0;&#x5BC2;&#x5BE5;&#x5426;&#xFF1F;&#x897F;&#x5B89;&#x904D;&#x5730;&#x90FD;&#x662F;&#x5546;&#x573A;&#x3001;&#x8D2D;&#x7269;&#x4E2D;&#x5FC3;&#xFF0C;&#x5176;&#x76DB;&#x582A;&#x6BD4;&#x5927;&#x5510;&#x5426;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x6211;&#x66FE;&#x7ECF;&#x5F00;&#x73A9;&#x7B11;&#x5730;&#x548C;&#x670B;&#x53CB;&#x8BF4;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x559C;&#x6B22;&#x89C2;&#x5BDF;&#x8DEF;&#x4E0A;&#x884C;&#x4EBA;&#x4EEC;&#x7684;&#x7A7F;&#x642D;&#xFF0C;&#x4EFF;&#x4F5B;&#x8FD9;&#x6837;&#x80FD;&#x8BA9;&#x6211;&#x559C;&#x6B22;&#x7684;&#x5973;&#x5B69;&#x5B50;&#x613F;&#x610F;&#x770B;&#x6211;&#x4E00;&#x773C;&#xFF0C;&#x670B;&#x53CB;&#x4E0D;&#x65E0;&#x5632;&#x8BBD;&#x5730;&#x8BF4;&#xFF0C;&#x201C;&#x4F60;&#x8FD9;&#x662F;&#x5728;&#x4E1C;&#x65BD;&#x6548;&#x98A6;&#x554A;&#x201D;&#xFF0C;&#x5C31;&#x8FDE;&#x6211;&#x559C;&#x6B22;&#x7684;&#x5973;&#x5B69;&#x5B50;&#x90FD;&#x8BF4;&#xFF0C;&#x201C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x98CE;&#x683C;&#x554A;&#x201D;&#x3002;&#x53EF;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x53EA;&#x6709;&#x4E00;&#x70B9;&#x80FD;&#x786E;&#x5B9A;&#xFF0C;&#x6211;&#x660E;&#x786E;&#x77E5;&#x9053;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x90A3;&#x79CD;&#x98CE;&#x683C;&#xFF0C;&#x5018;&#x82E5;&#x771F;&#x8981;&#x95EE;&#x6211;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x554A;&#xFF01;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x53EA;&#x6709;&#x5973;&#x5B69;&#x5B50;&#xFF0C;&#x4F1A;&#x5728;&#x9762;&#x5BF9;&#x7433;&#x7405;&#x6EE1;&#x76EE;&#x7684;&#x5546;&#x54C1;&#x65F6;&#x9009;&#x62E9;&#x56F0;&#x96BE;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x591A;&#x6837;&#x5316;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x660E;&#x786E;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x53CD;&#x5012;&#x662F;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x7A00;&#x7F3A;&#x7684;&#x54C1;&#x8D28;&#x3002;&#x5C31;&#x50CF;&#x4EBA;&#x53EA;&#x6709;&#x957F;&#x5927;&#x4E86;&#x4EE5;&#x540E;&#x624D;&#x4F1A;&#x660E;&#x767D;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x7537;&#x4EBA;&#x662F;&#x591A;&#x4E48;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x505A;&#x5B66;&#x751F;&#x7684;&#x65F6;&#x5019;&#x6BD4;&#x7684;&#x662F;&#x5B66;&#x4E60;&#x6210;&#x7EE9;&#xFF0C;&#x505A;&#x7537;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#x5219;&#x662F;&#x6BD4;&#x793E;&#x4F1A;&#x5316;&#x7EFC;&#x5408;&#x6D4B;&#x8BC4;&#x3002;&#x521D;&#x5230;&#x957F;&#x5B89;&#x201C;&#x5C45;&#x4E4B;&#x4E0D;&#x6613;&#x201D;&#x7684;&#x767D;&#x5C45;&#x6613;&#xFF0C;&#x548C;&#x6B64;&#x65F6;&#x7684;&#x4F60;&#x6211;&#x662F;&#x4F55;&#x5176;&#x76F8;&#x4F3C;&#xFF0C;&#x5F7C;&#x65F6;&#x957F;&#x5B89;&#x662F;&#x5927;&#x5510;&#x7684;&#x9996;&#x90FD;&#xFF0C;&#x6B64;&#x65F6;&#x897F;&#x5B89;&#x662F;&#x65B0;&#x65B0;&#x4E00;&#x7EBF;&#x57CE;&#x5E02;&#xFF0C;&#x5386;&#x53F2;&#x554A;&#xFF0C;&#x679C;&#x7136;&#x90FD;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#x561B;&#xFF0C;&#x6240;&#x4E0D;&#x540C;&#x7684;&#x53EA;&#x662F;&#x5F53;&#x4E8B;&#x4EBA;&#x3002;</p>
<p>&#x2003;&#x2003;&#x670B;&#x53CB;&#x4EEC;&#x90FD;&#x5E0C;&#x671B;&#x6211;&#x53EF;&#x4EE5;&#x201C;&#x81EA;&#x4FE1;&#x201D;&#x70B9;&#xFF0C;&#x53EF;&#x7EC8;&#x4E8E;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x5929;&#xFF0C;&#x4F60;&#x505A;&#x5230;&#x4E86;&#x66FE;&#x7ECF;&#x60F3;&#x505A;&#x800C;&#x4E0D;&#x6562;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x53C8;&#x662F;&#x5426;&#x771F;&#x7684;&#x4F1A;&#x5982;&#x4F60;&#x6240;&#x613F;&#x3002;&#x4EBA;&#x554A;&#xFF0C;&#x603B;&#x662F;&#x60C5;&#x613F;&#x6D3B;&#x5728;&#x501F;&#x53E3;&#x91CC;&#x3002;&#x6211;&#x6709;&#x4F4D;&#x670B;&#x53CB;&#x5E38;&#x5E38;&#x201C;&#x4E00;&#x8BED;&#x60CA;&#x4EBA;&#x201D;&#xFF0C;&#x7B80;&#x76F4;&#x5C31;&#x662F;&#x201C;&#x8BED;&#x4E0D;&#x60CA;&#x4EBA;&#x6B7B;&#x4E0D;&#x4F11;&#x201D;&#x7684;&#x5178;&#x578B;&#x4EE3;&#x8868;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF0C;&#x201C;&#x4E0D;&#x7BA1;&#x7537;&#x4EBA;&#x7684;&#x8BDD;&#x8FD8;&#x662F;&#x5973;&#x4EBA;&#x7684;&#x8BDD;&#xFF0C;&#x90FD;&#x4E0D;&#x8981;&#x76F8;&#x4FE1;&#x201D;&#x3002;&#x5927;&#x610F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4EBA;&#x5BB6;&#x5C31;&#x662F;&#x90A3;&#x4E48;&#x968F;&#x53E3;&#x4E00;&#x8BF4;&#xFF0C;&#x4F60;&#x8FD9;&#x8FD8;&#x5F53;&#x771F;&#x4E86;&#x4E0D;&#x662F;&#x3002;&#x59DC;&#x6587;&#x300A;&#x8BA9;&#x5B50;&#x5F39;&#x98DE;&#x300B;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x60C5;&#x8282;&#xFF0C;&#x5C0F;&#x516D;&#x5B50;&#x88AB;&#x8BEC;&#x9677;&#x5403;&#x4E86;&#x4E24;&#x7897;&#x51C9;&#x7C89;&#x5374;&#x7ED9;&#x4E86;&#x4E00;&#x7897;&#x51C9;&#x7C89;&#x94B1;&#xFF0C;&#x767E;&#x53E3;&#x83AB;&#x8FA9;&#x7684;&#x5C0F;&#x516D;&#x5B50;&#xFF0C;&#x4E0D;&#x5F97;&#x5DF2;&#x5256;&#x5F00;&#x809A;&#x5B50;&#x6765;&#x81EA;&#x8BC1;&#x6E05;&#x767D;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4E16;&#x4E0A;&#x597D;&#x591A;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x4F60;&#x8BC1;&#x660E;&#x4E86;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x67D0;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x53C8;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x65F6;&#x8FC7;&#x5883;&#x8FC1;&#xFF0C;&#x5F53;&#x4E00;&#x5207;&#x90FD;&#x91CD;&#x65B0;&#x5F52;&#x4E8E;&#x5E73;&#x9759;&#xFF0C;&#x4E5F;&#x8BB8;&#x4EBA;&#x5BB6;&#x5C31;&#x662F;&#x90A3;&#x4E48;&#x968F;&#x53E3;&#x4E00;&#x8BF4;&#xFF0C;&#x4E5F;&#x8BB8;&#x4EBA;&#x5BB6;&#x65E9;&#x90FD;&#x5FD8;&#x8BB0;&#x4E86;&#x8BF4;&#x8FC7;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x800C;&#x4F60;&#x5374;&#x5B88;&#x7740;&#x8FD9;&#x4E2A;&#x53EF;&#x7B11;&#x7684;&#x6267;&#x5FF5;&#x7B49;&#x5230;&#x82B1;&#x513F;&#x90FD;&#x8C22;&#x4E86;&#x3002;&#x4EBA;&#x5450;&#xFF0C;&#x5076;&#x5C14;&#x72E0;&#x4E0B;&#x5FC3;&#x6765;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x5F88;&#x723D;&#x5417;&#xFF1F;&#x5C31;&#x50CF;&#x4EBA;&#x4EEC;&#x559C;&#x6B22;&#x66B4;&#x529B;&#x4E00;&#x6837;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x81EA;&#x4FE1;&#x5E94;&#x8BE5;&#x662F;&#x6E29;&#x67D4;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4F60;&#x4EE5;&#x4E3A;&#x7684;&#x81EA;&#x4FE1;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x4EFB;&#x6027;&#x7F62;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x5C0F;&#x5B69;&#x5B50;&#xFF0C;&#x4F1A;&#x56E0;&#x4E3A;&#x4F60;&#x5E2E;&#x4ED6;&#x6361;&#x8D77;&#x6389;&#x5728;&#x5730;&#x4E0A;&#x7684;&#x6247;&#x5B50;&#xFF0C;&#x800C;&#x5BF9;&#x4F60;&#x5FAE;&#x7B11;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x8FD8;&#x4E0D;&#x4F1A;&#x8BF4;&#x8BDD;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x60F3;&#x4EBA;&#x4EEC;&#x5BF9;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#x7269;&#x7684;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#x4E3A;&#x4F55;&#x4F1A;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x4E0D;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x3002;&#x4EBA;&#x7C7B;&#x5176;&#x5B9E;&#x548C;&#x7334;&#x5B50;&#x5DEE;&#x4E0D;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x603B;&#x662F;&#x5145;&#x6EE1;&#x597D;&#x5947;&#xFF0C;&#x4F3C;&#x4E4E;&#x4EC0;&#x4E48;&#x90FD;&#x60F3;&#x8981;&#x53BB;&#x5C1D;&#x8BD5;&#x3002;&#x559C;&#x6B22;&#x5403;&#x559D;&#x73A9;&#x4E50;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x61C2;&#x5F97;&#x4EAB;&#x53D7;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x559C;&#x6B22;&#x72EC;&#x5904;&#x5185;&#x7701;&#x5219;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E4F;&#x5473;&#x65E0;&#x8DA3;&#xFF0C;&#x53EF;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x505A;&#x4EBA;&#xFF0C;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x9762;&#x5BF9;&#x8FD9;&#x4E2A;&#x5B58;&#x6D3B;&#x4E86;&#x4E0A;&#x4EBF;&#x5E74;&#x7684;&#x661F;&#x7403;&#x3002;&#x5F53;&#x5317;&#x6781;&#x5708;&#x91CC;&#x5F00;&#x59CB;&#x51FA;&#x73B0;30&#x5EA6;&#x7684;&#x9AD8;&#x6E29;&#xFF0C;&#x5927;&#x6982;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x7EDD;&#x5BF9;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5F53;&#x6240;&#x6709;&#x7684;&#x6807;&#x51C6;&#x90FD;&#x88AB;&#x6EE1;&#x8DB3;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;&#x65E0;&#x8BBA;&#x5BF9;&#x65B9;&#x662F;&#x8C01;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x660E;&#x660E;&#x90FD;&#x5728;&#x6267;&#x7740;&#x4E8E;&#x627E;&#x5BFB;&#x552F;&#x4E00;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5374;&#x4E3A;&#x4F55;&#x9009;&#x62E9;&#x4E86;&#x539F;&#x672C;&#x548C;&#x552F;&#x4E00;&#x65E0;&#x5173;&#x7684;&#x6807;&#x51C6;&#x3002;&#x56E0;&#x4E3A;&#x4F46;&#x51E1;&#x6709;&#x6807;&#x51C6;&#x5B58;&#x5728;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x6CE8;&#x5B9A;&#x96BE;&#x4EE5;&#x6210;&#x4E3A;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5C31;&#x50CF;&#x300A;&#x5C0F;&#x5077;&#x5BB6;&#x65CF;&#x300B;&#x91CC;&#x7684;&#x201C;&#x7236;&#x4EB2;&#x201D;&#xFF0C;&#x81EA;&#x8BA4;&#x4E3A;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x4F1A;&#x9664;&#x4E86;&#x76D7;&#x7A83;&#xFF0C;&#x5374;&#x6559;&#x4F1A;&#x4E86;&#x7965;&#x592A;&#x5173;&#x4E8E;&#x9752;&#x6625;&#x671F;&#x7684;&#x4E00;&#x5207;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7231;&#x4E0D;&#x50CF;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x5730;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x6A21;&#x677F;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x5E76;&#x4E0D;&#x201C;&#x6807;&#x51C6;&#x201D;&#x7684;&#x5BB6;&#x5EAD;&#xFF0C;&#x5374;&#x62E5;&#x6709;&#x8DB3;&#x4EE5;&#x6253;&#x52A8;&#x6211;&#x4EEC;&#x7684;&#x60C5;&#x611F;&#x4E00;&#x6837;&#x3002;&#x6216;&#x8BB8;&#xFF0C;&#x8FFD;&#x6C42;&#x201C;&#x6807;&#x51C6;&#x201D;&#x672C;&#x6765;&#x5C31;&#x662F;&#x4EF6;&#x611A;&#x8822;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x4EE5;&#x4E3A;&#x4E2A;&#x6027;&#x72EC;&#x7ACB;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6C38;&#x8FDC;&#x88AB;&#x5404;&#x79CD;&#x201C;&#x865A;&#x62DF;&#x201D;&#x7684;&#x4E1C;&#x897F;&#x675F;&#x7F1A;&#x7740;&#xFF0C;&#x6B63;&#x5982;&#x5362;&#x68AD;&#x6240;&#x8A00;&#xFF1A;&#x201C;&#x4EBA;&#x751F;&#x800C;&#x81EA;&#x7531;&#xFF0C;&#x800C;&#x65E0;&#x5F80;&#x4E0D;&#x5728;&#x67B7;&#x9501;&#x4E4B;&#x4E2D;&#x201D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x60F3;&#xFF0C;&#x674E;&#x767D;&#x6292;&#x53D1;&#x201C;&#x4E0D;&#x89C1;&#x957F;&#x5B89;&#x201D;&#x7684;&#x6101;&#x7EEA;&#x65F6;&#xFF0C;&#x5927;&#x62B5;&#x4E0D;&#x4F1A;&#x60F3;&#x5230;&#x65E5;&#x540E;&#x9047;&#x8D66;&#x65F6;&#x7684;&#x5FEB;&#x610F;&#xFF0C;&#x66F4;&#x4E0D;&#x4F1A;&#x60F3;&#x5230;&#x88AB;&#x7384;&#x5B97;&#x9010;&#x51FA;&#x957F;&#x5B89;&#x65F6;&#x7684;&#x5931;&#x610F;&#x3002;&#x53EF;&#x5F53;&#x4F60;&#x771F;&#x7684;&#x4E86;&#x89E3;&#x4E86;&#x4F60;&#x6240;&#x8981;&#x9762;&#x5BF9;&#x7684;&#x4EBA;&#x751F;&#xFF0C;&#x662F;&#x5426;&#x8FD8;&#x6709;&#x52C7;&#x6C14;&#x4F1A;&#x50CF;&#x73B0;&#x5728;&#x8FD9;&#x6837;&#x9009;&#x62E9;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x7684;&#x4EBA;&#x751F;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4ECA;&#x540E;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x552F;&#x4E00;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x63A5;&#x53D7;&#x6211;&#x5DF2;&#x7ECF;&#x5931;&#x53BB;&#x7684;&#x4E00;&#x5207;&#xFF0C;&#x957F;&#x5B89;&#x5E76;&#x4E0D;&#x8DB3;&#x4EE5;&#x5B89;&#xFF0C;&#x4F60;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x4EE4;&#x4F60;&#x5FC3;&#x5B89;&#x7684;&#x4EBA;&#x51FA;&#x73B0;&#x5417;&#xFF1F;&#x957F;&#x5B89;&#x4E0D;&#x89C1;&#xFF0C;&#x4F60;&#x613F;&#x610F;&#x8BA9;&#x6211;&#x89C1;&#x5230;&#x4F60;&#x5417;&#xFF1F;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3111375079/">冬天来了，春天还会远吗？</a></li><li><a href="https://qinyuanpei.github.io/posts/124807650/">在平凡中蜕变，我的2014</a></li><li><a href="https://qinyuanpei.github.io/posts/2617501472/">秋风劲似去年时</a></li><li><a href="http://www.davidfnck.com/talkshow/gambling_life.html/">随笔｜人生就是投资</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/3417652955/" rel="external">长安不见使人愁</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/3417652955/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/3417652955/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/感悟/">感悟</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/矫情/">矫情</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/西安/">西安</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3417652955/&title=《长安不见使人愁》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3417652955/&title=《长安不见使人愁》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3417652955/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《长安不见使人愁》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3417652955/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3417652955/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/3269605707/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">基于WebSocket和Redis实现Bilibili弹幕效果</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1989654282/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">使用.NET Core和Vue搭建WebSocket聊天室</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/3417652955/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/3417652955/&title=《长安不见使人愁》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/3417652955/&title=《长安不见使人愁》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/3417652955/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《长安不见使人愁》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/3417652955/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/3417652955/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/3417652955/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
