<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        基于过滤器实现异常处理的探索 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x6B63;&amp;#x5982;&amp;#x4F60;&amp;#x6240;&amp;#x770B;&amp;#x5230;&amp;#x7684;&amp;#x90A3;&amp;#x6837;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x6211;&amp;#x60F3;&amp;#x548C;&amp;#x5927;&amp;#x5BB6;&amp;#x804A;&amp;#x804A;&amp;#x5F02;&amp;#x5E38;&amp;#x5904;&amp;#x7406;">
<meta name="keywords" content="异常,设计,架构">
<meta property="og:type" content="article">
<meta property="og:title" content="基于过滤器实现异常处理的探索">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/570888918/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6B63;&amp;#x5982;&amp;#x4F60;&amp;#x6240;&amp;#x770B;&amp;#x5230;&amp;#x7684;&amp;#x90A3;&amp;#x6837;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x6211;&amp;#x60F3;&amp;#x548C;&amp;#x5927;&amp;#x5BB6;&amp;#x804A;&amp;#x804A;&amp;#x5F02;&amp;#x5E38;&amp;#x5904;&amp;#x7406;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="基于过滤器实现异常处理的探索">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6B63;&amp;#x5982;&amp;#x4F60;&amp;#x6240;&amp;#x770B;&amp;#x5230;&amp;#x7684;&amp;#x90A3;&amp;#x6837;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x6211;&amp;#x60F3;&amp;#x548C;&amp;#x5927;&amp;#x5BB6;&amp;#x804A;&amp;#x804A;&amp;#x5F02;&amp;#x5E38;&amp;#x5904;&amp;#x7406;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">基于过滤器实现异常处理的探索</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">基于过滤器实现异常处理的探索</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-05-20T20:10:28.000Z" itemprop="datePublished" class="page-time">
  2017-05-20
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/编程语言/">编程语言</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#异常和错误"><span class="post-toc-number">1.</span> <span class="post-toc-text">异常和错误</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#Checked-Exception"><span class="post-toc-number">2.</span> <span class="post-toc-text">Checked Exception</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#让异常处理更优雅"><span class="post-toc-number">3.</span> <span class="post-toc-text">让异常处理更优雅</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">4.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-基于过滤器实现异常处理的探索" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">基于过滤器实现异常处理的探索</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-05-20 20:10:28" datetime="2017-05-20T20:10:28.000Z" itemprop="datePublished">2017-05-20</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/编程语言/">编程语言</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        38 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x60F3;&#x548C;&#x5927;&#x5BB6;&#x804A;&#x804A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;&#x800C;&#x6211;&#x4ECA;&#x5929;&#x60F3;&#x548C;&#x5927;&#x5BB6;&#x63A2;&#x8BA8;&#x7684;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x5C06;&#x5176;&#x79F0;&#x4E4B;&#x4E3A;&#x57FA;&#x4E8E;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x79CD;&#x5B9A;&#x4E49;&#x662F;&#x5426;&#x51C6;&#x786E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x5728;&#x8981;&#x5F15;&#x5165;AOP&#x7684;&#x6982;&#x5FF5;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x5C31;&#x4ECE;<strong>try-catch</strong>&#x8F6C;&#x5411;<strong>Interceptor</strong>&#x3002;&#x867D;&#x7136;&#x9996;&#x5E2D;&#x67B6;&#x6784;&#x6781;&#x529B;&#x63A8;&#x8350;&#xFF0C;&#x4F7F;&#x7528;Unity&#x6846;&#x67B6;&#x6765;&#x62E6;&#x622A;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x5404;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x53EF;&#x4ECE;&#x6211;&#x6700;&#x521D;&#x7EA0;&#x7ED3;&#x4E8E;&#x201D;return&#x201D;&#x548C;&#x201D;throw&#x201D;&#x7684;&#x53D6;&#x820D;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x6211;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x5730;&#x4F7F;&#x7528;&#x548C;&#x6355;&#x6349;&#x81EA;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#xFF0C;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x8001;&#x8001;&#x5B9E;&#x5B9E;&#x5730;&#x5B9E;&#x8DF5;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x7ECF;&#x5178;&#x505A;&#x6CD5;&#xFF0C;&#x6BD4;&#x4F7F;&#x7528;AOP&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x6982;&#x5FF5;&#x8981;&#x6709;&#x610F;&#x4E49;&#x5730;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x76F8;&#x4FE1;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x5730;&#x4E86;&#x89E3;&#x4E86;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3002;</p>
<h1 id="&#x5F02;&#x5E38;&#x548C;&#x9519;&#x8BEF;"><a href="#&#x5F02;&#x5E38;&#x548C;&#x9519;&#x8BEF;" class="headerlink" title="&#x5F02;&#x5E38;&#x548C;&#x9519;&#x8BEF;"></a>&#x5F02;&#x5E38;&#x548C;&#x9519;&#x8BEF;</h1><p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x4EBA;&#x7C7B;&#x5BF9;&#x673A;&#x5668;&#x65F6;&#x4EE3;&#x5145;&#x6EE1;&#x4E86;&#x8FD1;&#x4E4E;&#x82DB;&#x523B;&#x7684;&#x61A7;&#x61AC;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x5728;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x88AB;&#x544A;&#x77E5;&#x4E0D;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x4EEC;&#x7684;&#x6559;&#x79D1;&#x4E66;&#x4E0A;&#x4F1A;&#x7528;&#x4E00;&#x79CD;&#x5145;&#x6EE1;&#x4F20;&#x5947;&#x8272;&#x5F69;&#x7684;&#x53E3;&#x543B;&#xFF0C;&#x6765;&#x8BB2;&#x8FF0;&#x4E00;&#x4E2A;&#x56E0;&#x4E3A;&#x7C97;&#x5FC3;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x8BA1;&#x7B97;&#x9519;&#x4E86;&#x5C0F;&#x6570;&#x70B9;&#x800C;&#x5BFC;&#x81F4;&#x822A;&#x5929;&#x98DE;&#x884C;&#x5668;&#x673A;&#x6BC1;&#x4EBA;&#x4EA1;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x53EF;&#x662F;&#x4EBA;&#x7C7B;&#x5E38;&#x5E38;&#x4F1A;&#x5BF9;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x5BBD;&#x5BB9;&#xFF0C;&#x800C;&#x5BF9;&#x4ED6;&#x4EBA;&#x5219;&#x9009;&#x62E9;&#x4E25;&#x683C;&#xFF0C;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#x5728;&#x6574;&#x4E2A;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x66F4;&#x4E3A;&#x51F8;&#x663E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5BB9;&#x5FCD;&#x4E00;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65E0;&#x8BBA;&#x66FE;&#x7ECF;&#x4EBA;&#x4EEC;&#x4E3A;&#x6B64;&#x4ED8;&#x51FA;&#x8FC7;&#x591A;&#x5C11;&#x52AA;&#x529B;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x77AC;&#x95F4;&#x4ED6;&#x4EEC;&#x7684;&#x4EF7;&#x503C;&#x90FD;&#x5C06;&#x4E0D;&#x590D;&#x5B58;&#x5728;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x8FD9;&#x79CD;&#x82DB;&#x523B;&#x8FEB;&#x4F7F;&#x6211;&#x4EEC;&#x4E0D;&#x5141;&#x8BB8;&#x8F6F;&#x4EF6;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6D4B;&#x8BD5;&#x6765;&#x907F;&#x514D;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#xFF0C;&#x53EF;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x6700;&#x7EC8;&#x4F1A;&#x6F14;&#x53D8;&#x4E3A;&#x4E00;&#x4E2A;&#x59A5;&#x534F;&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x4EFB;&#x4F55;&#x7684;&#x5F62;&#x5F0F;&#x5316;&#x65B9;&#x6CD5;&#x6700;&#x7EC8;&#x90FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E00;&#x751F;&#x90FD;&#x4E0D;&#x4F1A;&#x72AF;&#x9519;&#xFF0C;&#x800C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x540C;&#x6837;&#x662F;&#x4EBA;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x8981;&#x6C42;&#x4ED6;&#x4EEC;&#x4E0D;&#x53EF;&#x4EE5;&#x72AF;&#x9519;&#x5462;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x627F;&#x8BA4;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x662F;&#x4E00;&#x4E2A;&#x6301;&#x7EED;&#x6F14;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x629B;&#x5F00;&#x5546;&#x4E1A;&#x610F;&#x4E49;&#x4E0A;&#x7684;<strong>Deadline</strong>&#x6765;&#x8BF4;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8F6F;&#x4EF6;&#x662F;&#x6C38;&#x8FDC;&#x6CA1;&#x6709;&#x5199;&#x5B8C;&#x7684;&#x90A3;&#x4E00;&#x5929;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5DE5;&#x7A0B;&#x5E08;&#x90FD;&#x6709;&#x70B9;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x5916;&#x754C;&#x73AF;&#x5883;&#x56E0;&#x7D20;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x671F;&#x5F85;&#x8F6F;&#x4EF6;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x4EA7;&#x751F;&#xFF0C;&#x8FD9;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x79CD;&#x82DB;&#x523B;&#x5730;&#x8981;&#x6C42;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x9891;&#x7E41;&#x5730;&#x63D0;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x5F02;&#x5E38;&#x548C;&#x9519;&#x8BEF;&#x5206;&#x522B;&#x662F;&#x6307;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x5F02;&#x5E38;&#x662F;&#x6307;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x660E;&#x786E;&#x9884;&#x6D4B;&#x5230;&#x5B83;&#x4F1A;&#x53D1;&#x751F;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x800C;&#x9519;&#x8BEF;&#x662F;&#x6307;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x660E;&#x786E;&#x9884;&#x6D4B;&#x5230;&#x5B83;&#x4F1A;&#x53D1;&#x751F;&#x5E76;&#x4E14;&#x5B83;&#x4F1A;&#x7A0B;&#x5E8F;&#x6D41;&#x7A0B;&#x4E2D;&#x65AD;&#x800C;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BA4;&#x4E3A;&#x533A;&#x5206;&#x201D;&#x5F02;&#x5E38;&#x201D;&#x548C;&#x201D;&#x9519;&#x8BEF;&#x201D;&#x6700;&#x76F4;&#x89C2;&#x3001;&#x6700;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6355;&#x6349;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x5E76;&#x5904;&#x7406;&#x4E86;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x662F;&#x5F02;&#x5E38;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x4EFB;&#x7531;&#x5F02;&#x5E38;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;Crash&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x56E0;&#x4E3A;&#x754F;&#x60E7;&#x5F02;&#x5E38;&#x800C;&#x7ED9;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x589E;&#x52A0;try-catch&#xFF0C;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x9057;&#x61BE;&#x5F97;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x660E;&#x767D;&#x4EC0;&#x4E48;&#x662F;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x65E9;&#x671F;&#x7684;Win32 API&#x4E2D;&#xFF0C;&#x5FAE;&#x8F6F;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x4E86;&#x9519;&#x8BEF;&#x7801;&#x6765;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F15;&#x51FA;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x662F;&#x5E94;&#x8BE5;&#x662F;&#x4F7F;&#x7528;&#x9519;&#x8BEF;&#x7801;&#x8FD8;&#x662F;&#x5F02;&#x5E38;&#x6765;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#xFF1F;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4E24;&#x8005;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x4E0A;&#x7B49;&#x4EF7;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x5411;&#x8C03;&#x7528;&#x8005;&#x4F20;&#x8FBE;&#x201D;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x201C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x8B6C;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x96C6;&#x5408;&#x4E2D;&#x67E5;&#x627E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x679C;&#x5143;&#x7D20;&#x4E0D;&#x5B58;&#x5728;&#x5219;&#x8FD4;&#x56DE;-1&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x9519;&#x8BEF;&#x7801;&#x6765;&#x8868;&#x793A;&#x201D;&#x9519;&#x8BEF;&#x201C;&#x7684;&#x7ECF;&#x5178;&#x6848;&#x4F8B;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x79CD;&#x4ECE;C/C++&#x65F6;&#x4EE3;&#x9057;&#x7559;&#x4E0B;&#x6765;&#x7684;&#x4F20;&#x7EDF;&#x89E3;&#x91CA;&#x4E86;Win32 API&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x9009;&#x62E9;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x9009;&#x62E9;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x4ECE;API&#x98CE;&#x683C;&#x3001;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x548C;&#x6027;&#x80FD;&#x6307;&#x6807;&#x7B49;&#x65B9;&#x9762;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x9519;&#x8BEF;&#x7801;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x7F3A;&#x9677;&#x4E3B;&#x8981;&#x5728;&#x4E8E;&#xFF0C;&#x9519;&#x8BEF;&#x7801;&#x4E0D;&#x80FD;&#x660E;&#x786E;&#x5730;&#x544A;&#x8BC9;&#x8C03;&#x7528;&#x8005;&#x5230;&#x5E95;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x9519;&#x8BEF;&#xFF0C;&#x9664;&#x975E;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x66F4;&#x591A;&#x7684;&#x9519;&#x8BEF;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6CA1;&#x6709;&#x5F15;&#x5165;&#x53EF;&#x7A7A;&#x7C7B;&#x578B;&#x4EE5;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x907F;&#x514D;&#x9519;&#x8BEF;&#x7801;&#x6C61;&#x67D3;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x503C;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x96C6;&#x5408;&#x4E2D;&#x6070;&#x597D;&#x6709;&#x4E00;&#x4E2A;&#x5143;&#x7D20;-1&#xFF0C;&#x90A3;&#x4E48;&#x901A;&#x8FC7;-1&#x8FD9;&#x4E2A;&#x8FD4;&#x56DE;&#x503C;&#x6211;&#x4EEC;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5224;&#x65AD;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;-1&#x5230;&#x5E95;&#x662F;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x53D1;&#x751F;&#x4E86;&#x9519;&#x8BEF;&#x800C;&#x8FD4;&#x56DE;-1.</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x8BF4;&#x5F02;&#x5E38;&#xFF0C;&#x5F02;&#x5E38;&#x5728;&#x4E3B;&#x6D41;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CC;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x914D;&#x3002;&#x5F02;&#x5E38;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x4ECE;&#x5F02;&#x5E38;&#x629B;&#x51FA;&#x70B9;&#x5230;&#x5F02;&#x5E38;&#x6355;&#x83B7;&#x70B9;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x5F02;&#x5E38;&#x76F8;&#x6BD4;&#x9519;&#x8BEF;&#x7801;&#x53EF;&#x4EE5;&#x6301;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x53BB;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8BA9;&#x8FD4;&#x56DE;&#x503C;&#x66F4;&#x4E30;&#x5BCC;:)&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x542C;&#x5230;&#x201D;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x4F1A;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x53EF;&#x8FD9;&#x90E8;&#x5206;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x7684;&#x65F6;&#x5019;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x516C;&#x5E73;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x5728;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#xFF1F;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x7684;&#x597D;&#x5904;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x4EE5;&#x4E00;&#x79CD;&#x66F4;&#x5B89;&#x5168;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x5904;&#x7406;&#x5F02;&#x5E38;&#xFF0C;&#x53EF;&#x4E00;&#x65E6;&#x53D1;&#x751F;&#x4E86;&#x5F02;&#x5E38;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;.NET&#x4E2D;&#x63D0;&#x4F9B;TryParse&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF1A;&#x5982;&#x679C;&#x9884;&#x6D4B;&#x5230;&#x5F02;&#x5E38;&#x4E00;&#x5B9A;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x6B63;&#x786E;&#x7684;&#x7B56;&#x7565;&#x4E0D;&#x662F;&#x53BB;&#x6355;&#x6349;&#x5B83;&#x800C;&#x662F;&#x53BB;&#x56DE;&#x907F;&#x5B83;&#x3002;&#x5728;&#x300A;&#x7F16;&#x5199;&#x9AD8;&#x8D28;&#x91CF;&#x7684;C#&#x4EE3;&#x7801;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x66FE;&#x5EFA;&#x8BAE;&#xFF1A;&#x4E0D;&#x8981;&#x5728;foreach&#x5185;&#x90E8;&#x4F7F;&#x7528;try-catch&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x5373;&#x91C7;&#x7528;&#x9632;&#x5FA1;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x7B56;&#x7565;&#x6765;&#x56DE;&#x907F;&#x5F02;&#x5E38;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x603B;&#x662F;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x2003;&#x2003;&#x90A3;&#x4E48;&#xFF0C;&#x603B;&#x7ED3;&#x4E0B;&#x884C;&#x6587;&#x81F3;&#x6B64;&#x7684;&#x89C2;&#x70B9;&#xFF1A;&#x5F02;&#x5E38;&#x662F;&#x5F3A;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684;&#x5206;&#x652F;&#x5904;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x9519;&#x8BEF;&#x7801;&#x662F;&#x5F31;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x7C7B;&#x578B;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x5206;&#x652F;&#x5904;&#x7406;&#x6280;&#x672F;&#x3002;&#x5143;&#x7EC4;&#x7B49;&#x53EF;&#x4EE5;&#x8BA9;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x591A;&#x4E2A;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4ECE;&#x7406;&#x8BBA;&#x5C42;&#x9762;&#x4E0A;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x5F02;&#x5E38;&#xFF0C;&#x5373;&#x5C06;&#x66F4;&#x591A;&#x7684;&#x7EC6;&#x8282;&#x4FE1;&#x606F;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x76F8;&#x6BD4;&#x7531;&#x8FD0;&#x884C;&#x65F6;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x7684;&#x5F02;&#x5E38;&#x673A;&#x5236;&#xFF0C;&#x5728;&#x6027;&#x80FD;&#x6307;&#x6807;&#x548C;&#x5806;&#x6808;&#x8C03;&#x7528;&#x4E0A;&#x90FD;&#x5B58;&#x5728;&#x7F3A;&#x9677;&#x3002;&#x5F02;&#x5E38;&#x5728;&#x88AB;&#x8FD0;&#x884C;&#x65F6;&#x629B;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x662F;&#x4E0B;&#x964D;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8C03;&#x7528;&#x8005;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x7EC6;&#x8282;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x5EFA;&#x8BAE;&#x5728;&#x6240;&#x6709;&#x573A;&#x5408;&#x90FD;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x9632;&#x5FA1;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x7B56;&#x7565;&#x53BB;&#x56DE;&#x907F;&#x5F02;&#x5E38;&#xFF0C;&#x76F4;&#x5230;&#x786E;&#x5B9A;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5904;&#x7406;&#x4E0B;&#x53BB;&#x7684;&#x65F6;&#x5019;&#x518D;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x6240;&#x6709;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5F02;&#x5E38;&#x90FD;&#x5E94;&#x8BE5;&#x53BB;&#x6355;&#x6349;&#x5E76;&#x5904;&#x7406;&#xFF0C;&#x5426;&#x5219;&#x5B9A;&#x4E49;&#x8FD9;&#x4E9B;&#x81EA;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5E94;&#x8BE5;&#x62E5;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5230;&#x5904;try-catch&#x548C;&#x8BB0;&#x65E5;&#x5FD7;&#x662F;&#x79CD;&#x975E;&#x5E38;&#x4E11;&#x964B;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x5E94;&#x8BE5;&#x575A;&#x51B3;&#x6452;&#x5F03;&#x3002;</p>
<h1 id="Checked-Exception"><a href="#Checked-Exception" class="headerlink" title="Checked Exception"></a>Checked Exception</h1><p>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x57A0;&#x795E;&#x5199;&#x4E86;&#x4E00;&#x7BC7;&#x65B0;&#x7684;&#x6587;&#x7AE0;<a href="http://www.yinwang.org/blog-cn/2017/05/23/kotlin" target="_blank" rel="noopener">&#x300A;Kotlin&#x548C;Checked Exception&#x300B;</a>&#xFF0C;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x57A0;&#x795E;&#x63D0;&#x5230;&#x4E86;Checked Exception&#x8FD9;&#x79CD;&#x9488;&#x5BF9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x6070;&#x597D;&#x6211;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5199;&#x7684;&#x540C;&#x6837;&#x662F;&#x5F02;&#x5E38;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x5728;&#x4E0B;&#x9762;&#x63D0;&#x5230;&#x7684;&#x57FA;&#x4E8E;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x65B9;&#x6848;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x79CD;Checked Exception&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x867D;&#x7136;&#x5728;.NET&#x4E2D;&#x4E0D;&#x5B58;&#x5728;Checked Exception&#x3002;</p>
<p>&#x2003;&#x2003;&#x8981;&#x4E86;&#x89E3;&#x4EC0;&#x4E48;&#x662F;Checked Exception&#xFF0C;&#x8981;&#x4ECE;Java&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x673A;&#x5236;&#x8BF4;&#x8D77;&#x3002;Java&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x7C7B;&#x5168;&#x90E8;&#x7EE7;&#x627F;&#x81EA;Throwable&#xFF0C;&#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x76F4;&#x63A5;&#x5B50;&#x7C7B;Error&#x548C;Exception&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;Error&#x662F;&#x6307;Java&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x6240;&#x4EE5;Error&#x4E0D;&#x9700;&#x8981;&#x6355;&#x6349;&#x6216;&#x8005;&#x629B;&#x51FA;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x6B64;&#x8868;&#x793A;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#xFF1B;&#x800C;Exception&#x5219;&#x662F;&#x6307;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4E2D;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x7C7B;&#x9519;&#x8BEF;&#x9700;&#x8981;&#x8C03;&#x7528;&#x8005;&#x53BB;&#x6355;&#x6349;&#x548C;&#x5904;&#x7406;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x5206;&#x7C7B;&#x4E0B;&#xFF0C;Java&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;Checked Exception(<strong>&#x53D7;&#x68C0;&#x67E5;&#x7684;&#x5F02;&#x5E38;</strong>)&#x548C;Unchecked Exception(<strong>&#x672A;&#x53D7;&#x68C0;&#x67E5;&#x7684;&#x5F02;&#x5E38;</strong>)&#xFF0C;&#x524D;&#x8005;&#x9700;&#x8981;&#x9700;&#x8981;&#x65B9;&#x6CD5;&#x5F3A;&#x5236;&#x5B9E;&#x73B0;throws&#x58F0;&#x660E;&#x6216;&#x8005;&#x662F;&#x4F7F;&#x7528;try-catch&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#x7F16;&#x8F91;&#x5668;&#x5C31;&#x4F1A;&#x76F4;&#x63A5;&#x62A5;&#x9519;&#xFF0C;&#x540E;&#x8005;&#x5C31;&#x76F8;&#x5BF9;&#x5BBD;&#x5BB9;&#x5566;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x9738;&#x9053;&#x7684;&#x6761;&#x6B3E;&#xFF0C;&#x53EF;&#x662F;&#x8BE1;&#x5F02;&#x7684;&#x662F;RuntimeException&#x662F;&#x4E00;&#x4E2A;UncheckedException&#xFF0C;&#x53EF;&#x5B83;&#x5C45;&#x7136;&#x662F;&#x7EE7;&#x627F;&#x81EA;Exception&#x800C;&#x4E0D;&#x662F;Error&#xFF0C;&#x8FD9;&#x5B9E;&#x5728;&#x4EE4;&#x4EBA;&#x8D39;&#x89E3;&#xFF0C;Java&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x679C;&#x7136;&#x535A;&#x5927;&#x7CBE;&#x6DF1;&#x3002;</p>
<p>&#x2003;&#x2003;&#x90A3;&#x4E48;&#x5BF9;&#x4E00;&#x4E2A;Checked Exception&#xFF0C;Java&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x662F;&#x5341;&#x5206;&#x5730;&#x9738;&#x9053;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;<br></p><figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">Foo</span><span class="params">(<span class="built_in">string</span> fileName)</span> throws FileNotFoundException</span></span><br><span class="line"><span class="function"></span>{</span><br><span class="line">  <span class="keyword">if</span>(...) <span class="keyword">throw</span> <span class="keyword">new</span> FileNotFoundException();</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;Java&#x5F3A;&#x5236;&#x8BA9;Foo()&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x4E86;throws&#x58F0;&#x660E;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x5728;&#x8BE5;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x53D1;FileNotFoundException&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x9075;&#x4ECE;&#x8FD9;&#x4E00;&#x201D;&#x9738;&#x738B;&#x6761;&#x6B3E;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x7F16;&#x8BD1;&#xFF0C;&#x800C;&#x5728;&#x8C03;&#x7528;&#x8005;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;Java&#x7684;&#x9738;&#x9053;&#x5219;&#x4F53;&#x73B0;&#x5728;&#x8981;&#x6C42;&#x8C03;&#x7528;&#x8005;&#x4F7F;&#x7528;try-catch&#x7ED3;&#x6784;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x6216;&#x8005;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;throws&#x58F0;&#x660E;&#x6765;&#x4F7F;&#x5F02;&#x5E38;&#x7EE7;&#x7EED;&#x5411;&#x4E0A;&#x4F20;&#x9012;&#xFF0C;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x5C06;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x79F0;&#x4E4B;&#x4E3A;&#x4E00;&#x79CD;&#x7406;&#x60F3;&#x72B6;&#x6001;&#x4E0B;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x673A;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x8BFB;&#x5199;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9664;&#x4E86;FileNotFoundException&#x4EE5;&#x5916;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x9047;&#x5230;FileLoadException&#x3001;PathTooLongException&#x3001;EndOfStreamException&#x7B49;&#x7B49;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x5728;&#x4E1A;&#x52A1;&#x5C42;&#x9762;&#x4E0A;&#x662F;&#x65E0;&#x5DEE;&#x522B;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x8BA4;&#x4E3A;&#x5C06;&#x5F02;&#x5E38;&#x7EC6;&#x5206;&#x5230;&#x5982;&#x6B64;&#x7CBE;&#x7EC6;&#x7684;&#x7A0B;&#x5EA6;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x7528;&#x6237;&#x800C;&#x8A00;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5B83;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x5426;&#x6210;&#x529F;&#x8BFB;&#x5199;&#x4E86;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x5F02;&#x5E38;&#x539F;&#x56E0;&#x7528;&#x6237;&#x5E76;&#x4E0D;&#x60F3;&#x771F;&#x7684;&#x77E5;&#x9053;&#xFF0C;&#x53EF;&#x662F;Java&#x7684;Checked Exception&#x5728;&#x9762;&#x5BF9;&#x8FD9;&#x79CD;&#x5904;&#x5883;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6574;&#x4F53;&#x800C;&#x8A00;&#x662F;&#x663E;&#x5F97;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x65B9;&#x6CD5;&#x4ECE;&#x58F0;&#x660E;&#x8BE5;&#x65B9;&#x6CD5;&#x4F1A;&#x5F15;&#x51FA;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x5BF9;&#x65B9;&#x6CD5;&#x7684;&#x7F16;&#x5199;&#x8005;&#x548C;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x8005;&#x6765;&#x8BF4;&#x90FD;&#x5F88;&#x75DB;&#x82E6;&#x3002;</p>
<p>&#x2003;&#x2003;&#x57A0;&#x795E;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5176;&#x5B9E;&#x5728;&#x8BF4;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;Checked Exception&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x8005;&#x4E3B;&#x52A8;&#x544A;&#x77E5;&#x8C03;&#x7528;&#x8005;&#x6765;&#x6355;&#x83B7;&#x7279;&#x5B9A;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x79CD;&#x601D;&#x8DEF;&#x5B8C;&#x5168;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x8C03;&#x7528;&#x8005;&#x5982;&#x4F55;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x5B83;&#x9700;&#x8981;&#x6355;&#x83B7;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x6BCF;&#x6B21;&#x90FD;&#x901A;&#x8FC7;&#x201D;&#x8F6C;&#x5230;&#x5B9A;&#x4E49;&#x201D;&#x529F;&#x80FD;&#x53BB;&#x770B;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4F1A;&#x5F15;&#x53D1;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#xFF0C;&#x57A0;&#x795E;&#x4ECE;PL&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x9759;&#x6001;&#x5206;&#x6790;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x5F02;&#x5E38;&#xFF0C;&#x57A0;&#x795E;&#x5410;&#x69FD;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x4E0D;&#x5206;&#x9752;&#x7EA2;&#x7682;&#x767D;&#x6EE5;&#x7528;try-catch&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;Java&#x6807;&#x51C6;&#x5E93;&#x91CC;&#x5BF9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x76F8;&#x5F53;&#x6DF7;&#x4E71;&#xFF0C;&#x867D;&#x7136;&#x5B98;&#x65B9;&#x9F13;&#x52B1;&#x4F7F;&#x7528;Checked Exception&#xFF0C;&#x4F46;&#x662F;&#x6807;&#x51C6;&#x5E93;&#x5B9E;&#x73B0;&#x548C;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E0A;&#x4E0D;&#x4E4F;&#x5C06;&#x5F02;&#x5E38;&#x5305;&#x88C5;&#x4E3A;RuntimeException&#x6765;&#x89C4;&#x907F;Check&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;Checked Exception&#x5728;&#x5DE5;&#x7A0B;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x6700;&#x5927;&#x8D21;&#x732E;&#x662F;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#x8BE5;&#x629B;&#x51FA;&#x4EC0;&#x4E48;&#x5F02;&#x5E38;&#x5C31;&#x5E94;&#x8BE5;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x5FEB;&#x8BFB;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5230;&#x4E86;&#x53D1;&#x5E03;&#x9636;&#x6BB5;&#x5219;&#x5E94;&#x8BE5;&#x5C06;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x90FD;catch&#x4F4F;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x6837;&#x7528;&#x6237;&#x5C31;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x5947;&#x8469;&#x7684;&#x5F02;&#x5E38;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x53BB;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5F02;&#x5E38;&#x673A;&#x5236;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53BB;&#x6355;&#x83B7;&#x90A3;&#x4E9B;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5F02;&#x5E38;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x2003;&#x2003;C#&#x4E2D;&#x5176;&#x5B9E;&#x662F;&#x7531;&#x7C7B;&#x4F3C;Checked Exception&#x7684;&#x6982;&#x5FF5;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x6240;&#x6709;&#x7684;Check&#x90FD;&#x4E0D;&#x662F;&#x5F3A;&#x5236;&#x53BB;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;.NET&#x4E2D;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4F1A;&#x629B;&#x51FA;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#x5B8C;&#x5168;&#x662F;&#x7531;&#x6CE8;&#x91CA;&#x6765;&#x8BF4;&#x660E;&#x7684;&#xFF0C;XML&#x6CE8;&#x91CA;&#x4E2D;&#x7684;exception&#x8282;&#x70B9;&#x8868;&#x793A;&#x8BE5;&#x65B9;&#x6CD5;&#x4F1A;&#x5F15;&#x53D1;&#x4F55;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<br></p><figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment"><span class="doctag">///</span> <span class="doctag">&lt;exception cref=&quot;MasterFileFormatCorruptException&quot;&gt;</span><span class="doctag">&lt;/exception&gt;</span></span></span><br><span class="line"><span class="comment"><span class="doctag">///</span> <span class="doctag">&lt;exception cref=&quot;MasterFileLockedOpenException&quot;&gt;</span><span class="doctag">&lt;/exception&gt;</span></span></span><br><span class="line"><span class="function"><span class="keyword">public</span> <span class="keyword">static</span> <span class="keyword">void</span> <span class="title">ReadRecord</span>(<span class="params"><span class="keyword">int</span> flag</span>) </span></span><br><span class="line"><span class="function"></span>{</span><br><span class="line">     <span class="keyword">if</span> (flag == <span class="number">1</span>)</span><br><span class="line">        <span class="keyword">throw</span> <span class="keyword">new</span> MasterFileFormatCorruptException();</span><br><span class="line">     <span class="keyword">else</span> <span class="keyword">if</span> (flag == <span class="number">2</span>)</span><br><span class="line">        <span class="keyword">throw</span> <span class="keyword">new</span> MasterFileLockedOpenException();</span><br><span class="line">     <span class="comment">// &#x2026;</span></span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;C#&#x91C7;&#x7528;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x76F8;&#x5BF9;&#x6E29;&#x548C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5373;&#x6587;&#x6863;&#x4F1A;&#x660E;&#x786E;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x4EE5;&#x53CA;&#x5F15;&#x53D1;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x662F;&#x5426;&#x8981;&#x6355;&#x83B7;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x5219;&#x5B8C;&#x5168;&#x7531;&#x8C03;&#x7528;&#x8005;&#x51B3;&#x5B9A;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;C#&#x4E4B;&#x7236;Hejlsberg&#x5728;&#x6743;&#x8861;&#x540E;&#x5728;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E0A;&#x9009;&#x62E9;&#x7684;&#x4E00;&#x79CD;&#x59A5;&#x534F;&#xFF0C;&#x56E0;&#x4E3A;Java&#x7684;Checked Exception&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8272;&#x5F69;&#x7A0D;&#x91CD;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x6240;&#x6709;&#x573A;&#x666F;&#x4E0B;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x53BB;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x6240;&#x4EE5;Checked Exception&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x53EA;&#x9700;&#x8981;&#x6355;&#x83B7;&#x57FA;&#x7C7B;&#x5F02;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x6355;&#x83B7;&#x5404;&#x79CD;&#x5B50;&#x7C7B;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x96BE;&#x9053;&#x4E0D;&#x6709;&#x70B9;&#x77EB;&#x6789;&#x8FC7;&#x6B63;&#x7684;&#x611F;&#x89C9;&#x5417;&#xFF1F;&#x4E8B;&#x5B9E;&#x4E0A;&#x6240;&#x6709;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4E0D;&#x5206;&#x9752;&#x7EA2;&#x7682;&#x767D;&#x76F4;&#x63A5;&#x6355;&#x83B7;Exception&#x7236;&#x7C7B;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x8C03;&#x7528;&#x8005;&#x5B8C;&#x5168;&#x4E0D;&#x60F3;&#x5173;&#x6CE8;&#x53D1;&#x751F;&#x5F97;&#x5F02;&#x5E38;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x662F;&#x57A0;&#x795E;&#x5728;&#x6587;&#x7AE0;&#x4E2D;&#x5410;&#x69FD;&#x7684;&#x201D;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#x201D;&#xFF0C;C#&#x76F8;&#x5BF9;Java&#x5728;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4E0A;&#x597D;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x4F1A;&#x81EA;&#x89C9;&#x5730;&#x5904;&#x7406;&#x5F02;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#x5F02;&#x5E38;&#x4F1A;&#x53D1;&#x751F;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x53BB;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x3002;&#x4F60;&#x4E0D;&#x80FD;&#x5F3A;&#x8FEB;&#x4ED6;&#x4EEC;&#x53BB;&#x505A;&#x4ED6;&#x4EEC;&#x4E0D;&#x559C;&#x6B22;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<h1 id="&#x8BA9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x66F4;&#x4F18;&#x96C5;"><a href="#&#x8BA9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x66F4;&#x4F18;&#x96C5;" class="headerlink" title="&#x8BA9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x66F4;&#x4F18;&#x96C5;"></a>&#x8BA9;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x66F4;&#x4F18;&#x96C5;</h1><p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x8003;&#x8651;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8BBE;&#x8BA1;Checked Exception&#x7684;&#x521D;&#x8877;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E2D;&#x4E0D;&#x540C;&#x7684;&#x5177;&#x4F53;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x9762;&#x4E0A;&#x65E0;&#x5DEE;&#x522B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x7BA1;&#x662F;&#x54EA;&#x79CD;&#x5177;&#x4F53;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x9762;&#x90FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x6355;&#x83B7;&#x57FA;&#x7C7B;&#x5F02;&#x5E38;&#x5373;&#x53EF;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x8BFB;&#x5199;&#x6587;&#x4EF6;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x5173;&#x6CE8;IOException&#x5373;&#x53EF;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5177;&#x4F53;&#x5F02;&#x5E38;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x9762;&#x4E0A;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#x5462;&#xFF1F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x5C31;&#x5E94;&#x8BE5;&#x5411;Checked Exception&#x65B9;&#x5411;&#x9760;&#x62E2;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x8D77;&#x542C;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x9700;&#x8981;&#x4ECE;&#x591A;&#x4E2A;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x6293;&#x53D6;&#x6570;&#x636E;&#x5E76;&#x751F;&#x6210;&#x62A5;&#x8868;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x5728;&#x8BBE;&#x8BA1;&#x4E0A;&#x90FD;&#x5B58;&#x5728;&#x7F3A;&#x9677;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6293;&#x53D6;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x8C28;&#x614E;&#x5730;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#xFF0C;&#x7528;&#x6237;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4E00;&#x79CD;&#x89C6;&#x89C9;&#x53CB;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C06;&#x62A5;&#x8868;&#x8F93;&#x51FA;&#x51FA;&#x6765;&#xFF0C;&#x5F53;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x65F6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x6293;&#x53D6;&#x5931;&#x8D25;&#x7684;&#x6570;&#x636E;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x76F8;&#x5173;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x6765;&#x63D0;&#x9192;&#x7528;&#x6237;&#x6765;Check&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6BCF;&#x79CD;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#x5176;&#x5904;&#x7406;&#x903B;&#x8F91;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x5C06;&#x8FD1;10&#x79CD;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x4E3A;&#x7528;&#x6237;&#x8BBE;&#x8BA1;&#x4E86;&#x5B8C;&#x5584;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x542C;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#xFF0C;&#x6700;&#x7EC8;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x5927;&#x6982;&#x662F;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;<br></p><figure class="highlight vim"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">try</span></span><br><span class="line">{</span><br><span class="line">  Foo()</span><br><span class="line">}<span class="keyword">catch</span>(ExceptionA <span class="keyword">ex</span>){</span><br><span class="line">  </span><br><span class="line">}<span class="keyword">catch</span>(ExceptionB <span class="keyword">ex</span>){</span><br><span class="line">  </span><br><span class="line">}<span class="keyword">catch</span>(ExceptionC <span class="keyword">ex</span>){</span><br><span class="line">  </span><br><span class="line">}carch(ExceptionD <span class="keyword">ex</span>){</span><br><span class="line">  </span><br><span class="line">}</span><br><span class="line">// ...</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x76F8;&#x4FE1;&#x5728;Java&#x7684;&#x76F8;&#x5173;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x6559;&#x79D1;&#x4E66;&#x822C;&#x7684;&#x4EE3;&#x7801;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x91D1;&#x79D1;&#x7389;&#x5F8B;&#x5566;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5199;&#x8D77;&#x6765;&#x4F1A;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x5934;&#x91CD;&#x811A;&#x8F7B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x91CD;&#x8981;&#x7684;&#x903B;&#x8F91;&#x90FD;&#x5199;&#x5728;&#x4E86;catch&#x5757;&#x91CC;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x975E;&#x5E38;&#x4E0D;&#x559C;&#x6B22;&#x8FD9;&#x79CD;&#x201D;&#x81C3;&#x80BF;&#x201D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x4E8B;&#x5B9E;&#x4E0A;&#x5728;&#x8FD9;&#x4E2A;&#x6848;&#x4F8B;&#x4E2D;catch&#x5757;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x5177;&#x5907;&#x53EF;&#x91CD;&#x7528;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x4EE5;&#x4E00;&#x79CD;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x91CD;&#x6784;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x6570;&#x5B66;&#x9886;&#x57DF;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x53D8;&#x7684;&#x771F;&#x7406;&#xFF0C;&#x5373;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x6765;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#xFF0C;&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#x540C;&#x6837;&#x9002;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x516C;&#x53F8;&#x91CC;&#x53D7;&#x5230;&#x540C;&#x4E8B;Wesley&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x5BF9;Ioc&#x548C;AOP&#x90FD;&#x4ECE;&#x601D;&#x60F3;&#x4E0A;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x8BA4;&#x8BC6;&#xFF0C;&#x516C;&#x53F8;&#x5728;&#x63A8;&#x884C;Unity&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x591A;&#x5C11;&#x5B9E;&#x9645;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5BF9;&#x201D;&#x9053;&#x201D;&#x7684;&#x91CD;&#x89C6;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x5BF9;&#x201D;&#x672F;&#x201D;&#x7684;&#x8FFD;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x76F8;&#x4FE1;&#x6846;&#x67B6;&#x5B66;&#x4E60;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x4F1A;&#x82B1;&#x8D39;&#x591A;&#x5C11;&#x5B9E;&#x8DF5;&#xFF0C;&#x53EF;&#x6015;&#x7684;&#x662F;&#x4F60;&#x4ECE;&#x6765;&#x4E0D;&#x8BD5;&#x56FE;&#x53BB;&#x4E86;&#x89E3;&#x6846;&#x67B6;&#x80CC;&#x540E;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x501F;&#x7531;AOP&#x4E2D;&#x62E6;&#x622A;&#x5668;&#x548C;MVC&#x4E2D;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x6211;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x8BF4;&#x7684;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x7684;&#x6838;&#x5FC3;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x6D88;&#x9664;&#x5206;&#x652F;&#xFF0C;&#x6240;&#x4EE5;&#x91C7;&#x7528;&#x591A;&#x6001;&#x662F;&#x6211;&#x4EEC;&#x91CD;&#x6784;&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x9488;&#x5BF9;Foo&#x65B9;&#x6CD5;&#x7684;&#x5F02;&#x5E38;&#x57FA;&#x7C7B;ExceptionBase&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x8FD9;&#x91CC;&#x7684;ExceptionA&#x3001;ExceptionB&#x3001;ExceptionC&#x7B49;&#x5168;&#x90E8;&#x7EE7;&#x627F;&#x81EA;ExceptionBase&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x5F02;&#x5E38;&#x5B50;&#x7C7B;&#x5411;&#x4E0A;&#x8F6C;&#x578B;&#x4E3A;ExceptionBase&#x7EDF;&#x4E00;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x5904;&#x7406;&#x5404;&#x79CD;&#x5F02;&#x5E38;&#x5B50;&#x7C7B;&#x7684;&#x903B;&#x8F91;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5C06;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x903B;&#x8F91;&#x5199;&#x5230;&#x5F02;&#x5E38;&#x4E2D;(&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x865A;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;)&#xFF0C;&#x53EF;&#x8FD9;&#x6837;&#x4F1A;&#x9020;&#x6210;&#x5F02;&#x5E38;&#x5B50;&#x7C7B;&#x91CC;&#x7684;&#x804C;&#x8D23;&#x8D1F;&#x8377;&#xFF0C;&#x6211;&#x66F4;&#x5E0C;&#x671B;&#x5F02;&#x5E38;&#x5B50;&#x7C7B;&#x662F;&#x4E00;&#x4E2A;&#x6734;&#x7D20;&#x7684;&#x8D2B;&#x8840;&#x6A21;&#x578B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5F15;&#x5165;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x6982;&#x5FF5;(&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x53EB;&#x662F;&#x5426;&#x5408;&#x9002;)&#xFF0C;Filter&#x5168;&#x90E8;&#x7EE7;&#x627F;&#x81EA;FilterBase&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;Invoke&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x4F1A;&#x5728;&#x8FD9;&#x91CC;&#x5B9E;&#x73B0;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;Filter&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;Attribute&#x5C06;&#x6BCF;&#x4E00;&#x79CD;Filter&#x548C;&#x7279;&#x5B9A;&#x7684;Exception&#x5173;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5728;&#x6240;&#x6709;&#x5F02;&#x5E38;&#x7684;&#x5730;&#x65B9;&#x6253;&#x65E5;&#x5FD7;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;LoggerFilter&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x6240;&#x6709;&#x7684;Exception&#x6DFB;&#x52A0;Attribute&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x6539;&#x5584;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x2003;&#x2003;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7ED9;ExceptionBase&#x7C7B;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;GetFilter()&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x4E3A;FilterBase&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;Filter&#x5E76;&#x5C06;&#x5176;&#x8FD4;&#x56DE;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x662F;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;</p>
<figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">[<span class="meta">ExceptionFilter(FilterName = <span class="meta-string">&quot;FilterA&quot;</span>)</span>]</span><br><span class="line"><span class="keyword">class</span> <span class="title">ExceptionA</span> : <span class="title">ExceptionBase</span> { }</span><br><span class="line"></span><br><span class="line">[<span class="meta">ExceptionFilter(FilterName = <span class="meta-string">&quot;FilterB&quot;</span>)</span>]</span><br><span class="line"><span class="keyword">class</span> <span class="title">ExceptionB</span> : <span class="title">ExceptionBase</span> { }</span><br><span class="line"></span><br><span class="line">[<span class="meta">ExceptionFilter(FilterName = <span class="meta-string">&quot;FilterC&quot;</span>)</span>]</span><br><span class="line"><span class="keyword">class</span> <span class="title">ExceptionC</span> : <span class="title">ExceptionBase</span> { }</span><br></pre></td></tr></tbody></table></figure>
<p>&#x6B64;&#x65F6;&#x6B64;&#x523B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x5C31;&#x4ECE;&#x4E00;&#x5806;catch&#x5757;&#x4E2D;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x4E0D;&#x540C;&#x7684;filter&#x4E2D;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x6CA1;&#x6709;&#x51CF;&#x5C11;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x505A;&#x6CD5;&#x65E0;&#x7591;&#x589E;&#x5F3A;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5230;&#x4E0D;&#x540C;&#x7684;Filter&#x91CC;&#x53BB;&#x4FEE;&#x6539;&#x903B;&#x8F91;&#x5373;&#x53EF;&#xFF0C;&#x6211;&#x5728;&#x4E66;&#x4E0A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5408;&#x5E76;&#x4EE3;&#x7801;&#x603B;&#x662F;&#x6BD4;&#x62C6;&#x5206;&#x4EE3;&#x7801;&#x8981;&#x5BB9;&#x6613;&#xFF0C;&#x5F53;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#x662F;&#x5426;&#x8981;&#x653E;&#x5728;&#x7279;&#x5B9A;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x5C06;&#x4ED6;&#x4EEC;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x8BBE;&#x8BA1;&#x3002;&#x964D;&#x4F4E;&#x4EE3;&#x7801;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x662F;&#x4E00;&#x4EF6;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x6302;&#x5728;&#x5634;&#x8FB9;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EF;&#x662F;&#x5982;&#x4F55;&#x53BB;&#x771F;&#x6B63;&#x5730;&#x964D;&#x4F4E;&#x4EE3;&#x7801;&#x8026;&#x5408;&#x5EA6;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x601D;&#x8003;&#x4E0B;&#x53BB;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x4E86;&#x5206;&#x652F;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x7CBE;&#x7B80;&#xFF0C;&#x800C;&#x6700;&#x7EC8;&#x8C03;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x662F;&#xFF1A;</p>
<figure class="highlight routeros"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">try</span><br><span class="line">{</span><br><span class="line">  Foo()</span><br><span class="line">}catch(ExceptionBase ex)</span><br><span class="line">{</span><br><span class="line">  var<span class="built_in"> filter </span>= ex.GetFilter();</span><br><span class="line">  filter.Invoke();</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>&#x73B0;&#x5728;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x662F;&#x6BD4;&#x539F;&#x6765;&#x6E05;&#x65B0;&#x4E86;&#x597D;&#x591A;&#x5462;&#xFF1F;&#x867D;&#x7136;&#x8FD9;&#x76F8;&#x6BD4;&#x771F;&#x6B63;&#x7684;AOP&#x8FD8;&#x662F;&#x7A0D;&#x663E;&#x7A1A;&#x5AE9;&#xFF0C;&#x53EF;&#x5B83;&#x7684;&#x51FA;&#x73B0;&#x6210;&#x529F;&#x5730;&#x8BA9;&#x4E00;&#x6BB5;&#x201D;&#x4E11;&#x964B;&#x201D;&#x7684;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x4F18;&#x96C5;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x518D;&#x62C5;&#x5FC3;&#x4FEE;&#x6539;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x65F6;&#x4F1A;&#x539F;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x4EA7;&#x751F;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x5904;&#x7406;&#x903B;&#x8F91;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6D3E;&#x751F;&#x5F02;&#x5E38;&#x7C7B;&#x548C;&#x8FC7;&#x6EE4;&#x5668;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x8BBE;&#x8BA1;&#x4E0A;&#x4EE5;&#x4E0D;&#x53D8;&#x5E94;&#x4E07;&#x53D8;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x4F60;&#x8981;&#x76F8;&#x4FE1;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x61D2;&#x60F0;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x5C31;&#x9002;&#x5E94;&#x53D8;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x4E00;&#x5B9A;&#x4F1A;&#x559C;&#x6B22;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x5E76;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x88AB;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4FEE;&#x6539;&#x5F97;&#x9762;&#x76EE;&#x5168;&#x975E;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x5C31;&#x662F;&#x4E0D;&#x7ED9;&#x5B83;&#x4EEC;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BF4;&#x4EBA;&#x957F;&#x5927;&#x4E00;&#x5B9A;&#x4F1A;&#x53D8;&#x6210;&#x81EA;&#x5DF1;&#x8BA8;&#x538C;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x60F3;&#x544A;&#x8BC9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x521D;&#x5FC3;&#x3002;</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5520;&#x53E8;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x5199;&#x4E86;&#x5927;&#x6982;5000&#x591A;&#x5B57;&#xFF0C;&#x82B1;&#x4E86;&#x6211;&#x6574;&#x6574;&#x4E24;&#x4E2A;&#x4E0B;&#x5348;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x5728;&#x5411;Paul&#x548C;John&#x8BE2;&#x95EE;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x770B;&#x6CD5;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6216;&#x8005;&#x662F;&#x529D;&#x6211;&#x4E0D;&#x8981;&#x505A;&#x8FD9;&#x6837;&#x63A2;&#x7D22;&#xFF0C;&#x53EF;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x53EA;&#x7528;&#x4E86;&#x534A;&#x5929;&#x65F6;&#x95F4;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#xFF0C;&#x5728;&#x53BB;&#x5E74;&#x7684;&#x65F6;&#x5019;&#x6211;&#x66FE;&#x5411;&#x623F;&#x71D5;&#x826F;&#x524D;&#x8F88;&#x8BF7;&#x6559;&#x597D;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x4E3B;&#x8981;&#x5728;&#x4F7F;&#x7528;&#x9519;&#x8BEF;&#x7801;&#x8FD8;&#x662F;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6211;&#x5BF9;&#x4E8E;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5176;&#x5B9E;&#x5B9E;&#x8DF5;&#x5F97;&#x5E76;&#x4E0D;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E00;&#x76F4;&#x4E0D;&#x77E5;&#x9053;&#x54EA;&#x91CC;&#x662F;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x8BA4;&#x540C;&#x76F4;&#x63A5;&#x6355;&#x83B7;&#x5230;&#x5F02;&#x5E38;&#x76F4;&#x63A5;throw&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5728;&#x81EA;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5E94;&#x8BE5;&#x60F3;&#x6E05;&#x695A;&#xFF0C;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#x662F;&#x9700;&#x8981;&#x6355;&#x83B7;&#x5E76;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x5F02;&#x5E38;&#x65F6;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BA9;&#x5B83;Crash&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4EC5;&#x4EC5;&#x662F;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x800C;&#x4E0D;&#x53BB;&#x62E6;&#x622A;&#x5F02;&#x5E38;&#xFF0C;&#x90A3;&#x4E48;&#x5F02;&#x5E38;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x5F97;&#x518D;&#x597D;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF0C;&#x5173;&#x4E8E;Java&#x7684;&#x5F02;&#x5E38;&#x6709;&#x4E00;&#x4E2A;&#x6897;&#xFF0C;&#x662F;&#x8BF4;Java&#x7684;&#x5F02;&#x5E38;&#x7ED9;&#x51FA;&#x4E86;&#x8BE6;&#x7EC6;&#x7684;&#x5806;&#x6808;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x5C31;&#x662F;&#x4E0D;&#x76F4;&#x63A5;&#x544A;&#x8BC9;&#x4F60;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x91CC;&#x5F02;&#x5E38;&#x4E86;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x6211;&#x8BBE;&#x8BA1;&#x7684;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x8FD0;&#x884C;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x5F88;&#x60F3;&#x5410;&#x69FD;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x771F;&#x7684;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x5417;&#xFF1F;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4F1A;&#x9075;&#x4ECE;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x6240;&#x8C13;&#x4E16;&#x95F4;&#x96BE;&#x9053;&#x4E0D;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5417;&#xFF1F;&#x771F;&#x6B63;&#x7ED1;&#x67B6;&#x6211;&#x4EEC;&#x7684;&#x6C38;&#x8FDC;&#x90FD;&#x53EA;&#x6709;&#x522B;&#x4EBA;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x65F6;&#x523B;&#x8C28;&#x8BB0;&#xFF1A;&#x4E07;&#x7269;&#x4E3A;&#x865A;&#xFF0C;&#x4E07;&#x4E8B;&#x7686;&#x5141;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3291578070/">使用Unity框架简化应用程序异常处理及日志记录流程</a></li><li><a href="https://qinyuanpei.github.io/posts/115524443/">漫谈应用程序重试策略及其实现</a></li><li><a href="https://blogs.kainy.cn/2010/04/java程序设计中的异常处理/">java程序设计中的异常处理</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/570888918/" rel="external">基于过滤器实现异常处理的探索</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/570888918/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/570888918/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/异常/">异常</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/架构/">架构</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/设计/">设计</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/570888918/&title=《基于过滤器实现异常处理的探索》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/570888918/&title=《基于过滤器实现异常处理的探索》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/570888918/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《基于过滤器实现异常处理的探索》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/570888918/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/570888918/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1684318907/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">《大护法》—— 花生镇里的成人童话</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/187480982/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">异步Lambda表达式问题的探索</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/570888918/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/570888918/&title=《基于过滤器实现异常处理的探索》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/570888918/&title=《基于过滤器实现异常处理的探索》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/570888918/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《基于过滤器实现异常处理的探索》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/570888918/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/570888918/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/570888918/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
