<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        基于新浪微博的男女性择偶观数据分析(上) - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x6216;&amp;#x8BB8;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x6211;&amp;#x559C;&amp;#x6B22;&amp;#x7684;&amp;#x59D1;&amp;#x5A18;&amp;#x4ECE;&amp;#x6765;&amp;#x90FD;&amp;#x4E0D;&amp;#x559C;&amp;#x6B22;&amp;#x6211;&amp;#xFF0C;&amp;#x800C;&amp;#x611F;&amp;#x60C5;&amp;#x4E0A;">
<meta name="keywords" content="Python,微博,词云">
<meta property="og:type" content="article">
<meta property="og:title" content="基于新浪微博的男女性择偶观数据分析(上)">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1386017461/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6216;&amp;#x8BB8;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x6211;&amp;#x559C;&amp;#x6B22;&amp;#x7684;&amp;#x59D1;&amp;#x5A18;&amp;#x4ECE;&amp;#x6765;&amp;#x90FD;&amp;#x4E0D;&amp;#x559C;&amp;#x6B22;&amp;#x6211;&amp;#xFF0C;&amp;#x800C;&amp;#x611F;&amp;#x60C5;&amp;#x4E0A;">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziyb6uz9fj20lj046aa7.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy7qkwhfj211d08ldhj.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziy51d2sqj20xj06nt8v.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixyl4fmtj20wv06p0tx.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzixbiu6p1j20go0m841l.jpg">
<meta property="og:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fzix8qmp8vj20jj0l7ae6.jpg">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="基于新浪微博的男女性择偶观数据分析(上)">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6216;&amp;#x8BB8;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x6211;&amp;#x559C;&amp;#x6B22;&amp;#x7684;&amp;#x59D1;&amp;#x5A18;&amp;#x4ECE;&amp;#x6765;&amp;#x90FD;&amp;#x4E0D;&amp;#x559C;&amp;#x6B22;&amp;#x6211;&amp;#xFF0C;&amp;#x800C;&amp;#x611F;&amp;#x60C5;&amp;#x4E0A;">
<meta name="twitter:image" content="https://ws1.sinaimg.cn/large/4c36074fly1fziyb6uz9fj20lj046aa7.jpg">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">基于新浪微博的男女性择偶观数据分析(上)</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">基于新浪微博的男女性择偶观数据分析(上)</h1>
        <h5 class="subtitle">
            
                <time datetime="2017-12-23T20:28:40.000Z" itemprop="datePublished" class="page-time">
  2017-12-23
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据分析/">数据分析</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#身高175的悲伤"><span class="post-toc-number">1.</span> <span class="post-toc-text">身高175的悲伤</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#花点时间爬爬微博"><span class="post-toc-number">2.</span> <span class="post-toc-text">花点时间爬爬微博</span></a><ol class="post-toc-child"><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#微博爬虫分析"><span class="post-toc-number">2.1.</span> <span class="post-toc-text">微博爬虫分析</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#数据处理过程"><span class="post-toc-number">2.2.</span> <span class="post-toc-text">数据处理过程</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#处理结果呈现"><span class="post-toc-number">2.3.</span> <span class="post-toc-text">处理结果呈现</span></a></li></ol></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#这是个看脸的世界"><span class="post-toc-number">3.</span> <span class="post-toc-text">这是个看脸的世界</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#本文小结"><span class="post-toc-number">4.</span> <span class="post-toc-text">本文小结</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">5.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-基于新浪微博的男女性择偶观数据分析-上" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">基于新浪微博的男女性择偶观数据分析(上)</h1>
        <div class="post-meta">
            <time class="post-time" title="2017-12-23 20:28:40" datetime="2017-12-23T20:28:40.000Z" itemprop="datePublished">2017-12-23</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/数据分析/">数据分析</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        49 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x559C;&#x6B22;&#x7684;&#x59D1;&#x5A18;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#xFF0C;&#x800C;&#x611F;&#x60C5;&#x4E0A;&#x7684;&#x632B;&#x6298;&#x4E00;&#x5EA6;&#x8BA9;&#x6211;&#x9677;&#x5165;&#x65E0;&#x5C3D;&#x7684;&#x81EA;&#x5351;&#x3002;&#x670B;&#x53CB;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x53D1;&#x5E03;&#x4E00;&#x6761;&#x5173;&#x4E8E;&#x76AE;&#x5F71;&#x620F;&#x7684;&#x52A8;&#x6001;&#xFF0C;&#x6211;&#x5F00;&#x73A9;&#x7B11;&#x8BF4;&#x8FD9;&#x4E2A;&#x76AE;&#x5F71;&#x620F;&#x7ED3;&#x5C40;&#x5E94;&#x8BE5;&#x662F;&#x4E2A;&#x60B2;&#x5267;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6CE8;&#x610F;&#x5230;&#x5728;&#x5267;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x4E00;&#x4E2A;&#x4EBA;&#x5982;&#x4F55;&#x5356;&#x529B;&#x5730;&#x8868;&#x6F14;&#x751A;&#x81F3;&#x53CC;&#x817F;&#x8DEA;&#x5012;&#x5728;&#x5730;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x4ECE;&#x6545;&#x4E8B;&#x5F00;&#x573A;&#x5230;&#x7ED3;&#x675F;&#x4E00;&#x76F4;&#x5BF9;&#x6B64;&#x65E0;&#x52A8;&#x4E8E;&#x8877;&#x3002;&#x670B;&#x53CB;&#x56DE;&#x590D;&#x6211;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E0D;&#x5C31;&#x662F;&#x4F60;&#x73B0;&#x5728;&#x7684;&#x72B6;&#x6001;&#x5417;&#xFF1F;&#x6211;&#x6C89;&#x9ED8;&#x534A;&#x5929;&#x7EC8;&#x4E8E;&#x7184;&#x706D;&#x624B;&#x673A;&#x5C4F;&#x5E55;&#x3002;&#x6211;&#x542C;&#x5230;&#x8FC7;&#x5404;&#x79CD;&#x5404;&#x6837;&#x8BA9;&#x6211;&#x653E;&#x5F03;&#x5979;&#x7684;&#x8BDD;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x79CD;&#x5FF5;&#x5934;&#x5728;&#x6211;&#x8111;&#x6D77;&#x91CC;&#x840C;&#x751F;&#x5DF2;&#x4E45;&#xFF0C;&#x662F;&#x5E7B;&#x60F3;&#x8BA9;&#x6211;&#x786C;&#x751F;&#x751F;&#x5730;&#x62D6;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x3002;&#x5F53;&#x4F60;&#x52AA;&#x529B;&#x60F3;&#x8981;&#x878D;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x7B49;&#x5F85;&#x4F60;&#x7684;&#x662F;&#x4E00;&#x9053;&#x51B0;&#x51B7;&#x7684;&#x5899;&#x3002;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x50CF;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5927;&#x6982;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;&#x201C;&#x597D;&#x53CB;&#x201D;&#x5B89;&#x5B89;&#x9759;&#x9759;&#x5730;&#x8EBA;&#x5728;&#x8054;&#x7CFB;&#x4EBA;&#x7684;&#x7F6E;&#x9876;&#x540D;&#x5355;&#x91CC;&#xFF0C;&#x4E0D;&#x6562;&#x53D1;&#x6D88;&#x606F;&#x8BA9;&#x5BF9;&#x65B9;&#x77E5;&#x9053;&#xFF0C;&#x66F4;&#x4E0D;&#x613F;&#x6B8B;&#x5FCD;&#x5730;&#x628A;&#x5BF9;&#x65B9;&#x5220;&#x9664;&#x3002;&#x6211;&#x5B89;&#x6170;&#x81EA;&#x5DF1;&#x8BF4;&#xFF0C;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x5931;&#x53BB;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x559C;&#x6B22;&#x4F60;&#x7684;&#x4EBA;&#xFF1B;&#x800C;&#x5BF9;&#x5BF9;&#x65B9;&#x800C;&#x8A00;&#xFF0C;&#x5931;&#x53BB;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x5979;&#x7684;&#x4EBA;&#x3002;&#x4F60;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x8BF4;&#x6211;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x559C;&#x6B22;&#x5979;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x559C;&#x6B22;&#x5230;&#x5351;&#x5FAE;&#x5982;&#x5C18;&#x571F;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x6211;&#x5B81;&#x613F;&#x4E00;&#x4E2A;&#x4EBA;&#x5355;&#x8EAB;&#x5230;&#x5929;&#x8352;&#x5730;&#x8001;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x4EBA;&#x4E0E;&#x4EBA;&#x95F4;&#xFF0C;&#x5373;&#x4F7F;&#x4EB2;&#x8FD1;&#x5982;&#x7236;&#x6BCD;&#x5C1A;&#x4E14;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x5F7C;&#x6B64;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9996;&#x5148;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x4F1A;&#x662F;&#x5916;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x79F0;&#x4E4B;&#x4E3A;&#x773C;&#x7F18;&#xFF0C;&#x6240;&#x4EE5;&#x4EBA;&#x4E0E;&#x4EBA;&#x95F4;&#x7684;&#x611F;&#x60C5;&#x7EBD;&#x5E26;&#x6700;&#x521D;&#x4F1A;&#x662F;&#x5438;&#x5F15;&#xFF0C;&#x800C;&#x540E;&#x662F;&#x4E86;&#x89E3;&#x5F7C;&#x6B64;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x6700;&#x7EC8;&#x662F;&#x76F8;&#x4E92;&#x7406;&#x89E3;&#x548C;&#x6276;&#x6301;&#x3002;&#x53EF;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5916;&#x8868;&#x662F;&#x53EF;&#x4EE5;&#x4F2A;&#x88C5;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x901A;&#x8FC7;&#x5916;&#x8868;&#x548C;&#x8A00;&#x8BED;&#x6765;&#x8BC4;&#x4EF7;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x6570;&#x5B66;&#x5F52;&#x7EB3;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x8BA4;&#x4E3A;&#x63A8;&#x5012;&#x7B2C;&#x4E00;&#x5757;&#x591A;&#x8BFA;&#x7C73;&#x9AA8;&#x724C;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x591A;&#x8BFA;&#x7C73;&#x9AA8;&#x724C;&#x90FD;&#x4F1A;&#x5012;&#x4E0B;&#x3002;&#x53EF;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x77DB;&#x76FE;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x7406;&#x6240;&#x5F53;&#x7136;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6216;&#x8BB8;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x8BC1;&#x660E;&#x5176;&#x6B63;&#x786E;&#x6027;&#x7684;&#xFF0C;&#x8FD9;&#x5728;&#x6570;&#x5B66;&#x4E0A;&#x79F0;&#x4E3A;&#x54E5;&#x5FB7;&#x5C14;&#x4E0D;&#x5B8C;&#x5907;&#x5B9A;&#x7406;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x4EF6;&#x6B8B;&#x9177;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x65E0;&#x6CD5;&#x5438;&#x5F15;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x5F80;&#x5185;&#x5FC3;&#x4E16;&#x754C;&#x7684;&#x8DEF;&#x5C31;&#x88AB;&#x5835;&#x6B7B;&#x4E86;&#x3002;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x7CBE;&#x5F69;&#x7EB7;&#x5448;&#x7684;&#x793E;&#x4EA4;&#x4E92;&#x52A8;&#xFF0C;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x771F;&#x6B63;&#x4E86;&#x89E3;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4F55;&#x51B5;&#x662F;&#x4F60;&#x5438;&#x5F15;&#x4E0D;&#x5230;&#x7684;&#x4EBA;&#x5462;&#xFF1F;&#x6211;&#x5F88;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x9009;&#x62E9;&#x4F34;&#x4FA3;&#x7684;&#x65F6;&#x5019;&#x5230;&#x5E95;&#x770B;&#x4E2D;&#x4EC0;&#x4E48;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x5173;&#x6CE8;<a href="https://weibo.com/u/5566882921" target="_blank" rel="noopener">@&#x897F;&#x5B89;&#x6708;&#x8001;&#x7275;&#x7EBF;</a>&#x4E0A;&#x53D1;&#x5E03;&#x7684;&#x5F81;&#x5A5A;&#x4EA4;&#x53CB;&#x7C7B;&#x5FAE;&#x535A;&#xFF0C;&#x672C;&#x6587;&#x7684;&#x6545;&#x4E8B;&#x4ECE;&#x8FD9;&#x91CC;&#x6B63;&#x5F0F;&#x5C55;&#x5F00;&#x3002;</p>
<h1 id="&#x8EAB;&#x9AD8;175&#x7684;&#x60B2;&#x4F24;"><a href="#&#x8EAB;&#x9AD8;175&#x7684;&#x60B2;&#x4F24;" class="headerlink" title="&#x8EAB;&#x9AD8;175&#x7684;&#x60B2;&#x4F24;"></a>&#x8EAB;&#x9AD8;175&#x7684;&#x60B2;&#x4F24;</h1><p>&#x2003;&#x2003;&#x6216;&#x8BB8;&#x4F60;&#x4EE5;&#x4E3A;&#x6211;&#x4F1A;&#x65E0;&#x804A;&#x5230;&#x8BD5;&#x56FE;&#x4ECE;&#x5FAE;&#x535A;&#x4E0A;&#x627E;&#x5230;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x53EF;&#x4E8B;&#x5B9E;&#x4E0A;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6211;&#xFF0C;&#x5373;&#x4F7F;&#x6574;&#x5929;&#x6295;&#x5165;&#x7CBE;&#x529B;&#x5728;&#x7F16;&#x7A0B;&#x4E0A;&#xFF0C;&#x4F9D;&#x7136;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x5BF9;&#x8C61;&#x7A7A;&#x5F15;&#x7528;&#x7684;&#x5F02;&#x5E38;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x627E;&#x5230;&#x5973;&#x670B;&#x53CB;&#x662F;&#x4E2A;&#x5C0F;&#x6982;&#x7387;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x61C2;&#x6211;&#x3001;&#x559C;&#x6B22;&#x6211;&#x7684;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x4E8B;&#x4EF6;&#x3002;&#x4F60;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x6211;&#x5BF9;&#x6CA1;&#x6709;&#x8C03;&#x6574;&#x597D;&#x5FC3;&#x6001;&#x3001;&#x5BF9;&#x751F;&#x6D3B;&#x8FC7;&#x5206;&#x60B2;&#x89C2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E86;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x5C31;&#x4F1A;&#x771F;&#x6B63;&#x5730;&#x7406;&#x89E3;&#x6211;&#x8BF4;&#x7684;&#x8BDD;&#x3002;&#x8FD9;&#x4E2A;&#x5FAE;&#x535A;&#x5F00;&#x59CB;&#x5F15;&#x8D77;&#x6211;&#x7684;&#x6CE8;&#x610F;&#xFF0C;&#x662F;&#x6211;&#x53D1;&#x73B0;&#x8EAB;&#x9AD8;&#x5728;155&#x5230;165&#x5DE6;&#x53F3;&#x7684;&#x5973;&#x751F;&#xFF0C;&#x5BF9;&#x7537;&#x751F;&#x7684;&#x8981;&#x6C42;&#x57FA;&#x672C;&#x4E0A;&#x65E0;&#x7591;&#x4F8B;&#x5916;&#x5730;&#x662F;175+&#x5230;180+&#xFF0C;&#x6211;&#x60F3;&#x77E5;&#x9053;&#x5230;&#x5E95;&#x6709;&#x591A;&#x5C11;&#x5973;&#x751F;&#x662F;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x60F3;&#x8981;&#x6293;&#x53D6;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x7684;&#x521D;&#x8877;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8EAB;&#x9AD8;&#x4E0D;&#x5230;175&#x7684;&#x6211;&#x5728;&#x9762;&#x5BF9;&#x8FD9;&#x79CD;&#x8981;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x662F;&#x60B2;&#x4F24;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x8D77;&#x4E86;&#x300A;&#x5DF4;&#x9ECE;&#x5723;&#x6BCD;&#x9662;&#x300B;&#x4E2D;&#x7684;&#x5361;&#x897F;&#x83AB;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x5916;&#x8868;&#x4E11;&#x964B;&#x800C;&#x62E5;&#x6709;&#x9AD8;&#x5C1A;&#x4EBA;&#x683C;&#x7684;&#x201C;&#x4E11;&#x516B;&#x602A;&#x201D;&#x3002;&#x73B0;&#x4EE3;&#x4EBA;&#x6574;&#x5929;&#x90FD;&#x7279;&#x522B;&#x5FD9;&#x788C;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x6709;&#x8010;&#x5FC3;&#xFF0C;&#x56ED;&#x827A;&#x5728;&#x5FCD;&#x53D7;&#x7740;&#x4F60;&#x4E11;&#x964B;&#x7684;&#x5916;&#x8868;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x540C;&#x4F60;&#x8BB2;&#x4E00;&#x53EA;&#x5C0F;&#x5154;&#x5B50;&#x4EB2;&#x4E86;&#x5B83;&#x559C;&#x6B22;&#x7684;&#x957F;&#x9888;&#x9E7F;&#x4E00;&#x4E0B;&#x8FD9;&#x79CD;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x542C;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;&#x597D;&#x770B;&#x7684;&#x76AE;&#x56CA;&#x5343;&#x7BC7;&#x4E00;&#x5F8B;&#xFF0C;&#x6709;&#x8DA3;&#x7684;&#x7075;&#x9B42;&#x4E07;&#x91CC;&#x6311;&#x4E00;&#x201D;&#xFF0C;&#x53EF;&#x8C01;&#x4F1A;&#x89C9;&#x5F97;&#x50CF;&#x5361;&#x897F;&#x83AB;&#x592B;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4F1A;&#x62E5;&#x6709;&#x6216;&#x8005;&#x914D;&#x62E5;&#x6709;&#x9AD8;&#x5C1A;&#x7684;&#x4EBA;&#x683C;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x8FD9;&#x526F;&#x76AE;&#x56CA;&#x4E0D;&#x7BA1;&#x597D;&#x770B;&#x4E0E;&#x5426;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x7236;&#x6BCD;&#x7ED9;&#x4E88;&#x6211;&#x4EEC;&#x7684;&#x6700;&#x597D;&#x7684;&#x793C;&#x7269;&#x3002;&#x96BE;&#x9053;&#x4E00;&#x4E2A;&#x6240;&#x8C13;&#x60C5;&#x5546;&#x9AD8;&#x7684;&#x4EBA;&#xFF0C;&#x4F1A;&#x5728;&#x6536;&#x5230;&#x522B;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#x56E0;&#x4E3A;&#x793C;&#x7269;&#x4E0D;&#x597D;&#x770B;&#x800C;&#x751F;&#x6C14;&#x5417;&#xFF1F; &#x6211;&#x60F3;&#x8D77;&#x300A;&#x753B;&#x5FC3;&#x300B;&#x91CC;&#x61CA;&#x6094;&#x53D7;&#x72D0;&#x5996;&#x5C0F;&#x552F;&#x76AE;&#x76F8;&#x86CA;&#x60D1;&#x800C;&#x81EA;&#x6BC1;&#x53CC;&#x76EE;&#x7684;&#x970D;&#x5FC3;&#xFF0C;&#x7F8E;&#x4E11;&#x90FD;&#x662F;&#x7236;&#x6BCD;&#x8D50;&#x4E88;&#x6211;&#x4EEC;&#x7684;&#xFF0C;&#x4E0D;&#x8BE5;&#x88AB;&#x6211;&#x4EEC;&#x62FF;&#x6765;&#x4E00;&#x756A;&#x5927;&#x8086;&#x70AB;&#x8000;&#xFF0C;&#x53EF;&#x6211;&#x8FD8;&#x662F;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x8BC4;&#x4EF7;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6807;&#x51C6;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x6E10;&#x6E10;&#x660E;&#x767D;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x597D;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x662F;&#x67D0;&#x4E00;&#x70B9;&#x548C;&#x5BF9;&#x65B9;&#x4E0D;&#x5339;&#x914D;&#x3002;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x50CF;&#x62D4;&#x4E0B;&#x8EAB;&#x4E0A;&#x7684;&#x4E00;&#x6839;&#x6839;&#x523A;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x8D8A;&#x662F;&#x5F97;&#x4E0D;&#x5230;&#x56DE;&#x5E94;&#xFF0C;&#x5C31;&#x8D8A;&#x50CF;&#x53D8;&#x6210;&#x5BF9;&#x65B9;&#x671F;&#x5F85;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x8BA9;&#x4F60;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4E00;&#x65E0;&#x662F;&#x5904;&#x3002;&#x76F4;&#x5230;&#x4ECA;&#x5929;&#x770B;&#x5230;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x4E00;&#x53E5;&#x8DB3;&#x4EE5;&#x70ED;&#x6CEA;&#x76C8;&#x7736;&#x7684;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x66FE;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x6211;&#x672C;&#x6765;&#x975E;&#x5E38;&#x53EF;&#x7231;&#x7684;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6216;&#x8BB8;&#x5C31;&#x662F;&#x5728;&#x548C;&#x81EA;&#x5DF1;&#x8FC7;&#x4E0D;&#x53BB;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;</p>
<h1 id="&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x722C;&#x722C;&#x5FAE;&#x535A;"><a href="#&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x722C;&#x722C;&#x5FAE;&#x535A;" class="headerlink" title="&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x722C;&#x722C;&#x5FAE;&#x535A;"></a>&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x722C;&#x722C;&#x5FAE;&#x535A;</h1><p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x8003;&#x8651;&#x4ECE;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x4E0A;&#x6293;&#x53D6;<a href="https://weibo.com/u/5566882921" target="_blank" rel="noopener">@&#x897F;&#x5B89;&#x6708;&#x8001;&#x7275;&#x7EBF;</a>&#x4E0A;&#x53D1;&#x5E03;&#x7684;&#x5FAE;&#x535A;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x524D;&#x63D0;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x524D;&#x6211;&#x66FE;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x6765;&#x8C03;&#x8BD5;&#x722C;&#x866B;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4E86;&#x4E00;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6E05;&#x6D17;&#xFF0C;&#x6700;&#x7EC8;&#x5229;&#x7528;&#x665A;&#x4E0A;&#x4E0B;&#x73ED;&#x7684;&#x65F6;&#x95F4;&#x751F;&#x6210;&#x8BCD;&#x4E91;&#x3002;&#x7531;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7406;&#x51FA;&#x6574;&#x4F53;&#x7684;&#x601D;&#x8DEF;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziyb6uz9fj20lj046aa7.jpg" alt="&#x6D41;&#x7A0B;&#x56FE;" title>
                </div>
                <div class="image-caption">&#x6D41;&#x7A0B;&#x56FE;</div>
            </figure>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x6D41;&#x7A0B;&#x56FE;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x9009;&#x62E9;&#x4E86;Python&#x6765;&#x5B9E;&#x73B0;&#x6574;&#x4E2A;&#x529F;&#x80FD;&#x3002;&#x8F6C;&#x773C;&#x95F4;&#x6211;&#x5DF2;&#x7ECF;25&#x5C81;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6982;&#x5FF5;&#x5462;&#xFF1F;&#x4E24;&#x5E74;&#x524D;&#x6211;23&#x5C81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x542C;&#x522B;&#x4EBA;&#x8BA8;&#x8BBA;&#x7ED3;&#x5A5A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5B83;&#x79BB;&#x6211;&#x8FD8;&#x5F88;&#x9065;&#x8FDC;&#x3002;&#x5982;&#x4ECA;&#x770B;&#x7740;&#x5468;&#x56F4;&#x4EBA;&#x90FD;&#x7ED3;&#x5A5A;&#x4E86;&#xFF0C;&#x6211;&#x7ADF;&#x6709;&#x79CD;&#x201C;&#x9AD8;&#x5904;&#x4E0D;&#x80DC;&#x5BD2;&#x201D;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6240;&#x4EE5;&#x5462;&#xFF0C;&#x4EBA;&#x751F;&#x82E6;&#x77ED;&#xFF0C;&#x5F53;&#x4F60;&#x4E0D;&#x80FD;&#x963B;&#x6B62;&#x65F6;&#x95F4;&#x4E00;&#x5929;&#x5929;&#x6D88;&#x901D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x8D81;&#x7740;&#x73B0;&#x5728;&#x53BB;&#x505A;&#x4F60;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E3A;&#x4E86;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x53BB;&#x505A;&#x6280;&#x672F;&#x4EE5;&#x5916;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x62E5;&#x6709;&#x5168;&#x4E16;&#x754C;&#x6700;&#x4E30;&#x5BCC;&#x7684;&#x5E93;&#x7684;Python&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x6E10;&#x6E10;&#x610F;&#x8BC6;&#x5230;&#x6211;&#x4EEC;&#x6240;&#x719F;&#x6089;&#x7684;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x4E00;&#x79CD;&#x7406;&#x6027;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5B8C;&#x5168;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x6765;&#x89E3;&#x6784;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x91CC;&#x7559;&#x4E0B;&#x7684;&#x6BCF;&#x4E00;&#x6761;&#x8BAF;&#x606F;&#xFF0C;&#x90FD;&#x51B7;&#x51B0;&#x51B0;&#x5730;&#x66B4;&#x9732;&#x7740;&#x6211;&#x4EEC;&#x7684;&#x559C;&#x6012;&#x54C0;&#x4E50;&#xFF0C;&#x6BCF;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x91CC;&#x7EC6;&#x5FAE;&#x7684;&#x8868;&#x60C5;&#x53D8;&#x5316;&#xFF0C;&#x6BCF;&#x4E00;&#x6BB5;&#x6587;&#x5B57;&#x91CC;&#x9690;&#x533F;&#x7740;&#x7684;&#x771F;&#x5B9E;&#x610F;&#x56FE;&#xFF0C;&#x90FD;&#x80FD;&#x88AB;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x7C7B;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x6280;&#x672F;&#x6240;&#x89E3;&#x8BFB;&#xFF0C;&#x6211;&#x4EEC;&#x52AA;&#x529B;&#x60F3;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x9690;&#x85CF;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x5F53;&#x670B;&#x53CB;&#x5708;&#x7684;&#x8BBF;&#x95EE;&#x8303;&#x56F4;&#x4ECE;&#x534A;&#x5E74;&#x9010;&#x6E10;&#x7F29;&#x5C0F;&#x5230;&#x4E09;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x7A76;&#x7ADF;&#x80FD;&#x9690;&#x85CF;&#x4E0B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<h2 id="&#x5FAE;&#x535A;&#x722C;&#x866B;&#x5206;&#x6790;"><a href="#&#x5FAE;&#x535A;&#x722C;&#x866B;&#x5206;&#x6790;" class="headerlink" title="&#x5FAE;&#x535A;&#x722C;&#x866B;&#x5206;&#x6790;"></a>&#x5FAE;&#x535A;&#x722C;&#x866B;&#x5206;&#x6790;</h2><p>&#x2003;&#x2003;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4ECE;&#x5FAE;&#x535A;&#x4E0A;&#x6293;&#x53D6;&#x6570;&#x636E;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x53BB;&#x505A;&#x6293;&#x5305;&#x5206;&#x6790;&#x8FD9;&#x6837;&#x7684;&#x91CD;&#x590D;&#x6027;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x5728;&#x8BA8;&#x8BBA;&#xFF0C;&#x6211;&#x4E3B;&#x8981;&#x53C2;&#x8003;&#x4E86;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<ul>
<li><a href="https://www.zhihu.com/question/29666539/answer/63325949" target="_blank" rel="noopener">Python &#x722C;&#x866B;&#x5982;&#x4F55;&#x673A;&#x5668;&#x767B;&#x5F55;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x5E76;&#x6293;&#x53D6;&#x5185;&#x5BB9;&#xFF1F;</a></li>
<li><a href="https://github.com/xchaoinfo/fuck-login" target="_blank" rel="noopener">https://github.com/xchaoinfo/fuck-login</a></li>
<li><a href="http://python.jobbole.com/84349/" target="_blank" rel="noopener">&#x7528;Python&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5FAE;&#x535A;&#x722C;&#x866B;</a></li>
</ul>
<p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4E86;&#x89E3;&#x5230;&#x5728;&#x6293;&#x53D6;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x6570;&#x636E;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4F1A;&#x6709;&#x4EE5;&#x4E0B;&#x601D;&#x8DEF;&#xFF1A;</p>
<ul>
<li>&#x4FDD;&#x5B58;cookie&#x4FE1;&#x606F;&#xFF0C;&#x5229;&#x7528;requests&#x5E93;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#x5E76;&#x5E26;&#x4E0A;cookie</li>
<li>&#x5229;&#x7528;requests&#x5E93;&#x6A21;&#x62DF;&#x767B;&#x5F55;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x5E76;&#x5728;&#x8BF7;&#x6C42;&#x8FC7;&#x7A0B;&#x4E2D;&#x4FDD;&#x6301;cookie</li>
<li>&#x5229;&#x7528;selenium&#x5E93;&#x6A21;&#x62DF;&#x767B;&#x5F55;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x7136;&#x540E;&#x53D6;&#x5F97;&#x9875;&#x9762;&#x5185;&#x5BB9;</li>
<li>&#x5229;&#x7528;PhantomJS&#x5E93;&#x6A21;&#x62DF;&#x767B;&#x5F55;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x7136;&#x540E;&#x53D6;&#x5F97;&#x9875;&#x9762;&#x5185;&#x5BB9;</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5DEE;&#x5F02;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;cookie&#x7684;&#x83B7;&#x53D6;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x652F;&#x6301;headless&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5171;&#x8BC6;&#xFF0C;&#x6293;&#x53D6;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;<a href="http://weibo.cn/" target="_blank" rel="noopener">&#x79FB;&#x52A8;&#x7248;</a>&#x8981;&#x6BD4;<a href="https://weibo.com" target="_blank" rel="noopener">PC&#x7248;</a>&#x8981;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x79FB;&#x52A8;&#x7248;&#x4F18;&#x5148;&#x4E3A;&#x5C0F;&#x5C3A;&#x5BF8;&#x5C4F;&#x5E55;&#x8BBE;&#x5907;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x800C;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x76F8;&#x5BF9;&#x6574;&#x6D01;&#x4FBF;&#x4E8E;&#x6211;&#x4EEC;&#x63D0;&#x53D6;&#x6570;&#x636E;&#x3002;&#x8D77;&#x521D;&#x535A;&#x4E3B;&#x8BA4;&#x4E3A;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x592A;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x575A;&#x6301;&#x8981;&#x91C7;&#x7528;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x6700;&#x7EC8;&#x8BC1;&#x660E;&#x8FD8;&#x662F;&#x592A;&#x5E74;&#x8F7B;&#x4E86;&#x554A;&#xFF0C;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x7684;&#x767B;&#x5F55;&#x7ED9;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x86CB;&#x75BC;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E0B;&#x601D;&#x8DEF;&#x54C8;&#x3002;</p>
<p>&#x2003;&#x2003;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x4F1A;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x4E00;&#x6B21;GET&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x6BB5;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7528;&#x6B63;&#x5219;&#x5339;&#x914D;&#x51FA;&#x5176;&#x4E2D;&#x7684;JSON&#x5B57;&#x7B26;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x83B7;&#x5F97;&#x4E86;&#x7B2C;&#x4E8C;&#x6B21;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x53C2;&#x6570;&#xFF1B;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8BF7;&#x6C42;&#x662F;&#x4E00;&#x4E2A;POST&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x7528;&#x6237;&#x540D;&#x91C7;&#x7528;Base64&#x52A0;&#x5BC6;&#xFF0C;&#x5BC6;&#x7801;&#x5219;&#x91C7;&#x7528;RSA&#x52A0;&#x5BC6;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;&#x7B2C;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x8FD4;&#x56DE;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x5B98;&#x65B9;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;API&#x83B7;&#x53D6;&#x5FAE;&#x535A;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x8FD9;&#x4E2A;API&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x7684;&#x5FAE;&#x535A;&#x6570;&#x636E;&#x975E;&#x5E38;&#x6709;&#x9650;&#xFF0C;&#x66F4;&#x8BA9;&#x4EBA;&#x96BE;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x662F;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x7684;&#x5E94;&#x7528;&#x6388;&#x6743;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x8C03;&#x7528;API&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4F1A;&#x6709;&#x7B2C;&#x4E09;&#x6B21;POST&#x8BF7;&#x6C42;&#xFF0C;&#x6709;&#x670B;&#x53CB;&#x5206;&#x6790;&#x4E86;&#x5B8C;&#x6574;&#x7684;&#x6A21;&#x62DF;&#x767B;&#x5F55;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x6211;&#x5BF9;&#x6B64;&#x8868;&#x793A;&#x6BEB;&#x65E0;&#x5174;&#x8DA3;&#x554A;&#x3002;&#x6700;&#x65E9;&#x6211;&#x91C7;&#x7528;&#x4E86;&#x6A21;&#x62DF;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6293;&#x53D6;&#x7B2C;&#x4E00;&#x9875;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x767B;&#x5F55;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x7B49;&#x5230;&#x6293;&#x53D6;&#x7B2C;&#x4E8C;&#x9875;&#x7684;&#x65F6;&#x5019;&#x53D8;&#x6210;&#x4E86;&#x6CE8;&#x9500;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;session&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x6700;&#x540E;&#x679C;&#x65AD;&#x653E;&#x5F03;&#x4E86;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5728;Chrome&#x91CC;F12&#x627E;&#x5230;Network&#x9009;&#x9879;&#x5361;&#xFF0C;&#x6293;&#x4E00;&#x6B21;&#x5305;&#x53D6;&#x5F97;cookie&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8BF7;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x5E26;&#x4E0A;cookie&#x5373;&#x53EF;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x8FC7;&#x5206;&#x62C5;&#x5FC3;cookie&#x8FC7;&#x671F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x535A;&#x4E3B;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;cookie&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x5DE5;&#x4F5C;3&#x81F3;5&#x5929;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x8BB2;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x722C;&#x866B;&#x6293;&#x53D6;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x5927;&#xFF0C;&#x5728;&#x4E00;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6293;&#x53D6;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5C06;&#x722C;&#x866B;&#x8003;&#x8651;&#x5F97;&#x592A;&#x4E25;&#x8C28;&#x3002;&#x5728;&#x4E0B;&#x56FE;&#x4E2D;&#x6211;&#x4EEC;&#x6807;&#x8BB0;&#x51FA;&#x4E86;&#x535A;&#x4E3B;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x5B58;&#x50A8;&#x7684;cookie&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;cookie&#x5C31;&#x53EF;&#x4EE5;&#x514D;&#x767B;&#x5F55;&#x6293;&#x53D6;&#x4FE1;&#x606F;&#x5566;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy7qkwhfj211d08ldhj.jpg" alt="&#x63D0;&#x53D6;Cookie" title>
                </div>
                <div class="image-caption">&#x63D0;&#x53D6;Cookie</div>
            </figure>
<p>&#x2003;&#x2003;&#x89E3;&#x51B3;&#x767B;&#x5F55;&#x7684;&#x95EE;&#x9898;&#x4EE5;&#x540E;&#xFF0C;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x672C;&#x8EAB;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6293;&#x53D6;<a href="https://weibo.com/u/5566882921" target="_blank" rel="noopener">@&#x897F;&#x5B89;&#x6708;&#x8001;&#x7275;&#x7EBF;</a>&#x53D1;&#x5E03;&#x7684;&#x6240;&#x6709;&#x5FAE;&#x535A;&#xFF0C;&#x79FB;&#x52A8;&#x7248;&#x5BF9;&#x5FAE;&#x535A;&#x505A;&#x4E86;&#x5206;&#x9875;&#x5904;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x603B;&#x5171;&#x6709;&#x591A;&#x5C11;&#x9875;&#xFF0C;&#x7136;&#x540E;&#x5FAA;&#x73AF;&#x53BB;&#x63D0;&#x53D6;&#x6BCF;&#x4E00;&#x9875;&#x91CC;&#x7684;&#x4FE1;&#x606F;&#x5373;&#x53EF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x6BCF;&#x4E00;&#x9875;&#x7684;&#x5730;&#x5740;&#x90FD;&#x7B26;&#x5408;<a href="https://weibo.cn/u/3232168977?page=2" target="_blank" rel="noopener">https://weibo.cn/u/3232168977?page=2</a>&#x8FD9;&#x6837;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x9996;&#x5148;&#x9875;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;name&#x4E3A;mp&#x7684;&#x9690;&#x85CF;&#x63A7;&#x4EF6;&#x6765;&#x83B7;&#x5F97;&#xFF0C;&#x5176;value&#x5C5E;&#x6027;&#x8868;&#x793A;&#x603B;&#x9875;&#x6570;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x6BCF;&#x6761;&#x5FAE;&#x535A;&#x5B58;&#x653E;&#x5728;class&#x4E3A;c&#xFF0C;id&#x4EE5;M_&#x5F00;&#x5934;&#x7684;div&#x6807;&#x7B7E;&#x91CC;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x6587;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x987A;&#x85E4;&#x6478;&#x74DC;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4FE1;&#x606F;&#x88AB;&#x5B58;&#x653E;&#x5728;class&#x4E3A;ctt&#x7684;span&#x6807;&#x7B7E;&#x91CC;&#xFF0C;&#x8FD9;&#x91CC;&#x535A;&#x4E3B;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x5947;&#x602A;&#x7684;&#x95EE;&#x9898;&#xFF0C;BeautifulSoup&#x9ED8;&#x8BA4;&#x7684;&#x89E3;&#x6790;&#x5668;html.parser&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x56E0;&#x4E3A;&#x539F;&#x56E0;&#x65E0;&#x6CD5;&#x89E3;&#x6790;&#x51FA;&#x6807;&#x7B7E;&#xFF0C;&#x800C;lxml&#x5F53;&#x65F6;&#x56E0;&#x4E3A;pip&#x7684;&#x95EE;&#x9898;&#x65E0;&#x6CD5;&#x5B89;&#x88C5;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;XPath&#x6765;&#x89E3;&#x6790;DOM&#x89E3;&#x6784;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x8BA4;&#x4E3A;XPath&#x66F4;&#x9002;&#x5408;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x6293;&#x53D6;&#x5FAE;&#x535A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x535A;&#x4E3B;&#x53D1;&#x73B0;&#x5B98;&#x65B9;&#x7684;&#x53CD;&#x722C;&#x866B;&#x7B56;&#x7565;&#x975E;&#x5E38;&#x7ED9;&#x529B;&#xFF0C;&#x8FDE;&#x7EED;&#x5DE5;&#x4F5C;&#x8D85;&#x8FC7;5&#x5206;&#x949F;IP&#x5C31;&#x4F1A;&#x88AB;&#x5C01;&#x9501;&#xFF0C;&#x8FDB;&#x800C;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5FAE;&#x535A;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C; &#x5927;&#x6982;&#x7ECF;&#x8FC7;20&#x81F3;30&#x5206;&#x949F;&#x540E;&#x4F1A;&#x81EA;&#x52A8;&#x89E3;&#x5C01;&#x3002;&#x6216;&#x8BB8;&#x4E3B;&#x6D41;&#x7684;&#x65B9;&#x6848;&#x662F;&#x82B1;&#x94B1;&#x4E70;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#xFF0C;&#x53EF;&#x6211;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x4E34;&#x65F6;&#x8D77;&#x610F;&#x7684;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x91C7;&#x53D6;&#x4E86;&#x6700;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x7EBF;&#x7A0B;&#x7761;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5728;&#x8FD9;&#x6837;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x6211;&#x82B1;&#x4E86;&#x5927;&#x6982;1&#x4E2A;&#x534A;&#x5C0F;&#x65F6;&#x5230;2&#x4E2A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x5FAE;&#x535A;&#x4E0A;&#x6293;&#x53D6;&#x4E86;5600&#x6761;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5728;&#x4E86;SQLite&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8003;&#x8651;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x61D2;&#x554A;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6700;&#x96BE;&#x7684;&#x5730;&#x65B9;&#x5728;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x6570;&#x636E;&#x6293;&#x53D6;&#x65B9;&#x9762;&#x6211;&#x4E0D;&#x592A;&#x5173;&#x6CE8;&#x6548;&#x7387;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x7B49;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x5173;&#x4E8E;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x65F6;&#x95F4;&#x6211;&#x4EEC;&#x518D;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x8BA8;&#x8BBA;&#x5427;&#xFF01;</p>
<h2 id="&#x6570;&#x636E;&#x5904;&#x7406;&#x8FC7;&#x7A0B;"><a href="#&#x6570;&#x636E;&#x5904;&#x7406;&#x8FC7;&#x7A0B;" class="headerlink" title="&#x6570;&#x636E;&#x5904;&#x7406;&#x8FC7;&#x7A0B;"></a>&#x6570;&#x636E;&#x5904;&#x7406;&#x8FC7;&#x7A0B;</h2><p>&#x2003;&#x2003;&#x6570;&#x636E;&#x5904;&#x7406;&#x8FD9;&#x5757;&#xFF0C;&#x6211;&#x672C;&#x6765;&#x6253;&#x7B97;&#x5C1D;&#x8BD5;&#x4E0B;MongoDB&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x662F;&#x6211;&#x4ECA;&#x5E74;&#x8BA1;&#x5212;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#x4E4B;&#x4E00;&#xFF0C;&#x540E;&#x6765;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x4E00;&#x76F4;&#x6401;&#x7F6E;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x53EF;&#x5F53;&#x6211;&#x6CE8;&#x610F;&#x5230;Windows&#x4E0B;&#x5B89;&#x88C5;MongoDB&#x7684;&#x7E41;&#x7410;&#x540E;&#xFF0C;&#x6211;&#x679C;&#x65AD;&#x653E;&#x5F03;&#x4E86;&#x8FD9;&#x79CD;&#x5FF5;&#x5934;&#x56DE;&#x5F52;&#x7B80;&#x5355;&#x7684;SQLite&#xFF0C;&#x6211;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4EA4;&#x53C9;&#x4F7F;&#x7528;Windows&#x548C;Linux&#xFF0C;&#x800C;&#x6211;&#x77E5;&#x9053;Linux&#x4E0B;&#x5B89;&#x88C5;MongoDB&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x3002;&#x6211;&#x53CD;&#x590D;&#x5F3A;&#x8C03;&#x6211;&#x559C;&#x6B22;&#x5C0F;&#x800C;&#x7F8E;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x4FDD;&#x7559;&#x5BF9;&#x65B9;&#x6848;&#x7684;&#x9009;&#x62E9;&#x6743;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x6570;&#x636E;&#x6E05;&#x6D17;&#x548C;&#x4E2D;&#x6587;&#x5206;&#x8BCD;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x8D77;&#x770B;&#x770B;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x8BBE;&#x8BA1;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fziy51d2sqj20xj06nt8v.jpg" alt="&#x6570;&#x636E;&#x8868;&#x7ED3;&#x6784;" title>
                </div>
                <div class="image-caption">&#x6570;&#x636E;&#x8868;&#x7ED3;&#x6784;</div>
            </figure>
<p>&#x2003;&#x2003;&#x6211;&#x8FD9;&#x91CC;&#x4E00;&#x5207;&#x4ECE;&#x7B80;&#xFF0C;&#x6240;&#x4EE5;&#x5C06;&#x8FD9;5600&#x591A;&#x6761;&#x6570;&#x636E;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x5F20;&#x8868;&#x91CC;&#xFF0C;&#x8868;&#x4E2D;&#x6709;&#x56DB;&#x4E2A;&#x5B57;&#x6BB5;ID&#x3001;Post&#x3001;Wish&#x548C;Tags&#x3002;&#x663E;&#x7136;&#xFF0C;ID&#x662F;&#x81EA;&#x589E;&#x7684;&#x4E3B;&#x952E;&#xFF0C;&#x4E3A;&#x6BCF;&#x6761;&#x5FAE;&#x535A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#xFF1B;Post&#x5B58;&#x50A8;&#x6211;&#x4EEC;&#x4ECE;&#x5FAE;&#x535A;&#x4E0A;&#x6293;&#x53D6;&#x7684;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x542B;HTML&#x6807;&#x7B7E;&#xFF0C;&#x53EF;&#x662F;&#x4F1A;&#x542B;&#x6709;&#x5FAE;&#x535A;&#x8868;&#x60C5;&#x5B57;&#x7B26;&#x554A;&#x6454;&#xFF1B;Wish&#x5B58;&#x50A8;&#x6BCF;&#x6761;&#x5FAE;&#x535A;&#x4E2D;&#x5BF9;&#x4F34;&#x4FA3;&#x7684;&#x8981;&#x6C42;&#x5177;&#x4F53;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x5173;&#x952E;&#x5B57;&#x6765;&#x622A;&#x53D6;&#x53EF;&#x8C13;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x5177;&#x4F53;&#x539F;&#x56E0;&#x7A0D;&#x540E;&#x4F1A;&#x8BB2;&#x5230;:)&#xFF1B;Tags&#x5B58;&#x50A8;Wish&#x5B57;&#x6BB5;&#x7ECF;&#x8FC7;&#x5206;&#x8BCD;&#x4EE5;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x548C;SnowNLP&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x5E8F;&#x5217;&#x5316;&#x540E;&#x7684;JSON&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<p>&#x2003;&#x2003;&#x9996;&#x5148;&#xFF0C;&#x5206;&#x6790;<a href="https://weibo.com/u/5566882921" target="_blank" rel="noopener">@&#x897F;&#x5B89;&#x6708;&#x8001;&#x7275;&#x7EBF;</a>&#x53D1;&#x5E03;&#x7684;&#x5FAE;&#x535A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x6240;&#x6709;&#x5F81;&#x5A5A;&#x76F8;&#x5173;&#x7684;&#x5FAE;&#x535A;&#x90FD;&#x662F;&#x4EE5;<strong>#&#x5F81;&#x5A5A;&#x4EA4;&#x53CB;#</strong>&#x6216;&#x8005;<strong>#&#x6708;&#x8001;&#x7231;&#x7275;&#x7EBF;#</strong>&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x9898;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6761;&#x5FAE;&#x535A;&#x90FD;&#x662F;&#x5148;&#x4ECB;&#x7ECD;&#x4E2A;&#x4EBA;&#x60C5;&#x51B5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x63CF;&#x8FF0;&#x5BF9;&#x7406;&#x60F3;&#x4F34;&#x4FA3;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x627E;&#x51FA;&#x6BCF;&#x6761;&#x5FAE;&#x535A;&#x91CC;&#x5BF9;&#x7406;&#x60F3;&#x4F34;&#x4FA3;&#x7684;&#x671F;&#x671B;&#x76F8;&#x5173;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6839;&#x636E;&#x8FD9;&#x6761;&#x5FAE;&#x535A;&#x662F;&#x7531;<strong>&#x7537;&#x5609;&#x5BBE;</strong>&#x8FD8;&#x662F;<strong>&#x5973;&#x5609;&#x5BBE;</strong>&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x5373;&#x53EF;&#x6C47;&#x603B;&#x51FA;&#x7537;&#x3001;&#x5973;&#x6027;&#x5BF9;&#x5404;&#x81EA;&#x4F34;&#x4FA3;&#x7684;&#x671F;&#x671B;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x66F4;&#x65B0;&#x5728;Wish&#x5B57;&#x6BB5;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="highlight vim"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br></pre></td><td class="code"><pre><span class="line"># Filter Data</span><br><span class="line">sql = <span class="string">&quot;SELECT ID, Post FROM table_weibo WHERE POST LIKE &apos;%%%%%s%%%%&apos; OR POST LIKE &apos;%%%%%s%%%%&apos;&quot;</span></span><br><span class="line">sql = sql % (<span class="keyword">u</span><span class="string">&apos;#&#x5F81;&#x5A5A;&#x4EA4;&#x53CB;#&apos;</span>,U<span class="string">&apos;#&#x6708;&#x8001;&#x7231;&#x7275;&#x7EBF;#&apos;</span>)</span><br><span class="line">self.<span class="built_in">cursor</span>.<span class="keyword">execute</span>(sql)</span><br><span class="line">rows = self.<span class="built_in">cursor</span>.fetchall()</span><br><span class="line"></span><br><span class="line"># Adjust Data</span><br><span class="line">patterns = [<span class="string">&apos;&#x60F3;&#x627E;&apos;</span>,<span class="string">&apos;&#x5E0C;&#x671B;&#x627E;&apos;</span>,<span class="string">&apos;&#x8981;&#x6C42;&apos;</span>,<span class="string">&apos;&#x5E0C;&#x671B;&#x53E6;&#x4E00;&#x534A;&apos;</span>,<span class="string">&apos;&#x62E9;&#x5076;&#x6807;&#x51C6;&apos;</span>,<span class="string">&apos;&#x5E0C;&#x671B;&#x5BF9;&#x65B9;&apos;</span>,</span><br><span class="line"><span class="string">&apos;&#x5E0C;&#x671B;&apos;</span>,<span class="string">&apos;&#x627E;&#x4E00;&#x4F4D;&apos;</span>,<span class="string">&apos;&#x627E;&#x4E00;&#x4E2A;&apos;</span>,<span class="string">&apos;&#x4E00;&#x534A;&apos;</span>,<span class="string">&apos;&#x627E;&apos;</span>,<span class="string">&apos;&#x60F3;&apos;</span>,<span class="string">&apos;&#x559C;&#x6B22;&apos;</span>,<span class="string">&apos;&#x62E9;&#x5076;&#x6761;&#x4EF6;&apos;</span>,<span class="string">&apos;&#x5BFB;&apos;</span>,<span class="string">&apos;&#x671F;&#x5F85;&apos;</span>,</span><br><span class="line"><span class="string">&apos;&#x5973;&#x5B69;&apos;</span>,<span class="string">&apos;&#x7537;&#x5B69;&apos;</span>,<span class="string">&apos;&#x5973;&#x751F;&apos;</span>,<span class="string">&apos;&#x7537;&#x751F;&apos;</span>,<span class="string">&apos;&#x5973;&#x58EB;&apos;</span>,<span class="string">&apos;&#x7537;&#x58EB;&apos;</span>,<span class="string">&apos;&#x7406;&#x60F3;&#x578B;&apos;</span>]</span><br><span class="line">sql = <span class="string">&quot;UPDATE table_weibo SET Wish = ? WHERE ID = ?&quot;</span></span><br><span class="line"><span class="keyword">for</span> row in row<span class="variable">s:</span></span><br><span class="line">    id = row[<span class="number">0</span>]</span><br><span class="line">    post = row[<span class="number">1</span>]</span><br><span class="line">    <span class="keyword">match</span> = -<span class="number">1</span></span><br><span class="line">    <span class="keyword">for</span> pattern in pattern<span class="variable">s:</span></span><br><span class="line">        <span class="keyword">if</span>(pattern in post):</span><br><span class="line">            <span class="keyword">match</span> = post.<span class="keyword">find</span>(pattern) + <span class="built_in">len</span>(pattern)</span><br><span class="line">            <span class="keyword">break</span></span><br><span class="line">        <span class="keyword">if</span>(<span class="keyword">match</span> != -<span class="number">1</span>):</span><br><span class="line">            wish = str(post[<span class="keyword">match</span>:])</span><br><span class="line">            wish = wish.replace(<span class="string">&apos;#&#x897F;&#x5B89;&#x6708;&#x8001;&#x7275;&#x7EBF;#&apos;</span>,<span class="string">&apos;&apos;</span>)</span><br><span class="line">            wish = wish.replace(<span class="string">&apos;[&#x5FC3;]@&#x6708;&#x8001;&#x8700;&#x9ECD;&apos;</span> ,<span class="string">&apos;&apos;</span>)</span><br><span class="line">            wish = wish.replace(<span class="string">&apos;#&#x6708;&#x8001;&#x7231;&#x7275;&#x7EBF;#&apos;</span>  ,<span class="string">&apos;&apos;</span>)</span><br><span class="line">            self.<span class="built_in">cursor</span>.<span class="keyword">execute</span>(sql,(wish,id))</span><br><span class="line">        <span class="keyword">else</span>:</span><br><span class="line">            self.<span class="built_in">cursor</span>.<span class="keyword">execute</span>(sql,(<span class="string">&apos;&apos;</span>,id))</span><br><span class="line">self.connect.commit()</span><br></pre></td></tr></tbody></table></figure>
<p>&#x2003;&#x2003;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x6309;&#x7167;&#x8BDD;&#x9898;&#x5BF9;&#x5FAE;&#x535A;&#x8FDB;&#x884C;&#x4E86;&#x7B5B;&#x9009;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5173;&#x952E;&#x5B57;&#x5217;&#x8868;patterns&#x6765;&#x622A;&#x53D6;&#x6211;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x7684;Wish&#x5B57;&#x6BB5;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x91CC;&#x662F;&#x9700;&#x8981;&#x53CD;&#x590D;&#x53BB;&#x8C03;&#x6574;patterns&#x7684;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x6570;&#x636E;&#x90FD;&#x88AB;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6E10;&#x8FDB;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x80FD;&#x60F3;&#x5230;&#x901A;&#x8FC7;NLP&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x6765;&#x5206;&#x6790;&#x8FD9;&#x6BB5;&#x6587;&#x672C;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;SnowNLP&#x53BB;&#x5206;&#x6790;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x957F;&#x5EA6;&#x4E3A;100&#x5230;500&#x7684;&#x6587;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;SnowNLP&#x5177;&#x5907;&#x5206;&#x6790;&#x4E00;&#x6BB5;&#x8BDD;&#x7684;&#x6458;&#x8981;&#x53CA;&#x5173;&#x952E;&#x5B57;&#x7684;&#x80FD;&#x529B;&#x3002;&#x53EF;&#x6211;&#x53D1;&#x73B0;&#x8FD9;&#x6837;&#x5B9E;&#x8DF5;&#x4E0B;&#x6765;&#x6548;&#x679C;&#x5E76;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;SnowNLP&#x672C;&#x8EAB;&#x662F;&#x4EE5;&#x7535;&#x5546;&#x7F51;&#x7AD9;&#x7684;&#x8BC4;&#x8BBA;&#x6570;&#x636E;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9047;&#x5230;&#x6211;&#x4EEC;&#x5FAE;&#x535A;&#x8FD9;&#x6837;&#x76F8;&#x5BF9;&#x7075;&#x6D3B;&#x7684;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x5B83;&#x63D0;&#x53D6;&#x51FA;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x5730;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x671F;&#x671B;&#x3002;&#x56FA;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;SnowNLP&#x6765;&#x8FBE;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x53EF;&#x8BAD;&#x7EC3;&#x9700;&#x8981;&#x51C6;&#x5907;&#x5927;&#x91CF;&#x7684;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x4F5C;&#x4E3A;&#x652F;&#x6491;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x61D2;&#x60F0;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;&#x901A;&#x8FC7;&#x5173;&#x952E;&#x5B57;&#x6765;&#x63D0;&#x53D6;&#x5173;&#x952E;&#x4FE1;&#x606F;&#xFF0C;&#x51C6;&#x786E;&#x5EA6;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;90%&#x4EE5;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x66B4;&#x529B;&#x622A;&#x53D6;&#x96BE;&#x514D;&#x4F1A;&#x62C6;&#x5206;&#x51FA;&#x4E0D;&#x7B26;&#x5408;&#x671F;&#x671B;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x9488;&#x5BF9;&#x7537;&#x3001;&#x5973;&#x62E9;&#x5076;&#x8981;&#x6C42;&#x671F;&#x671B;&#x7684;Wish&#x5B57;&#x6BB5;&#xFF0C;&#x53EF;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5BF9;&#x6211;&#x4EEC;&#x800C;&#x8A00;&#xFF0C;&#x4F9D;&#x7136;&#x663E;&#x5F97;&#x7E41;&#x91CD;&#x800C;&#x5197;&#x4F59;&#xFF0C;&#x6240;&#x4EE5;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x5BF9;Wish&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x5206;&#x8BCD;&#xFF0C;&#x6700;&#x521D;&#x7684;&#x8BBE;&#x60F3;&#x662F;&#x901A;&#x8FC7;&#x8BCD;&#x6027;&#x548C;&#x8BED;&#x6CD5;&#x6765;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x5F53;&#x6211;&#x5206;&#x5B8C;&#x8BCD;&#x4EE5;&#x540E;&#x6211;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x4F69;&#x670D;&#x4E2D;&#x6587;&#x7684;&#x535A;&#x5927;&#x7CBE;&#x6DF1;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x4E24;&#x4E2A;&#x4E2D;&#x6587;&#x5904;&#x7406;&#x76F8;&#x5173;&#x7684;&#x5E93;&#xFF0C;&#x5373;<a href="https://github.com/fxsjy/jieba" target="_blank" rel="noopener">&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;</a>&#x548C;<a href="https://github.com/fxsjy/jieba" target="_blank" rel="noopener">SnowNLP</a>&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5E76;&#x4E14;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6587;&#x6863;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#xFF0C;&#x8FD9;&#x91CC;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;SnowNLP&#x4E2D;&#x652F;&#x6301;&#x4E2D;&#x6587;&#x6587;&#x672C;&#x7684;&#x60C5;&#x611F;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x6700;&#x521D;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5E93;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x4ECE;&#x8FD9;&#x4E9B;&#x5FAE;&#x535A;&#x4E2D;&#x627E;&#x51FA;&#x8BC4;&#x4EF7;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5F62;&#x5BB9;&#x8BCD;&#x6216;&#x8005;&#x540D;&#x8BCD;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x8BCD;&#x7684;&#x60C5;&#x611F;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8BC4;&#x4EF7;&#x6307;&#x6807;&#x7684;&#x91CD;&#x8981;&#x4F9D;&#x636E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53EF;&#x6211;&#x4EEC;&#x6709;&#x53E5;&#x8BDD;&#x53EB;&#x505A;&#x201C;&#x8BA4;&#x771F;&#x4F60;&#x5C31;&#x8F93;&#x4E86;&#x201D;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x5973;&#x6027;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5145;&#x6EE1;&#x592A;&#x591A;&#x592A;&#x591A;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x53BB;&#x7406;&#x89E3;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x79CD;&#x6211;&#x4E0D;&#x7528;&#x4E3E;&#x4F8B;&#x5B50;&#x5566;&#xFF0C;&#x73B0;&#x5728;&#x94FA;&#x5929;&#x76D6;&#x5730;&#x7684;&#x76F4;&#x7537;&#x764C;/&#x5973;&#x6743;&#x764C;&#x5E2D;&#x5377;&#x800C;&#x6765;&#xFF0C;&#x5176;&#x5B9E;&#x6709;&#x592A;&#x591A;&#x95EE;&#x9898;&#x65E0;&#x5173;&#x5BF9;&#x9519;&#xFF0C;&#x4F60;&#x8F93;&#x5C31;&#x8F93;&#x5728;&#x6CA1;&#x6709;&#x7167;&#x987E;&#x597D;&#x5BF9;&#x65B9;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5E38;&#x5E38;&#x628A;&#x60C5;&#x5546;&#x6302;&#x5728;&#x5634;&#x4E0A;&#xFF0C;&#x53EF;&#x60C5;&#x5546;&#x6982;&#x5FF5;&#x4E2D;&#x7684;<strong>&#x81EA;&#x6211;&#x610F;&#x8BC6;</strong>&#x3001;<strong>&#x63A7;&#x5236;&#x60C5;&#x7EEA;</strong>&#x3001;<strong>&#x81EA;&#x6211;&#x6FC0;&#x52B1;</strong>&#x3001;<strong>&#x8BA4;&#x77E5;&#x4ED6;&#x4EBA;&#x60C5;&#x7EEA;</strong>&#x548C;<strong>&#x5904;&#x7406;&#x76F8;&#x4E92;&#x5173;&#x7CFB;</strong>&#xFF0C;&#x6709;60%&#x8BF4;&#x7684;&#x662F;&#x81EA;&#x6211;&#x7BA1;&#x7406;&#xFF0C;&#x800C;&#x5176;&#x4F59;&#x7684;40%&#xFF0C;&#x6070;&#x6070;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x7406;&#x89E3;&#x4E2D;&#x5173;&#x4E8E;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#x65B9;&#x9762;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BF4;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x4EE3;&#x66FF;&#x4EBA;&#x7C7B;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x7EDD;&#x5BF9;&#x7406;&#x6027;&#x7684;&#x4E16;&#x754C;&#x662F;&#x6050;&#x6016;&#x7684;&#xFF0C;&#x53EF;&#x53EA;&#x6709;&#x60C5;&#x7EEA;&#x5316;&#x7684;&#x611F;&#x60C5;&#x800C;&#x4E0D;&#x8BB2;&#x9053;&#x7406;&#x7684;&#x4E16;&#x754C;&#x5219;&#x662F;&#x7A7A;&#x865A;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53BB;&#x8FFD;&#x9010;&#x4EBA;&#x7C7B;&#x5185;&#x5FC3;&#x4E2D;&#x7684;&#x7075;&#x6027;&#xFF0C;&#x5373;&#x771F;&#x3001;&#x5584;&#x3001;&#x7F8E;&#xFF0C;&#x8FD9;&#x662F;&#x4EFB;&#x4F55;&#x51B0;&#x51B7;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6240;&#x4E0D;&#x5177;&#x5907;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x53EF;&#x6211;&#x4EEC;&#x80FD;&#x4E0D;&#x80FD;&#x771F;&#x8BDA;&#x4E00;&#x70B9;&#x5462;&#xFF0C;&#x660E;&#x660E;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x5957;&#x8DEF;&#x53EF;&#x4F60;&#x8FD8;&#x6EE1;&#x5FC3;&#x671F;&#x5F85;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x975E;&#x4E0D;&#x61C2;&#x5F97;&#x4EC0;&#x4E48;&#x662F;&#x7231;&#xFF0C;&#x7231;&#x4E0D;&#x662F;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;&#x5957;&#x8DEF;&#x53BB;&#x5957;&#x8DEF;&#x4F60;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x660E;&#x77E5;&#x8FD9;&#x662F;&#x5957;&#x8DEF;&#x8FD8;&#x613F;&#x610F;&#x966A;&#x4F60;&#x8868;&#x6F14;&#x4E0B;&#x53BB;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x5728;&#x8BBD;&#x523A;&#x6D59;&#x6C5F;&#x536B;&#x89C6;&#x67D0;&#x8282;&#x76EE;&#xFF0C;&#x613F;&#x6E29;&#x67D4;&#x7684;&#x4F60;&#x88AB;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6E29;&#x67D4;&#x5730;&#x5BF9;&#x5F85;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5173;&#x4E8E;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x548C;SnowNLP&#x5730;&#x5BF9;&#x6BD4;&#x8BC4;&#x6D4B;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF1A;<a href="http://blog.csdn.net/sinat_26917383/article/details/77067515" target="_blank" rel="noopener">Python&#xFE31;&#x516D;&#x6B3E;&#x4E2D;&#x6587;&#x5206;&#x8BCD;&#x6A21;&#x5757;&#x5C1D;&#x8BD5;</a>&#xFF0C;&#x8FD9;&#x91CC;&#x535A;&#x4E3B;&#x53D1;&#x73B0;SnowNLP&#x9002;&#x5408;&#x505A;&#x5927;&#x9897;&#x7C92;&#x5206;&#x8BCD;&#x62C6;&#x5206;&#xFF0C;&#x800C;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x9002;&#x5408;&#x505A;&#x5C0F;&#x9897;&#x7C92;&#x5206;&#x8BCD;&#x62C6;&#x5206;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4ECE;&#x5206;&#x8BCD;&#x6548;&#x679C;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x662F;&#x8981;&#x6BD4;SnowNLP&#x6548;&#x679C;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#x7684;&#xFF0C;&#x53EF;&#x6211;&#x8FD9;&#x6837;&#x8BF4;&#x4E0D;&#x662F;&#x4F1A;&#x663E;&#x5F97;&#x60C5;&#x5546;&#x6BD4;&#x8F83;&#x9AD8;&#x5417;&#xFF1F;&#x8FD9;&#x6837;&#x4F60;&#x4EEC;&#x4F1A;&#x559C;&#x6B22;&#x5417;&#xFF1F;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x91C7;&#x53D6;&#x7684;&#x65B9;&#x6848;&#x662F;&#x4E24;&#x8005;&#x6DF7;&#x7528;&#xFF0C;&#x6545;&#x800C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF1A;<br></p><figure class="highlight ruby"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">generateTags</span><span class="params">(<span class="keyword">self</span>,text)</span></span><span class="symbol">:</span></span><br><span class="line">    snow = SnowNLP(text)</span><br><span class="line">    sentences = snow.tags</span><br><span class="line">    tags = []</span><br><span class="line">    <span class="keyword">for</span> s <span class="keyword">in</span> <span class="symbol">sentences:</span></span><br><span class="line">        words = pseg.cut(s[<span class="number">0</span>])</span><br><span class="line">        <span class="keyword">for</span> w <span class="keyword">in</span> <span class="symbol">words:</span></span><br><span class="line">            tags.append({<span class="string">&apos;word&apos;</span><span class="symbol">:w</span>.word,<span class="string">&apos;flag&apos;</span><span class="symbol">:w</span>.flag})</span><br><span class="line">    <span class="keyword">return</span> json.dumps(tags)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;&#x83B7;&#x5F97;&#x4E86;&#x6BCF;&#x4E2A;&#x8BCD;&#x7684;&#x8BCD;&#x6027;&#xFF0C;&#x4E0D;&#x8FC7;&#x5230;&#x6211;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BCD;&#x6027;&#x7684;&#x5904;&#x7406;&#x6211;&#x4F9D;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x91CC;&#x4EC5;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x7ED3;&#x679C;&#x4EE5;JSON&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x5B8C;&#x6210;&#x4E86;&#x6240;&#x6709;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x6709;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x4E2D;&#x6587;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x53D6;&#x66B4;&#x529B;&#x66FF;&#x6362;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x53BB;&#x9664;&#x5373;&#x53EF;&#xFF0C;&#x5BF9;&#x6B64;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x5C55;&#x5F00;&#x8BF4;&#x5566;&#x3002;&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixyl4fmtj20wv06p0tx.jpg" alt="&#x5904;&#x7406;&#x540E;&#x7684;&#x6570;&#x636E;" title>
                </div>
                <div class="image-caption">&#x5904;&#x7406;&#x540E;&#x7684;&#x6570;&#x636E;</div>
            </figure>
<h2 id="&#x5904;&#x7406;&#x7ED3;&#x679C;&#x5448;&#x73B0;"><a href="#&#x5904;&#x7406;&#x7ED3;&#x679C;&#x5448;&#x73B0;" class="headerlink" title="&#x5904;&#x7406;&#x7ED3;&#x679C;&#x5448;&#x73B0;"></a>&#x5904;&#x7406;&#x7ED3;&#x679C;&#x5448;&#x73B0;</h2><p>&#x2003;&#x2003;&#x8BF4;&#x8D77;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD9;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x79EF;&#x7D2F;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6709;&#x57FA;&#x4E8E;&#x5927;&#x6570;&#x636E;&#x7684;&#x63A8;&#x8350;&#x548C;&#x9884;&#x6D4B;&#x7B49;&#x7B49;&#x76F8;&#x5173;&#x573A;&#x666F;&#xFF0C;&#x77E5;&#x4E4E;&#x548C;&#x5FAE;&#x535A;&#x7684;&#x9996;&#x9875;Feed&#x6D41;&#x7ECF;&#x8FC7;&#x65E0;&#x6570;&#x6B21;&#x7B97;&#x6CD5;&#x8C03;&#x6574;&#xFF0C;&#x53EF;&#x4EBA;&#x4EEC;&#x4F9D;&#x7136;&#x5728;&#x62B1;&#x6028;&#x7B97;&#x6CD5;&#x5411;&#x4EBA;&#x4EEC;&#x63A8;&#x8350;&#x4E86;&#x65E0;&#x5173;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x671F;&#x5F85;&#x7684;&#x667A;&#x80FD;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x667A;&#x80FD;&#x800C;&#x5DF2;&#xFF0C;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x7406;&#x8BBA;&#xFF0C;&#x662F;&#x5426;&#x4E00;&#x5B9A;&#x662F;&#x7B26;&#x5408;&#x67D0;&#x79CD;&#x51A5;&#x51A5;&#x4E4B;&#x4E2D;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x6211;&#x60F3;&#x8D77;&#x300A;&#x6A21;&#x4EFF;&#x6E38;&#x620F;&#x300B;&#x4E2D;&#x548C;&#x5377;&#x798F;&#x626E;&#x6F14;&#x7684;&#x56FE;&#x7075;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x5BF9;&#x6BD4;&#x7684;&#xFF0C;&#x6B63;&#x662F;&#x4EE5;&#x4F11;.&#x538B;&#x529B;&#x5C71;&#x5927;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x7EDF;&#x8BA1;&#x65B9;&#x6CD5;&#x6D3E;&#xFF0C;&#x7535;&#x5F71;&#x4E2D;&#x4ED6;&#x4EEC;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x5B57;&#x6BCD;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x6765;&#x7834;&#x89E3;&#x6069;&#x5C3C;&#x683C;&#x739B;&#x3002;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5206;&#x6790;&#x800C;&#x8A00;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x53EF;&#x89C6;&#x5316;&#x662F;&#x9762;&#x5411;&#x4EBA;&#x7C7B;&#x7684;&#x5206;&#x6790;&#x624B;&#x6BB5;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x6316;&#x6398;&#x5C31;&#x662F;&#x9762;&#x5411;&#x673A;&#x5668;&#x7684;&#x5206;&#x6790;&#x624B;&#x6BB5;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x521A;&#x521A;&#x5165;&#x95E8;&#x7684;&#x840C;&#x65B0;&#xFF0C;&#x6211;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x6211;&#x5BF9;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x4E00;&#x79CD;&#x611F;&#x89C9;&#x3002;&#x56DE;&#x5230;&#x672C;&#x6587;&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x9009;&#x62E9;&#x4EE5;&#x8BCD;&#x4E91;&#x4F5C;&#x4E3A;&#x6700;&#x7EC8;&#x5904;&#x7406;&#x7ED3;&#x679C;&#x7684;&#x5448;&#x73B0;&#x8F7D;&#x4F53;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8BCD;&#x4E91;&#xFF0C;&#x5373;WordCloud&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5C55;&#x73B0;&#x5173;&#x952E;&#x5B57;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x535A;&#x5BA2;&#x5199;&#x4F5C;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x8BF8;&#x5982;WordPress&#x3001;Ghost&#x3001;Hexo&#x7B49;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x6807;&#x7B7E;&#x4E91;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x90FD;&#x4F1A;&#x7ED9;&#x6587;&#x7AE0;&#x6DFB;&#x52A0;&#x82E5;&#x5E72;&#x6807;&#x7B7E;&#xFF0C;&#x800C;&#x6807;&#x7B7E;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x8BA9;&#x8BFB;&#x8005;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x5728;&#x6807;&#x7B7E;&#x4E91;&#x4E2D;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x8D8A;&#x9AD8;&#x7684;&#x6807;&#x7B7E;&#x5176;&#x5B57;&#x4F53;&#x901A;&#x5E38;&#x4F1A;&#x8D8A;&#x5927;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x76F4;&#x89C2;&#x5730;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x6BCF;&#x4E2A;&#x56E0;&#x7D20;&#x5728;&#x6574;&#x4F53;&#x4E0A;&#x5360;&#x5230;&#x7684;&#x6BD4;&#x91CD;&#x3002;&#x672C;&#x6587;&#x4E4B;&#x6240;&#x4EE5;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x6B63;&#x662F;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x8BCD;&#x4E91;&#x6765;&#x5448;&#x73B0;&#x7537;&#x5973;&#x5728;&#x62E9;&#x5076;&#x89C2;&#x4E0A;&#x66F4;&#x770B;&#x91CD;&#x4EC0;&#x4E48;&#x3002;&#x751F;&#x6210;&#x8BCD;&#x4E91;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF1A;<a href="https://www.zhihu.com/question/28382979/answer/117544077" target="_blank" rel="noopener">&#x9664;&#x4E86; Tagxedo&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x5236;&#x4F5C;&#x53EF;&#x4EE5;&#x8BCD;&#x4E91;?</a>&#xFF0C;&#x800C;&#x535A;&#x4E3B;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;<a href="https://github.com/amueller/word_cloud" target="_blank" rel="noopener">wordcloud</a>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;Python&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E07;&#x80FD;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x6211;&#x5C31;&#x95EE;&#x4F60;&#x6015;&#x4E0D;&#x6015;&#xFF0C;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x5E93;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#xFF1A;<a href="https://amueller.github.io/word_cloud/" target="_blank" rel="noopener">https://amueller.github.io/word_cloud/</a>&#xFF0C;&#x5982;&#x679C;&#x901A;&#x8FC7;pip&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x5B89;&#x88C5;&#x8BE5;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<a href="https://www.lfd.uci.edu/~gohlke/pythonlibs/#wordcloud" target="_blank" rel="noopener">&#x8FD9;&#x91CC;</a>&#x4E0B;&#x8F7D;.whl&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#xFF0C;&#x6CE8;&#x610F;&#x5347;&#x7EA7;pip&#x5230;&#x6700;&#x65B0;&#x7248;&#x672C;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53C2;&#x7167;&#x5B98;&#x65B9;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6839;&#x636E;Post&#x6765;&#x8FC7;&#x6EE4;&#x6027;&#x522B;&#xFF0C;&#x6839;&#x636E;Tags&#x6765;&#x83B7;&#x53D6;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6240;&#x6709;Tags&#x4E32;&#x8054;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;WordCloud&#x6A21;&#x5757;&#x5373;&#x53EF;&#x3002;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment"># Filter Data</span></span><br><span class="line">sql = <span class="string">&quot;SELECT Post, Tags FROM table_weibo WHERE Tags &lt;&gt; &apos;&apos;&quot;</span></span><br><span class="line">self.cursor.execute(sql)</span><br><span class="line">rows = self.cursor.fetchall()</span><br><span class="line"></span><br><span class="line"><span class="comment"># Filter Tags</span></span><br><span class="line">male_tags = <span class="string">&apos;&apos;</span></span><br><span class="line">female_tags = <span class="string">&apos;&apos;</span></span><br><span class="line"><span class="keyword">for</span> row <span class="keyword">in</span> rows:</span><br><span class="line">    post = row[<span class="number">0</span>]</span><br><span class="line">    tags = json.loads(row[<span class="number">1</span>])</span><br><span class="line">    <span class="keyword">if</span> <span class="string">u&apos;&#x7537;&#x5609;&#x5BBE;[&#x5411;&#x53F3;]&apos;</span> <span class="keyword">in</span> post:</span><br><span class="line">        female_tags += <span class="string">&apos;,&apos;</span>.join(map(<span class="keyword">lambda</span> x:x[<span class="string">&apos;word&apos;</span>],tags))</span><br><span class="line">    <span class="keyword">elif</span> <span class="string">u&apos;&#x5973;&#x5609;&#x5BBE;[&#x5411;&#x53F3;]&apos;</span> <span class="keyword">in</span> row[<span class="number">0</span>]:</span><br><span class="line">        male_tags += <span class="string">&apos;,&apos;</span>.join(map(<span class="keyword">lambda</span> x:x[<span class="string">&apos;word&apos;</span>],tags))</span><br><span class="line">                </span><br><span class="line"><span class="comment"># WordCloud self.generateWordCloud(female_tags,&apos;female.png&apos;,&apos;output_female.png&apos;) self.generateWordCloud(male_tags,&apos;male.png&apos;,&apos;output_male.png&apos;)</span></span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x5C06;&#x7537;&#x5609;&#x5BBE;/&#x5973;&#x5609;&#x5BBE;&#x5206;&#x522B;&#x7B5B;&#x9009;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5206;&#x8BCD;&#x7ED3;&#x679C;&#x7528;&#x9017;&#x53F7;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x5373;&#x53EF;&#x5F97;&#x5230;male_tags&#x548C;female_tags&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;WordCloud&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4EEC;&#x4E3A;&#x7537;&#x6027;/&#x5973;&#x6027;&#x8BCD;&#x4E91;&#x5206;&#x522B;&#x8BBE;&#x7F6E;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x80CC;&#x666F;&#x56FE;&#x7247;&#xFF0C;&#x6700;&#x7EC8;&#x4F1A;&#x751F;&#x6210;&#x4E24;&#x5F20;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x53C2;&#x8003;&#x4E86;<a href="https://amueller.github.io/word_cloud/auto_examples/colored.html" target="_blank" rel="noopener">Image-colored</a>&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x5C55;&#x793A;&#x5982;&#x4E0B;&#xFF1A;<br></p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">generateWordCloud</span><span class="params">(self,text,background,output)</span>:</span></span><br><span class="line">    back_coloring = np.array(Image.open(background))</span><br><span class="line">    stopwords = set(STOPWORDS)</span><br><span class="line">    stopwords.add(<span class="string">u&apos;&#x897F;&#x5B89;&apos;</span>)</span><br><span class="line">    stopwords.add(<span class="string">u&apos;&#x751F;&#x6D3B;&apos;</span>)</span><br><span class="line">    wordcloud = WordCloud(</span><br><span class="line">        font_path=<span class="string">&apos;simfang.ttf&apos;</span>,  <span class="comment"># &#x8BBE;&#x7F6E;&#x5B57;&#x4F53;</span></span><br><span class="line">        background_color=<span class="string">&quot;white&quot;</span>,  <span class="comment"># &#x80CC;&#x666F;&#x989C;&#x8272;</span></span><br><span class="line">        max_words=<span class="number">5000</span>,  <span class="comment"># &#x8BCD;&#x4E91;&#x663E;&#x793A;&#x7684;&#x6700;&#x5927;&#x8BCD;&#x6570;</span></span><br><span class="line">        mask=back_coloring,  <span class="comment"># &#x8BBE;&#x7F6E;&#x80CC;&#x666F;&#x56FE;&#x7247;</span></span><br><span class="line">        stopwords=stopwords, <span class="comment">#&#x505C;&#x7528;&#x8BCD;&#x8BBE;&#x7F6E;</span></span><br><span class="line">        max_font_size=<span class="number">75</span>,  <span class="comment"># &#x5B57;&#x4F53;&#x6700;&#x5927;&#x503C;</span></span><br><span class="line">        random_state=<span class="number">42</span>,</span><br><span class="line">        width=<span class="number">1000</span>, height=<span class="number">860</span>, margin=<span class="number">15</span>,<span class="comment"># &#x8BBE;&#x7F6E;&#x56FE;&#x7247;&#x9ED8;&#x8BA4;&#x7684;&#x5927;&#x5C0F;,&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x80CC;&#x666F;&#x56FE;&#x7247;&#x7684;&#x8BDD;,&#x90A3;&#x4E48;&#x4FDD;&#x5B58;&#x7684;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x5C06;&#x4F1A;&#x6309;&#x7167;&#x5176;&#x5927;&#x5C0F;&#x4FDD;&#x5B58;,margin&#x4E3A;&#x8BCD;&#x8BED;&#x8FB9;&#x7F18;&#x8DDD;&#x79BB;</span></span><br><span class="line">    )</span><br><span class="line"></span><br><span class="line">    wordcloud.generate(text)</span><br><span class="line">    plt.imshow(wordcloud)</span><br><span class="line">    plt.axis(<span class="string">&quot;off&quot;</span>)</span><br><span class="line">    plt.show()</span><br><span class="line">    wordcloud.to_file(output)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x2003;&#x2003;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x6DFB;&#x52A0;&#x4E86;&#x4E24;&#x4E2A;&#x505C;&#x6B62;&#x8BCD;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;<strong>&#x897F;&#x5B89;</strong>&#x548C;<strong>&#x751F;&#x6D3B;</strong>&#x8FD9;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x5728;&#x6574;&#x4F53;&#x4E2D;&#x6240;&#x5360;&#x6743;&#x91CD;&#x867D;&#x7136;&#x8F83;&#x9AD8;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6293;&#x53D6;&#x7684;&#x662F;&#x897F;&#x5B89;&#x672C;&#x5730;&#x7684;&#x5FAE;&#x535A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x5BF9;&#x6211;&#x4EEC;&#x800C;&#x8A00;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x518D;&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x8FDB;&#x884C;&#x5254;&#x9664;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x751F;&#x6210;&#x7684;&#x8BCD;&#x4E91;&#x5982;&#x56FE;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzixbiu6p1j20go0m841l.jpg" alt="&#x7537;&#x6027;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4F34;&#x4FA3;" title>
                </div>
                <div class="image-caption">&#x7537;&#x6027;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4F34;&#x4FA3;</div>
            </figure>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="https://ws1.sinaimg.cn/large/4c36074fly1fzix8qmp8vj20jj0l7ae6.jpg" alt="&#x5973;&#x6027;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4F34;&#x4FA3;" title>
                </div>
                <div class="image-caption">&#x5973;&#x6027;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4F34;&#x4FA3;</div>
            </figure>
<h1 id="&#x8FD9;&#x662F;&#x4E2A;&#x770B;&#x8138;&#x7684;&#x4E16;&#x754C;"><a href="#&#x8FD9;&#x662F;&#x4E2A;&#x770B;&#x8138;&#x7684;&#x4E16;&#x754C;" class="headerlink" title="&#x8FD9;&#x662F;&#x4E2A;&#x770B;&#x8138;&#x7684;&#x4E16;&#x754C;"></a>&#x8FD9;&#x662F;&#x4E2A;&#x770B;&#x8138;&#x7684;&#x4E16;&#x754C;</h1><p>&#x2003;&#x2003;&#x5BF9;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x663E;&#x7136;&#x6210;&#x7ACB;&#x7684;&#x7ED3;&#x8BBA;&#xFF0C;&#x6211;&#x662F;&#x8868;&#x793A;&#x5931;&#x671B;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x50CF;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5C31;&#x50CF;&#x4F60;&#x671F;&#x5F85;&#x7740;&#x5BF9;&#x65B9;&#x8BF4;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x7ED3;&#x679C;&#x5230;&#x6700;&#x540E;&#x5979;&#x8FD8;&#x662F;&#x4F1A;&#x8BF4;&#x6211;&#x4EEC;&#x4E0D;&#x5408;&#x9002;&#x3002;&#x53EF;&#x82B1;&#x8D39;&#x5982;&#x6B64;&#x5927;&#x7684;&#x7BC7;&#x5E45;&#x6765;&#x8BB2;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x60B2;&#x4F24;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8C61;&#x5F81;&#x6027;&#x5730;&#x5206;&#x6790;&#x4E0B;&#x7ED3;&#x8BBA;&#x5427;&#xFF01;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x7537;&#x6027;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4F34;&#x4FA3;&#xFF0C;&#x6392;&#x540D;&#x9760;&#x524D;&#x5173;&#x952E;&#x5B57;&#x662F;<strong>&#x6027;&#x683C;</strong>&#x3001;<strong>&#x5B5D;&#x987A;</strong>&#x3001;<strong>&#x5584;&#x826F;</strong>&#x3001;<strong>&#x61C2;&#x4E8B;</strong>&#x3001;<strong>&#x7ED3;&#x5A5A;</strong>&#x3001;<strong>&#x8EAB;&#x9AD8;</strong>&#x3001;<strong>&#x773C;&#x7F18;</strong>&#xFF0C;&#x800C;&#x5973;&#x6027;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4F34;&#x4FA3;&#xFF0C;&#x6392;&#x540D;&#x9760;&#x524D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x662F;<strong>&#x8EAB;&#x9AD8;</strong>&#x3001;<strong>&#x7A33;&#x91CD;</strong>&#x3001;<strong>&#x8D23;&#x4EFB;&#x5FC3;</strong>&#x3001;<strong>&#x4E0A;&#x8FDB;&#x5FC3;</strong>&#x3001;<strong>&#x5DE5;&#x4F5C;</strong>&#x3001;<strong>&#x6210;&#x719F;</strong>&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5973;&#x751F;&#x4F1A;&#x5BF9;180&#x7684;&#x8EAB;&#x9AD8;&#x5982;&#x6B64;&#x8FF7;&#x604B;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x4EEC;&#x60F3;&#x88AB;&#x7537;&#x670B;&#x53CB;&#x4E3E;&#x9AD8;&#x9AD8;&#x5440;&#xFF0C;&#x6211;&#x7684;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x5982;&#x662F;&#x8BF4;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x6307;&#x6807;&#x8B6C;&#x5982;<strong>&#x5B5D;&#x987A;</strong>&#x3001;<strong>&#x5584;&#x826F;</strong>&#x3001;<strong>&#x7A33;&#x91CD;</strong>&#x3001;<strong>&#x8D23;&#x4EFB;&#x5FC3;</strong>&#x3001;<strong>&#x4E0A;&#x8FDB;&#x5FC3;</strong>&#x7B49;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x76F8;&#x5904;&#x4E45;&#x4E86;&#x4EE5;&#x540E;&#x6162;&#x6162;&#x53BB;&#x9A8C;&#x8BC1;&#x7684;&#xFF0C;&#x53EF;&#x8FD9;&#x4E9B;&#x6700;&#x7EC8;&#x4F1A;&#x88AB;<strong>&#x773C;&#x7F18;</strong>&#x548C;<strong>&#x8EAB;&#x9AD8;</strong>&#x8FD9;&#x79CD;&#x56E0;&#x7D20;&#x963B;&#x6321;&#x5728;&#x5916;&#x9762;&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x6D45;&#x663E;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x5C45;&#x7136;&#x503C;&#x5F97;&#x6211;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x53BB;&#x601D;&#x8003;&#x3002;&#x4E00;&#x4E2A;&#x4F60;&#x5438;&#x5F15;&#x4E0D;&#x5230;&#x7684;&#x4EBA;&#xFF0C;&#x7EC8;&#x7A76;&#x662F;&#x96BE;&#x4EE5;&#x62C9;&#x8FD1;&#x4E24;&#x4E2A;&#x4EBA;&#x5FC3;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x7684;&#x3002;&#x559C;&#x6B22;&#x662F;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x8981;&#x5351;&#x5FAE;&#x5730;&#x4E5E;&#x6C42;&#x4F60;&#x6765;&#x89C1;&#x6211;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x6765;&#x89C1;&#x6211;&#x6211;&#x5C31;&#x4E3B;&#x52A8;&#x8FCE;&#x4E0A;&#x53BB;&#x3002;&#x6709;&#x5929;&#x5728;QQ&#x7A7A;&#x95F4;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x5728;&#x770B;&#x300A;&#x6026;&#x7136;&#x5FC3;&#x52A8;&#x300B;&#xFF0C;&#x5C31;&#x5FCD;&#x4E0D;&#x4F4F;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x4E00;&#x4E2A;&#x4EBA;&#x770B;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#xFF0C;&#x6216;&#x8BB8;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x4F60;&#x4F1A;&#x6E10;&#x6E10;&#x53D1;&#x73B0;&#xFF0C;&#x90A3;&#x79CD;&#x56E0;&#x4E3A;&#x559C;&#x6B22;&#x800C;&#x9644;&#x52A0;&#x5728;&#x5BF9;&#x65B9;&#x8EAB;&#x4E0A;&#x7684;&#x5149;&#x73AF;&#xFF0C;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x5149;&#x800C;&#x6162;&#x6162;&#x53D8;&#x6DE1;&#x3002;&#x800C;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x53EA;&#x60F3;&#x6BD4;&#x5979;&#x53D8;&#x5F97;&#x66F4;&#x4F18;&#x79C0;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x5E7B;&#x60F3;&#x5979;&#x4F1A;&#x8F6C;&#x8EAB;&#x56DE;&#x6765;&#x770B;&#x6211;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x6210;&#x957F;&#x5427;&#xFF01;</p>
<h1 id="&#x672C;&#x6587;&#x5C0F;&#x7ED3;"><a href="#&#x672C;&#x6587;&#x5C0F;&#x7ED3;" class="headerlink" title="&#x672C;&#x6587;&#x5C0F;&#x7ED3;"></a>&#x672C;&#x6587;&#x5C0F;&#x7ED3;</h1><p>&#x2003;&#x2003;&#x5927;&#x6982;&#x6CA1;&#x6709;&#x8C01;&#x4F1A;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x5199;&#x4E00;&#x7BC7;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x63BA;&#x6742;&#x5982;&#x6B64;&#x591A;&#x7684;&#x4E2A;&#x4EBA;&#x60C5;&#x611F;&#x3002;&#x53EF;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x52A8;&#x673A;&#xFF0C;&#x7684;&#x786E;&#x5C31;&#x662F;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x3002;&#x6211;&#x7FA1;&#x6155;175&#x4EE5;&#x4E0A;&#x7684;&#x8EAB;&#x9AD8;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x662F;&#x6211;&#x5177;&#x5907;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x8EAB;&#x9AD8;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x559C;&#x6B22;&#x6211;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x5427;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x603B;&#x80FD;&#x627E;&#x5230;&#x65B0;&#x7684;&#x7406;&#x7531;&#x6765;&#x62D2;&#x7EDD;&#x6211;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x901A;&#x8FC7;Python&#x6293;&#x53D6;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x6570;&#x636E;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x60F3;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x56E0;&#x4E3A;&#x4E0D;&#x5177;&#x5907;&#x54EA;&#x4E9B;&#x56E0;&#x7D20;&#x800C;&#x4E0D;&#x88AB;&#x4EBA;&#x559C;&#x6B22;&#xFF0C;&#x800C;&#x662F;&#x60F3;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4F18;&#x70B9;&#x540C;&#x6211;&#x4EEC;&#x7684;&#x7F3A;&#x70B9;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x6211;&#x4EEC;&#x3002;&#x522B;&#x4EBA;&#x559C;&#x6B22;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x5462;&#xFF1F;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x8BB8;&#x5D69;&#x3001;&#x559C;&#x6B22;&#x6797;&#x4F9D;&#x6668;&#xFF0C;&#x96BE;&#x9053;&#x5C31;&#x8981;&#x8BA9;&#x4EBA;&#x5BB6;&#x559C;&#x6B22;&#x6211;&#x4EEC;&#x5417;&#xFF1F;&#x6211;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x4F46;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x9A84;&#x50B2;&#x5730;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x9A84;&#x50B2;&#x65F6;&#x7684;&#x6837;&#x5B50;&#x6700;&#x5E05;&#xFF0C;&#x8C01;&#x8BA9;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x770B;&#x8138;&#x7684;&#x4E16;&#x754C;&#x5462;&#xFF1F;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/1329254441/">使用Python生成博客目录并自动更新README</a></li><li><a href="https://qinyuanpei.github.io/posts/3444626340/">博客图片迁移折腾记</a></li><li><a href="https://qinyuanpei.github.io/posts/2822230423/">基于Python实现Windows下壁纸切换功能</a></li><li><a href="http://www.huweihuang.com/article/python/basics/python-advanced-features/">[Python] Python系列（三）之高级特性</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1386017461/" rel="external">基于新浪微博的男女性择偶观数据分析(上)</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1386017461/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1386017461/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Python/">Python</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/微博/">微博</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/词云/">词云</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1386017461/&title=《基于新浪微博的男女性择偶观数据分析(上)》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1386017461/&title=《基于新浪微博的男女性择偶观数据分析(上)》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1386017461/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《基于新浪微博的男女性择偶观数据分析(上)》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1386017461/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1386017461/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/2676125676/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">2017，在驻足间回首</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3111375079/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">冬天来了，春天还会远吗？</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1386017461/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1386017461/&title=《基于新浪微博的男女性择偶观数据分析(上)》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1386017461/&title=《基于新浪微博的男女性择偶观数据分析(上)》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1386017461/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《基于新浪微博的男女性择偶观数据分析(上)》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1386017461/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1386017461/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1386017461/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
