<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        Unity3D游戏开发之路：一月工作总结 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;不知不觉已经在公司上班一个月了，在这一个月里每一天发生的事情是我平凡而普通的生活。作为一名有节操的程序员，当我大学的同学开始称我为程序员的时候，我知道我即将在这条路上踏下一个属于开始的足迹。和我大学的同学相比，可能我会显得幸运而孤独吧！我不用像他们一样到各种工厂里采样、监测，可是与此同时我会因为离大家越来越远而感到孤独。每天下班做公交车回到住处，简单地料理着我一个人的生活，">
<meta name="keywords" content="Unity3D,生活,工作">
<meta property="og:type" content="article">
<meta property="og:title" content="Unity3D游戏开发之路：一月工作总结">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1059499448/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;不知不觉已经在公司上班一个月了，在这一个月里每一天发生的事情是我平凡而普通的生活。作为一名有节操的程序员，当我大学的同学开始称我为程序员的时候，我知道我即将在这条路上踏下一个属于开始的足迹。和我大学的同学相比，可能我会显得幸运而孤独吧！我不用像他们一样到各种工厂里采样、监测，可是与此同时我会因为离大家越来越远而感到孤独。每天下班做公交车回到住处，简单地料理着我一个人的生活，">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Unity3D游戏开发之路：一月工作总结">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;不知不觉已经在公司上班一个月了，在这一个月里每一天发生的事情是我平凡而普通的生活。作为一名有节操的程序员，当我大学的同学开始称我为程序员的时候，我知道我即将在这条路上踏下一个属于开始的足迹。和我大学的同学相比，可能我会显得幸运而孤独吧！我不用像他们一样到各种工厂里采样、监测，可是与此同时我会因为离大家越来越远而感到孤独。每天下班做公交车回到住处，简单地料理着我一个人的生活，">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">Unity3D游戏开发之路：一月工作总结</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">Unity3D游戏开发之路：一月工作总结</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-06-24T07:42:48.000Z" itemprop="datePublished" class="page-time">
  2015-06-24
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-Unity3D游戏开发之路：一月工作总结" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">Unity3D游戏开发之路：一月工作总结</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-06-24 07:42:48" datetime="2015-06-24T07:42:48.000Z" itemprop="datePublished">2015-06-24</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        29 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5DF2;&#x7ECF;&#x5728;&#x516C;&#x53F8;&#x4E0A;&#x73ED;&#x4E00;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x4E2A;&#x6708;&#x91CC;&#x6BCF;&#x4E00;&#x5929;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x6211;&#x5E73;&#x51E1;&#x800C;&#x666E;&#x901A;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x6709;&#x8282;&#x64CD;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5F53;&#x6211;&#x5927;&#x5B66;&#x7684;&#x540C;&#x5B66;&#x5F00;&#x59CB;&#x79F0;&#x6211;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x6211;&#x5373;&#x5C06;&#x5728;&#x8FD9;&#x6761;&#x8DEF;&#x4E0A;&#x8E0F;&#x4E0B;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x5F00;&#x59CB;&#x7684;&#x8DB3;&#x8FF9;&#x3002;&#x548C;&#x6211;&#x5927;&#x5B66;&#x7684;&#x540C;&#x5B66;&#x76F8;&#x6BD4;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x4F1A;&#x663E;&#x5F97;&#x5E78;&#x8FD0;&#x800C;&#x5B64;&#x72EC;&#x5427;&#xFF01;&#x6211;&#x4E0D;&#x7528;&#x50CF;&#x4ED6;&#x4EEC;&#x4E00;&#x6837;&#x5230;&#x5404;&#x79CD;&#x5DE5;&#x5382;&#x91CC;&#x91C7;&#x6837;&#x3001;&#x76D1;&#x6D4B;&#xFF0C;&#x53EF;&#x662F;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x6211;&#x4F1A;&#x56E0;&#x4E3A;&#x79BB;&#x5927;&#x5BB6;&#x8D8A;&#x6765;&#x8D8A;&#x8FDC;&#x800C;&#x611F;&#x5230;&#x5B64;&#x72EC;&#x3002;&#x6BCF;&#x5929;&#x4E0B;&#x73ED;&#x505A;&#x516C;&#x4EA4;&#x8F66;&#x56DE;&#x5230;&#x4F4F;&#x5904;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x6599;&#x7406;&#x7740;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E0D;&#x7D27;&#x4E0D;&#x6162;&#x5374;&#x6C38;&#x8FDC;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x6478;&#x9ED1;&#x8D76;&#x8DEF;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;&#x8DEF;&#xFF0C;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x66FE;&#x540E;&#x6094;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x548C;&#x7F8E;&#x672F;&#x5404;&#x79CD;&#x95F9;&#x522B;&#x626D;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x4E9B;&#x90FD;&#x4F1A;&#x662F;&#x6682;&#x65F6;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x603B;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x3002;</p>
<a id="more"></a>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x9AD8;&#x5927;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x878D;&#x5408;&#x4E86;3D&#x6F2B;&#x6E38;&#x3001;Web&#x548C;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7684;&#x7EFC;&#x5408;&#x9879;&#x76EE;&#xFF0C;&#x53EF;&#x6211;&#x60F3;&#x8BF4;&#x6211;&#x5728;&#x52AA;&#x529B;&#x5730;&#x505A;&#x597D;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x5F53;&#x4E92;&#x8054;&#x7F51;+&#x7684;&#x6982;&#x5FF5;&#x88AB;&#x4EBA;&#x4EEC;&#x6240;&#x719F;&#x77E5;&#x4EE5;&#x540E;&#xFF0C;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7ED3;&#x5408;&#x8BA9;&#x4EBA;&#x4EEC;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x751F;&#x6D3B;&#x5145;&#x6EE1;&#x4E86;&#x9050;&#x60F3;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x65AD;&#x6D8C;&#x73B0;&#x51FA;&#x60F3;&#x8981;&#x8FEB;&#x5207;&#x8FDB;&#x5165;&#x4E92;&#x8054;&#x7F51;+&#x65F6;&#x4EE3;&#x7684;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x3002;&#x53EF;&#x662F;&#x5F53;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x8BD5;&#x56FE;&#x8FDB;&#x5165;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7ECF;&#x8425;&#x8005;&#x5FC3;&#x4E2D;&#x5230;&#x5E95;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x4E86;&#x89E3;&#x591A;&#x5C11;&#x3002;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x5728;&#x5BB6;&#x4EBA;&#x7684;&#x53E3;&#x4E2D;&#x88AB;&#x6F14;&#x7ECE;&#x51FA;&#x4E86;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x5C31;&#x662F;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x8BA4;&#x8BC6;&#x7684;&#x4E00;&#x79CD;&#x7F29;&#x5F71;&#x5427;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x5E76;&#x4E0D;&#x4E86;&#x89E3;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#xFF0C;&#x5F53;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x505A;&#x4E92;&#x8054;&#x7F51;+&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x66F4;&#x591A;&#x7684;&#x662F;&#x8111;&#x6D77;&#x4E2D;&#x4E00;&#x95EA;&#x800C;&#x8FC7;&#x7684;&#x70ED;&#x60C5;&#x5427;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x6211;&#x7684;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5F53;&#x4F60;&#x5904;&#x5728;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x5341;&#x5B57;&#x8DEF;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x8981;&#x865A;&#x5FC3;&#x5730;&#x4E86;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7684;&#x8FD0;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5C1D;&#x8BD5;&#x5C06;&#x5176;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;&#x53EF;&#x662F;&#x66F4;&#x4E3A;&#x5B9E;&#x9645;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x5F53;&#x8FD9;&#x4E9B;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7684;&#x7ECF;&#x8425;&#x8005;&#x6709;&#x4E86;&#x8FDB;&#x5165;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x60F3;&#x6CD5;&#x4EE5;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x4F1A;&#x4ECE;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x884C;&#x4E1A;&#x6765;&#x770B;&#x5F85;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x751A;&#x81F3;&#x7247;&#x9762;&#x7684;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x5DF2;&#x7136;&#x6210;&#x7AF9;&#x5728;&#x80F8;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x4E24;&#x4E09;&#x4E2A;&#x61C2;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x5176;&#x5B9E;&#x662F;&#x7279;&#x522B;&#x53EF;&#x6015;&#x7684;&#xFF0C;&#x4EE5;&#x516C;&#x53F8;&#x4E3A;&#x4F8B;&#xFF0C;&#x4ECE;&#x6211;&#x8FDB;&#x516C;&#x53F8;&#x4EE5;&#x6765;&#xFF0C;&#x516C;&#x53F8;&#x4ECE;&#x672A;&#x5BF9;&#x5373;&#x5C06;&#x8981;&#x505A;&#x7684;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x8FC7;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x8BC4;&#x4F30;&#x548C;&#x7ACB;&#x9879;&#x8BA8;&#x8BBA;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7F8E;&#x672F;&#x751A;&#x81F3;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x5B58;&#x5728;&#x3001;&#x66F4;&#x4E0D;&#x77E5;&#x9053;&#x505A;&#x597D;&#x7684;&#x6A21;&#x578B;&#x8981;&#x8FD0;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x600E;&#x6837;&#x7684;&#x6280;&#x672F;&#x4E0A;&#x53BB;&#x4EE5;&#x53CA;&#x6700;&#x7EC8;&#x4F1A;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x6211;&#x6240;&#x770B;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x516C;&#x53F8;&#x91CC;&#x6CA1;&#x65E5;&#x6CA1;&#x591C;&#x7684;&#x505A;&#x6A21;&#x578B;&#x3002;&#x6211;&#x60F3;&#x8FD9;&#x5C31;&#x662F;&#x9886;&#x5BFC;&#x8111;&#x888B;&#x4E00;&#x70ED;&#x7684;&#x7ED3;&#x679C;&#x5427;&#xFF0C;&#x5927;&#x6982;&#x77E5;&#x9053;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x662F;&#x5BF9;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5B9E;&#x65BD;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x3001;&#x5B9E;&#x65BD;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x8D44;&#x6E90;&#x5374;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x601D;&#x8003;&#x3002;&#x6211;&#x8FDB;&#x516C;&#x53F8;&#x8FD9;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x8FC7;&#x6210;&#x6587;&#x7684;&#x7B56;&#x5212;&#x6216;&#x8005;&#x662F;&#x65B9;&#x6848;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x5019;&#x662F;&#x5927;&#x5BB6;&#x5728;&#x4E00;&#x5757;&#x513F;&#x505A;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x73B0;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x518D;&#x8FD4;&#x56DE;&#x53BB;&#x6539;&#xFF0C;&#x9886;&#x5BFC;&#x7684;&#x6001;&#x5EA6;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x51C6;&#xFF0C;&#x89C9;&#x5F97;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x501F;&#x9274;&#x8FC7;&#x6765;&#x5C31;&#x8981;&#x6C42;&#x7A0B;&#x5E8F;&#x548C;&#x7F8E;&#x672F;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x8BA1;&#x5212;&#x671D;&#x4EE4;&#x5915;&#x6539;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x5728;&#x516C;&#x53F8;&#x4ECE;&#x6CD5;&#x5F8B;&#x4E0A;&#x6765;&#x8BB2;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x540D;&#x666E;&#x901A;&#x5458;&#x5DE5;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x62C5;&#x5F53;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x89D2;&#x8272;&#x3002;&#x6216;&#x8BB8;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x83B7;&#x6BD4;&#x666E;&#x901A;&#x5458;&#x5DE5;&#x66F4;&#x4E3A;&#x4E30;&#x5BCC;&#x7684;&#x9664;&#x6280;&#x672F;&#x4EE5;&#x5916;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x53EF;&#x662F;&#x4ECE;&#x957F;&#x8FDC;&#x53D1;&#x5C55;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x53EA;&#x4F1A;&#x8BA9;&#x6211;&#x5185;&#x5FC3;&#x66F4;&#x52A0;&#x538C;&#x5026;&#x76EE;&#x524D;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5E0C;&#x671B;&#x65E9;&#x4E00;&#x5929;&#x79BB;&#x5F00;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#xFF01;</p>
<p>#1&#x3001;&#x9879;&#x76EE;&#x8BE5;&#x8C01;&#x8BF4;&#x4E86;&#x7B97;&#xFF1F;<br>&#x2003;&#x2003;&#x5728;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7B56;&#x5212;&#x7684;&#x56E2;&#x961F;&#x91CC;&#xFF0C;&#x7F8E;&#x672F;&#x548C;&#x7A0B;&#x5E8F;&#x5C31;&#x50CF;&#x6C34;&#x706B;&#x4E0D;&#x5BB9;&#x7684;&#x4E24;&#x80A1;&#x52BF;&#x529B;&#x6B64;&#x6D88;&#x5F7C;&#x957F;&#x3002;&#x867D;&#x7136;&#x8BF4;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x6709;&#x8282;&#x64CD;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6211;&#x7684;&#x5185;&#x5FC3;&#x662F;&#x62D2;&#x7EDD;&#x8BA9;&#x7B56;&#x5212;&#x6765;&#x9886;&#x5BFC;&#x7A0B;&#x5E8F;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x6E38;&#x620F;&#x7F51;&#x6E38;&#x5316;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x5728;&#x56FD;&#x5185;&#x57FA;&#x672C;&#x662F;&#x627E;&#x4E0D;&#x5230;&#x591A;&#x5C11;&#x5BF9;&#x5386;&#x53F2;&#x3001;&#x4EBA;&#x6587;&#x3001;&#x5B97;&#x6559;&#x7B49;&#x9886;&#x57DF;&#x90FD;&#x6709;&#x7814;&#x7A76;&#x7684;&#x7B56;&#x5212;&#x7684;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x5F00;&#x53D1;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x6E38;&#x620F;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x7684;&#x6784;&#x5EFA;&#x4E0A;&#x90FD;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x7814;&#x7A76;&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x7B56;&#x5212;&#x529E;&#x516C;&#x8F6F;&#x4EF6;&#x5316;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x7B56;&#x5212;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#x65E9;&#x5DF2;&#x4E0D;&#x518D;&#x662F;&#x6E38;&#x620F;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x8FD9;&#x4E9B;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x5462;&#xFF1F;&#x53EF;&#x80FD;&#x90FD;&#x5728;&#x5173;&#x6CE8;&#x6E38;&#x620F;&#x7684;&#x76C8;&#x5229;&#x548C;&#x5404;&#x79CD;&#x6E38;&#x620F;&#x7CFB;&#x7EDF;&#x6570;&#x503C;&#x7684;&#x8BBE;&#x8BA1;&#x4E0A;&#x5427;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x4E0D;&#x60F3;&#x505A;&#x592A;&#x591A;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x5BB6;&#x90FD;&#x660E;&#x767D;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x5566;&#xFF01;&#x597D;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6211;&#x4EEC;&#x5904;&#x5728;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7B56;&#x5212;&#x7684;&#x56E2;&#x961F;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x6309;&#x7167;&#x7F8E;&#x672F;&#x7684;&#x601D;&#x8DEF;&#x53BB;&#x505A;&#xFF0C;&#x53EF;&#x80FD;&#x7A0B;&#x5E8F;&#x4F1A;&#x5728;&#x4FEE;&#x6539;&#x4E86;&#x82E5;&#x5E72;&#x6B21;&#x9879;&#x76EE;&#x4EE5;&#x540E;&#x5BF9;&#x7F8E;&#x672F;&#x7684;&#x8981;&#x6C42;&#x5931;&#x53BB;&#x4FE1;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x76F8;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x800C;&#x8A00;&#xFF0C;&#x4F5C;&#x4E3A;&#x7F8E;&#x672F;&#x7684;&#x666E;&#x901A;&#x4EBA;&#x63D0;&#x51FA;&#x9700;&#x6C42;&#x7684;&#x96BE;&#x5EA6;&#x663E;&#x7136;&#x66F4;&#x4F4E;&#x3002;&#x53EF;&#x662F;&#x5982;&#x679C;&#x6309;&#x7A0B;&#x5E8F;&#x7684;&#x601D;&#x8DEF;&#x53BB;&#x505A;&#xFF0C;&#x53EF;&#x80FD;&#x7F8E;&#x672F;&#x4E0D;&#x5927;&#x4F1A;&#x63A5;&#x53D7;&#x7A0B;&#x5E8F;&#x7684;&#x5BA1;&#x7F8E;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x7A0B;&#x5E8F;&#x66F4;&#x559C;&#x6B22;&#x7EAF;&#x7CB9;&#x800C;&#x7B80;&#x6D01;&#x7684;&#x4E1C;&#x897F;&#x3001;&#x66F4;&#x770B;&#x91CD;&#x80FD;&#x5426;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x597D;&#x4E0D;&#x597D;&#x770B;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5728;&#x8003;&#x8651;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x540E;&#x518D;&#x53BB;&#x8003;&#x8651;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x8FDB;&#x516C;&#x53F8;&#x4EE5;&#x540E;&#xFF0C;&#x57FA;&#x672C;&#x7ECF;&#x5386;&#x4E86;&#x8FD9;&#x6837;&#x4E24;&#x79CD;&#x505A;&#x4E8B;&#x65B9;&#x5F0F;&#x7684;&#x6D17;&#x793C;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x6280;&#x672F;&#x8FD9;&#x8FB9;&#x548C;&#x6211;&#x8BF4;&#x4E86;&#x5927;&#x6982;&#x601D;&#x8DEF;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x505A;&#x51FA;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x539F;&#x578B;(1.0&#x7248;&#x672C;),&#x7ED3;&#x679C;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x548C;&#x516C;&#x53F8;&#x7684;&#x601D;&#x8DEF;&#x5B8C;&#x5168;&#x662F;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x6B64;1.0&#x7248;&#x672C;&#x5C31;&#x5728;&#x8FD9;&#x6837;&#x88AB;&#x627C;&#x6740;&#x5728;&#x8941;&#x8913;&#x4E2D;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7F8E;&#x672F;&#x63D0;&#x51FA;&#x4E86;&#x5148;&#x505A;UI,&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x7B49;&#x5F85;&#x5979;&#x4EEC;&#x505A;UI&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x4E86;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x5929;&#x5929;&#x5F80;&#x9694;&#x58C1;&#x529E;&#x516C;&#x5BA4;&#x8DD1;&#xFF0C;&#x641E;&#x5F97;&#x90A3;&#x4E2A;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#x7684;&#x59B9;&#x5B50;&#x6BCF;&#x6B21;&#x770B;&#x5230;&#x6211;&#x8FDB;&#x53BB;&#x90FD;&#x8981;&#x62AC;&#x8D77;&#x5934;&#x770B;&#x4E00;&#x4E0B;&#x3002;&#x6BCF;&#x5929;&#x8DD1;&#x6765;&#x8DD1;&#x53BB;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x6C9F;&#x901A;&#xFF0C;&#x548C;&#x9886;&#x5BFC;&#x6C9F;&#x901A;&#x3001;&#x548C;&#x7F8E;&#x672F;&#x6C9F;&#x901A;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x5728;&#x76F8;&#x4E92;&#x6C9F;&#x901A;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x52A0;&#x6DF1;&#x5BF9;&#x9879;&#x76EE;&#x9700;&#x6C42;&#x7684;&#x7406;&#x89E3;&#x3002;&#x7B49;&#x5230;&#x7F8E;&#x672F;&#x7684;UI&#x505A;&#x51FA;&#x6765;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x51C6;&#x5907;&#x505A;UI&#x4E86;&#xFF0C;&#x7ED3;&#x679C;&#x505A;&#x5230;&#x4E00;&#x534A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9886;&#x5BFC;&#x8BF4;UI&#x8BBE;&#x8BA1;&#x4E0D;&#x5408;&#x683C;&#xFF0C;&#x88AB;&#x6253;&#x56DE;&#x53BB;&#x91CD;&#x65B0;&#x505A;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x82B1;&#x4E86;&#x4E00;&#x5468;&#x65F6;&#x95F4;&#x5F00;&#x4F1A;&#x8BA8;&#x8BBA;&#xFF0C;&#x6211;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x6CA1;&#x6709;&#x8D44;&#x683C;&#x53C2;&#x4E0E;&#x516C;&#x53F8;&#x4F1A;&#x8BAE;&#x53D8;&#x6210;&#x4E86;&#x6BCF;&#x6B21;&#x4F1A;&#x8BAE;&#x90FD;&#x8981;&#x53C2;&#x52A0;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x5BF9;&#x6211;&#x662F;&#x597D;&#x4E8B;&#x8FD8;&#x662F;&#x574F;&#x4E8B;&#xFF0C;&#x8BF4;&#x597D;&#x4E8B;&#x5427;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x7EC8;&#x4E8E;&#x6709;&#x53D1;&#x8A00;&#x6743;&#x4E86;&#xFF0C;&#x8BF4;&#x574F;&#x4E8B;&#x5427;&#x662F;&#x56E0;&#x4E3A;&#x7ECF;&#x5E38;&#x548C;&#x7F8E;&#x672F;&#x4E89;&#x5F97;&#x9762;&#x7EA2;&#x8033;&#x8D64;&#xFF0C;&#x603B;&#x4E4B;&#x6BCF;&#x6B21;&#x5F00;&#x5B8C;&#x4F1A;&#x6211;&#x90FD;&#x5FCD;&#x4E0D;&#x4F4F;&#x8981;&#x5410;&#x69FD;&#x4E0B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x90A3;&#x4E48;&#x597D;&#x4E86;&#xFF0C;&#x5404;&#x4F4D;&#x770B;&#x5B98;&#xFF0C;&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x65E0;&#x975E;&#x662F;&#x60F3;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5230;&#x4E0D;&#x80FD;&#x518D;&#x7B80;&#x5355;&#x7684;&#x9053;&#x7406;&#xFF1A;&#x51E1;&#x4E8B;&#x9884;&#x5219;&#x7ACB;&#xFF0C;&#x4E0D;&#x9884;&#x5219;&#x5E9F;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x5728;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x524D;&#x4E00;&#x5B9A;&#x8981;&#x505A;&#x597D;&#x89C4;&#x5212;&#xFF0C;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x8003;&#x9A8C;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5728;&#x9879;&#x76EE;&#x7ACB;&#x9879;&#x524D;&#x505A;&#x597D;&#x5145;&#x8DB3;&#x7684;&#x51C6;&#x5907;&#xFF0C;&#x5C31;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x4E0A;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x6211;&#x4E86;&#x89E3;&#x5230;&#x4ED9;&#x5251;&#x9879;&#x76EE;&#x7ACB;&#x9879;&#x5C31;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x6DF1;&#x6DF1;&#x5730;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7ECF;&#x8425;&#x8005;&#x4EEC;&#x7684;&#x8111;&#x95E8;&#x4E00;&#x62CD;&#x7684;&#x51B3;&#x5B9A;&#x662F;&#x591A;&#x4E48;&#x7684;&#x4E0D;&#x9760;&#x8C31;&#x554A;&#x3002;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x66FE;&#x7ECF;&#x770B;&#x5230;&#x8FC7;&#x8BF4;&#x201D;&#x9879;&#x76EE;&#x4E07;&#x4E8B;&#x4FF1;&#x5907;&#xFF0C;&#x518D;&#x5DEE;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x597D;&#x4E86;&#x201D;&#x7684;&#x7C7B;&#x4F3C;&#x8A00;&#x8BBA;&#xFF0C;&#x5176;&#x5B9E;&#x8BF4;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x81EA;&#x547D;&#x4E0D;&#x51E1;&#x7684;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7ECF;&#x8425;&#x8005;&#x4EEC;&#xFF0C;&#x5F53;&#x4F60;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x82E5;&#x5E72;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x591F;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6070;&#x6070;&#x8BF4;&#x660E;&#x4F60;&#x8FD8;&#x4E0D;&#x591F;&#x61C2;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#xFF01;</p>
<p>#2&#x3001;&#x732A;&#x4E00;&#x6837;&#x7684;&#x961F;&#x53CB;<br>&#x2003;&#x2003;&#x6211;&#x8EAB;&#x8FB9;&#x8BB8;&#x591A;&#x73A9;LOL&#x7684;&#x4EBA;&#x90FD;&#x5728;&#x5410;&#x69FD;&#x6253;&#x5339;&#x914D;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#x7684;&#x90FD;&#x662F;&#x732A;&#x4E00;&#x6837;&#x7684;&#x961F;&#x53CB;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x4E2D;&#x5219;&#x66F4;&#x4E3A;&#x5E38;&#x89C1;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x7F8E;&#x672F;&#x51FA;&#x8EAB;&#x7684;&#x9886;&#x5BFC;&#x600E;&#x4E48;&#x4F1A;&#x8BA4;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x8D8A;&#x591A;&#x9879;&#x76EE;&#x8FDB;&#x5EA6;&#x5C31;&#x8D8A;&#x80FD;&#x8D76;&#x4E0A;&#x3002;&#x505A;&#x9879;&#x76EE;&#x4E0D;&#x662F;&#x5927;&#x5BB6;&#x4E00;&#x5757;&#x513F;&#x505A;&#x6A21;&#x578B;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5206;&#x7ED9;&#x51E0;&#x4E2A;&#x7136;&#x540E;&#x7528;&#x7740;&#x7834;&#x89E3;&#x7248;&#x7684;3DsMax&#x5C31;&#x641E;&#x5B9A;&#x4E86;&#x3002;&#x7A0B;&#x5E8F;&#x5728;&#x6211;&#x770B;&#x6765;&#x66F4;&#x5E94;&#x8BE5;&#x5728;&#x4FDD;&#x8BC1;&#x4EBA;&#x5458;&#x914D;&#x5907;&#x5408;&#x7406;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x4FDD;&#x8BC1;&#x8D28;&#x91CF;&#x3002;</p>
<p>&#x2003;&#x2003;&#x9996;&#x5148;&#x7B2C;&#x4E00;&#x6761;&#xFF0C;&#x4EBA;&#x5458;&#x914D;&#x5907;&#x5408;&#x7406;&#x5C31;&#x662F;&#x8BF4;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6570;&#x91CF;&#x8981;&#x5408;&#x7406;&#xFF0C;&#x5176;&#x6B21;&#x5927;&#x5BB6;&#x7684;&#x5C42;&#x6B21;&#x5DEE;&#x522B;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x592A;&#x5927;&#x3002;&#x56E0;&#x4E3A;&#x4EBA;&#x591A;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x5BF9;&#x9879;&#x76EE;&#x4EE3;&#x7801;&#x7684;&#x5F71;&#x54CD;&#x53EF;&#x80FD;&#x66F4;&#x5927;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x5927;&#x5BB6;&#x7F16;&#x7A0B;&#x7684;&#x98CE;&#x683C;&#x548C;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F53;&#x73B0;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x672A;&#x77E5;&#x7684;Bug&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6C42;&#x5927;&#x5BB6;&#x7684;&#x5C42;&#x6B21;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x5C42;&#x6B21;&#x5DEE;&#x522B;&#x592A;&#x5927;&#xFF0C;&#x9996;&#x5148;&#x56E2;&#x961F;&#x5185;&#x6C9F;&#x901A;&#x5C31;&#x662F;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x6211;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x624B;&#x4E0B;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x57F9;&#x8BAD;&#x73ED;&#x57F9;&#x8BAD;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x8001;&#x5E08;&#x7ED9;&#x4E00;&#x5957;&#x89C6;&#x9891;&#x7136;&#x540E;&#x7167;&#x7740;&#x89C6;&#x9891;&#x505A;&#x51FA;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x53CD;&#x611F;&#x7528;&#x89C6;&#x9891;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B66;&#x4E60;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x662F;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x8F6F;&#x4EF6;&#xFF0C;&#x867D;&#x7136;Unity3D&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x89C6;&#x5316;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x6211;&#x773C;&#x91CC;&#x5B83;&#x59CB;&#x7EC8;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF0C;&#x800C;&#x975E;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;Office&#x6216;&#x8005;&#x662F;3D&#x8F6F;&#x4EF6;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x4E0D;&#x8981;&#x628A;&#x7F16;&#x7A0B;&#x5F53;&#x4F5C;&#x4E00;&#x79CD;&#x56FA;&#x5B9A;&#x7684;&#x5957;&#x8DEF;&#xFF0C;&#x7ECF;&#x5E38;&#x6709;&#x4EBA;&#x76F4;&#x63A5;&#x6284;&#x6211;&#x535A;&#x5BA2;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x9879;&#x76EE;&#xFF0C;&#x7136;&#x540E;&#x51FA;&#x4E86;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x518D;&#x6765;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF1F;&#x78B0;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x9996;&#x5148;&#x95EE;&#x7684;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x4E0D;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4E00;&#x822C;&#x4F1A;&#x5148;&#x8BA9;&#x5B83;&#x641E;&#x61C2;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x91CC;&#x7684;&#x7F8E;&#x672F;&#x90FD;&#x4E0D;&#x613F;&#x610F;&#x78B0;Unity3D&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x4F1A;&#x589E;&#x52A0;&#x4ED6;&#x4EEC;&#x5B66;&#x4E60;&#x8F6F;&#x4EF6;&#x7684;&#x5404;&#x79CD;&#x6210;&#x672C;&#xFF0C;&#x53EF;&#x662F;&#x4E8B;&#x5B9E;&#x662F;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x6BD4;&#x6211;&#x89C1;&#x8FC7;&#x7684;Max&#x3001;Maya&#x3001;Blender&#x7B49;&#x8F6F;&#x4EF6;&#x90FD;&#x7B80;&#x5355;&#x554A;&#xFF0C;&#x800C;&#x4E14;Unity3D&#x514D;&#x8D39;&#x7248;&#x7684;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x53D1;&#x7B80;&#x5355;&#x5730;&#x6E38;&#x620F;&#xFF0C;&#x6BD4;&#x4E4B;&#x7F8E;&#x672F;&#x53E3;&#x4E2D;&#x5404;&#x79CD;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#x7684;&#x76D7;&#x7248;&#x3001;&#x7834;&#x89E3;&#x8F6F;&#x4EF6;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x5E72;&#x51C0;&#x4E86;&#x591A;&#x5C11;&#xFF1F;&#x5F52;&#x6839;&#x5230;&#x5E95;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x7F8E;&#x672F;&#x4E0D;&#x613F;&#x610F;&#x5C1D;&#x8BD5;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7F8E;&#x672F;&#x603B;&#x8BA4;&#x4E3A;Max&#x91CC;&#x7684;&#x6A21;&#x578B;&#x5BFC;&#x51FA;&#x5230;Unity3D&#x540E;&#x6750;&#x8D28;&#x554A;&#x3001;&#x706F;&#x5149;&#x554A;&#x4F1A;&#x4E22;&#xFF0C;&#x7F8E;&#x672F;&#x603B;&#x8BA4;&#x4E3A;Max&#x6E32;&#x67D3;&#x7684;&#x6548;&#x679C;&#x8981;&#x6BD4;Unity3D&#x597D;&#x8BB8;&#x591A;&#xFF0C;&#x53EF;&#x662F;&#x65E2;&#x7136;&#x4F60;&#x9009;&#x62E9;&#x4E86;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x6765;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7F8E;&#x672F;&#x662F;&#x6709;&#x8D23;&#x4EFB;&#x6765;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x7684;&#xFF0C;&#x4F60;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x5E2E;&#x4F60;&#x62FC;UI&#x6211;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x5E2E;&#x4F60;&#x6253;&#x706F;&#x5149;&#x3001;&#x4FEE;&#x6539;&#x6750;&#x8D28;&#x3001;&#x6446;&#x573A;&#x666F;&#xFF0C;&#x8FD9;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x561B;?&#x6211;&#x8BF4;&#x865A;&#x5E7B;&#x56DB;&#x8FD9;&#x6837;&#x7684;&#x5F15;&#x64CE;&#x90FD;&#x662F;&#x7531;&#x7B56;&#x5212;&#x6765;&#x7F16;&#x8F91;&#x5173;&#x5361;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x4EEC;&#x7F8E;&#x672F;&#x5C31;&#x4E0D;&#x80FD;&#x5C1D;&#x8BD5;&#x4E86;&#x89E3;&#x4E0B;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x5462;&#xFF1F;&#x5F97;&#x5230;&#x7684;&#x7B54;&#x6848;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x6A21;&#x578B;&#xFF0C;&#x663E;&#x7136;&#x5F53;&#x7F8E;&#x672F;&#x7684;&#x773C;&#x775B;&#x53EA;&#x76EF;&#x7740;&#x624B;&#x5934;&#x7684;&#x90A3;&#x51E0;&#x6837;&#x5DE5;&#x5177;&#x8F6F;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x548C;&#x4ED6;&#x4EEC;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#x5DF2;&#x7ECF;&#x62C9;&#x5F00;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x80FD;&#x529B;&#x3001;&#x6709;&#x65F6;&#x95F4;&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x59A8;&#x5C1D;&#x8BD5;&#x4E0B;&#x5C06;&#x7F16;&#x7A0B;&#x4EE5;&#x5916;&#x7684;&#x80FD;&#x529B;&#x6574;&#x5408;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x672A;&#x6765;&#x662F;&#x5C5E;&#x4E8E;&#x5168;&#x80FD;&#x578B;&#x4EBA;&#x624D;&#x7684;&#xFF01;</p>
<p>#3&#x3001;&#x600E;&#x6837;&#x8BA9;&#x9879;&#x76EE;&#x6D41;&#x7A0B;&#x5316;<br>&#x2003;&#x2003;&#x6211;&#x89C9;&#x5F97;&#x50CF;&#x6E38;&#x620F;&#x8FD9;&#x6837;&#x8D1F;&#x8D23;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x5728;&#x7ACB;&#x9879;&#x4E4B;&#x521D;&#x5C31;&#x5E94;&#x8BE5;&#x660E;&#x786E;&#x7F8E;&#x672F;&#x3001;&#x7B56;&#x5212;&#x3001;&#x7A0B;&#x5E8F;&#x5404;&#x81EA;&#x7684;&#x8D23;&#x4EFB;&#x3002;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x7F8E;&#x672F;&#x6765;&#x5236;&#x4F5C;&#x7D20;&#x6750;&#x3001;&#x7A0B;&#x5E8F;&#x6765;&#x7F16;&#x5199;&#x76F8;&#x5173;&#x903B;&#x8F91;&#x548C;&#x5916;&#x90E8;&#x5DE5;&#x5177;&#x3001;&#x7B56;&#x5212;&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x5DE5;&#x5177;&#x6765;&#x7F16;&#x8F91;&#x5173;&#x5361;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x6211;&#x6765;&#x516C;&#x53F8;&#x524D;&#xFF0C;&#x66FE;&#x770B;&#x8FC7;&#x4E00;&#x4F4D;&#x524D;&#x8F88;&#x5199;&#x8FC7;&#x7684;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x4E2A;Demo&#xFF0C;&#x5F53;&#x521D;&#x8FD9;&#x4E2A;Demo&#x91CC;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x6700;&#x521D;&#x662F;&#x5BF9;&#x8FD9;&#x4F4D;&#x524D;&#x8F88;&#x9887;&#x4E3A;&#x656C;&#x91CD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;Demo&#x7684;&#x8868;&#x73B0;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x751A;&#x81F3;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x524D;&#x8F88;&#x6307;&#x70B9;&#x4E00;&#x4E8C;&#xFF0C;&#x5B9E;&#x4E43;&#x4E09;&#x751F;&#x6709;&#x5E78;&#x554A;&#x3002;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x548C;&#x8FD9;&#x4F4D;&#x524D;&#x8F88;&#x804A;&#x8FC7;&#x4EE5;&#x540E;&#x4EE5;&#x53CA;&#x770B;&#x8FC7;&#x4ED6;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x5BF9;&#x4ED6;&#x7684;&#x656C;&#x91CD;&#x6162;&#x6162;&#x5730;&#x53D8;&#x6210;&#x4E86;&#x9119;&#x5937;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x4ED6;&#x5411;&#x9886;&#x5BFC;&#x63D0;&#x8BAE;&#x4F7F;&#x7528;&#x786C;&#x4EE3;&#x7801;&#x6765;&#x7F16;&#x5199;&#x9879;&#x76EE;&#xFF0C;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x4ED6;&#x5199;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x4ED6;&#x7684;&#x9879;&#x76EE;&#x786E;&#x5B9E;&#x4F7F;&#x7528;&#x786C;&#x4EE3;&#x7801;&#x5199;&#x6210;&#x7684;&#xFF0C;&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x5728;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x4E2D;&#x5E76;&#x5217;7&#x4E2A;if&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;tag&#x4E0D;&#x540C;&#x561B;&#xFF0C;&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x5728;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x547D;&#x540D;&#x90FD;&#x662F;&#x6C49;&#x8BED;&#x62FC;&#x97F3;&#x7684;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x561B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x629B;&#x5F00;&#x4ED6;&#x5199;&#x7684;&#x9879;&#x76EE;&#x4E0D;&#x8BF4;&#xFF0C;&#x4ECE;&#x89C4;&#x6A21;&#x548C;&#x8D1F;&#x8D23;&#x7A0B;&#x5EA6;&#x4E0A;&#x76EE;&#x524D;&#x8FD9;&#x4E2A;&#x9879;&#x90FD;&#x6BD4;&#x4ED6;&#x7684;Demo&#x6709;&#x96BE;&#x5EA6;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5927;&#x6982;&#x9700;&#x8981;&#x5236;&#x4F5C;35&#x4E2A;&#x573A;&#x666F;&#x6D89;&#x53CA;&#x5230;&#x4E0A;&#x5343;&#x79CD;&#x6A21;&#x578B;&#x548C;&#x8D34;&#x56FE;&#x800C;&#x975E;Demo&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x5176;&#x6B21;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x7684;&#x53D1;&#x5E03;&#x5E73;&#x53F0;&#x662F;Web&#x5E73;&#x53F0;&#x800C;&#x975E;Demo&#x4E2D;&#x7684;PC&#x5E73;&#x53F0;&#x3002;&#x5199;&#x786C;&#x4EE3;&#x7801;&#x610F;&#x5473;&#x7740;&#x653E;&#x5F03;&#x590D;&#x7528;&#x548C;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x987E;&#x53CA;&#x76EE;&#x524D;&#x800C;&#x4E0D;&#x8003;&#x8651;&#x4EE5;&#x540E;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x80AF;&#x5B9A;&#x662F;&#x9700;&#x8981;&#x6269;&#x6574;&#x89C4;&#x6A21;&#x7684;&#xFF0C;&#x96BE;&#x9053;&#x6BCF;&#x6B21;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x573A;&#x666F;&#x90FD;&#x9700;&#x8981;&#x628A;&#x4EE3;&#x7801;&#x91CD;&#x65B0;&#x5199;&#x4E00;&#x904D;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5728;&#x548C;&#x4ED6;&#x4EA4;&#x6D41;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5F53;&#x7740;&#x4ED6;&#x7684;&#x9762;&#x5C31;&#x7ED9;Pass&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x8BF4;&#x6211;&#x4EEC;&#x5148;&#x505A;&#x4E2A;Demo&#x770B;&#x770B;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x79EF;&#x7D2F;&#x4E86;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6211;&#x4EEC;&#x8FC5;&#x901F;&#x5730;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8F83;&#x4E3A;&#x7075;&#x6D3B;&#x7684;&#x6846;&#x67B6;&#x3002;&#x6574;&#x4E2A;&#x6846;&#x67B6;&#x662F;&#x5C06;&#x6A21;&#x578B;&#x5355;&#x72EC;&#x6253;&#x5305;&#x540E;&#x548C;&#x8D34;&#x56FE;&#x4E00;&#x8D77;&#x5B58;&#x653E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x548C;&#x8D34;&#x56FE;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x6237;&#x578B;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x9700;&#x8981;&#x67D0;&#x4E9B;&#x6A21;&#x578B;&#x548C;&#x8D34;&#x56FE;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x548C;&#x8D34;&#x56FE;&#x90FD;&#x88AB;&#x5B58;&#x653E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x672C;&#x5730;&#x4EC5;&#x4EC5;&#x5B58;&#x653E;&#x76F8;&#x5173;&#x7684;&#x6237;&#x578B;&#x6A21;&#x578B;&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x9879;&#x76EE;&#x7684;&#x4F53;&#x79EF;&#x88AB;&#x5927;&#x5927;&#x5730;&#x538B;&#x7F29;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;Web&#x5E73;&#x53F0;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x573A;&#x666F;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6765;&#x5B9A;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x6A21;&#x578B;&#x548C;&#x8D34;&#x56FE;&#x4EE5;&#x53CA;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5373;&#x53EF;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x9879;&#x76EE;&#x66F4;&#x65B0;&#x5F97;&#x901F;&#x5EA6;&#x3002;&#x603B;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x5BF9;&#x6211;&#x8BBE;&#x8BA1;&#x7684;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x8868;&#x793A;&#x6EE1;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8BA9;&#x786C;&#x4EE3;&#x7801;&#x7684;&#x4F18;&#x8D8A;&#x611F;&#x8361;&#x7136;&#x65E0;&#x5B58;&#x3002;&#x540C;&#x65F6;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x4EBA;&#x5DE5;&#x7F16;&#x5199;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3001;&#x6253;&#x5305;&#x7B49;&#x8FC7;&#x7A0B;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x901A;&#x8FC7;&#x4E3A;Unity3D&#x7F16;&#x5199;&#x63D2;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x4E86;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x534A;&#x81EA;&#x52A8;&#x5316;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x534A;&#x81EA;&#x52A8;&#x5316;&#x554A;&#xFF1F;&#x56E0;&#x4E3A;&#x4EBA;&#x5728;&#x505A;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x3001;&#x89C4;&#x8303;&#x7684;&#x4E60;&#x60EF;&#x6216;&#x8005;&#x8BF4;&#x96BE;&#x4EE5;&#x7EDF;&#x4E00;&#x548C;&#x89C4;&#x8303;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x5F3A;&#x8C03;&#x7EDF;&#x4E00;&#x548C;&#x89C4;&#x8303;&#xFF0C;&#x53EF;&#x662F;&#x7F8E;&#x672F;&#x603B;&#x8BA4;&#x4E3A;&#x7A0B;&#x5E8F;&#x7684;&#x8981;&#x6C42;&#x8FC7;&#x4E8E;&#x82DB;&#x523B;&#xFF0C;&#x53EF;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x61C2;&#x5F97;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#x90FD;&#x660E;&#x767D;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x4E0D;&#x8FC7;&#x662F;&#x5BF9;&#x67D0;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x6709;&#x9650;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x7F8E;&#x672F;&#x8BF4;&#x9700;&#x8981;XXX&#x529F;&#x80FD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5185;&#x5FC3;&#x5176;&#x5B9E;&#x662F;&#x62D2;&#x7EDD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x8FD9;&#x70B9;&#x9700;&#x6C42;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5199;&#x5341;&#x51E0;&#x884C;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x61D2;&#x60F0;&#x548C;&#x5F31;&#x667A;&#xFF0C;&#x9886;&#x5BFC;&#x8BA9;&#x6211;&#x4EEC;&#x5C06;&#x6237;&#x578B;&#x5185;&#x7684;&#x7269;&#x4F53;&#x5C3D;&#x91CF;&#x5168;&#x90E8;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x5316;&#xFF0C;&#x8981;&#x7ED9;&#x7528;&#x6237;&#x6700;&#x5927;&#x7684;&#x81EA;&#x7531;&#xFF0C;&#x7ED3;&#x679C;&#x5374;&#x662F;&#x5265;&#x593A;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x81EA;&#x7531;&#x5199;&#x4E86;&#x82E5;&#x5E72;&#x4E2A;if&#x6216;&#x8005;&#x662F;&#x91CD;&#x590D;&#x8C03;&#x7528;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x7B80;&#x76F4;&#x662F;&#x6076;&#x9B54;&#x554A;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x5199;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x8FD9;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6709;&#x8282;&#x64CD;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x8BF4;&#x597D;&#x7684;&#x6BCF;&#x5468;&#x4E00;&#x7BC7;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x6280;&#x672F;&#x8FD0;&#x7528;&#x7684;&#x597D;&#x574F;&#xFF0C;&#x5B8C;&#x5168;&#x53D6;&#x51B3;&#x4E8E;&#x8FD0;&#x7528;&#x6280;&#x672F;&#x7684;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x5173;&#x6CE8;&#x6280;&#x672F;&#x7684;&#x9AD8;&#x4F4E;&#xFF0C;&#x66F4;&#x8981;&#x5173;&#x6CE8;&#x600E;&#x6837;&#x8BA9;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x9AD8;&#x6548;&#x7387;&#x3001;&#x9AD8;&#x6C9F;&#x901A;&#x7387;&#x7684;&#x6267;&#x884C;&#x4E0B;&#x53BB;&#xFF0C;&#x56E0;&#x4E3A;&#x5343;&#x91CC;&#x4E4B;&#x5824;&#xFF0C;&#x6BC1;&#x4E8E;&#x8681;&#x7A74;&#x554A;&#xFF0C;&#x867D;&#x7136;&#x56E2;&#x961F;&#x95F4;&#x6C9F;&#x901A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x770B;&#x4F3C;&#x90FD;&#x662F;&#x4E9B;&#x653F;&#x6CBB;&#x6216;&#x8005;&#x662F;&#x5F62;&#x5F0F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x5360;&#x5230;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x4E2D;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6240;&#x4EE5;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x5728;&#x770B;&#x4E86;&#x4ECA;&#x5929;&#x7684;&#x535A;&#x5BA2;&#x540E;&#x80FD;&#x591F;&#x6709;&#x6240;&#x542F;&#x53D1;&#x5427;&#xFF0C;&#x597D;&#x4E86;&#xFF0C;&#x7761;&#x89C9;&#xFF0C;&#x54C8;&#x54C8;&#xFF01;&#x4ECA;&#x5929;&#x5C45;&#x7136;&#x5199;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3120185261/">EasyAR尝鲜系列教程之Hello EasyAR</a></li><li><a href="https://qinyuanpei.github.io/posts/1156673678/">EasyAR尝鲜系列教程之自定义Marker的实现</a></li><li><a href="https://qinyuanpei.github.io/posts/4088452183/">Unity3D游戏开发之MMD For Unity插件研究</a></li><li><a href="https://blog.yuanpei.me/posts/3120185261/">EasyAR尝鲜系列教程之Hello EasyAR</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1059499448/" rel="external">Unity3D游戏开发之路：一月工作总结</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1059499448/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1059499448/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/工作/">工作</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生活/">生活</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1059499448/&title=《Unity3D游戏开发之路：一月工作总结》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1059499448/&title=《Unity3D游戏开发之路：一月工作总结》 — PayneQinのBlog&source=&emsp;&emsp;不知不觉已经在公司上班一个月了，在这一个月里每一天发生的事情是我平凡而普通的生活。作为一名有节操的程序员，当我大学的同学开始称我为..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1059499448/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《Unity3D游戏开发之路：一月工作总结》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1059499448/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1059499448/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/1320325685/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">Unity3D游戏开发之从Unity3D项目版本控制说起</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/1467630055/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">Unity3D游戏开发之使用AssetBundle和Xml实现场景的动态加载</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1059499448/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1059499448/&title=《Unity3D游戏开发之路：一月工作总结》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1059499448/&title=《Unity3D游戏开发之路：一月工作总结》 — PayneQinのBlog&source=&emsp;&emsp;不知不觉已经在公司上班一个月了，在这一个月里每一天发生的事情是我平凡而普通的生活。作为一名有节操的程序员，当我大学的同学开始称我为..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1059499448/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《Unity3D游戏开发之路：一月工作总结》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1059499448/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1059499448/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1059499448/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
