<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        米花之味：永远相信美好的事情 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x4E00;&amp;#x5982;&amp;#x5F80;&amp;#x5E38;&amp;#x5730;&amp;#x5750;&amp;#x516C;&amp;#x4EA4;&amp;#x56DE;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4E0B;&amp;#x8FC7;&amp;#x4E00;&amp;#x573A;&amp;#x96E8;&amp;#x4EE5;&amp;#x540E;&amp;#xFF0C;&amp;#x5929;&amp;#x7A7A;&amp;#x88AB;&amp;#x6D17;">
<meta name="keywords" content="影评,米花之味,电影">
<meta property="og:type" content="article">
<meta property="og:title" content="米花之味：永远相信美好的事情">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/2941880815/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x4E00;&amp;#x5982;&amp;#x5F80;&amp;#x5E38;&amp;#x5730;&amp;#x5750;&amp;#x516C;&amp;#x4EA4;&amp;#x56DE;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4E0B;&amp;#x8FC7;&amp;#x4E00;&amp;#x573A;&amp;#x96E8;&amp;#x4EE5;&amp;#x540E;&amp;#xFF0C;&amp;#x5929;&amp;#x7A7A;&amp;#x88AB;&amp;#x6D17;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="米花之味：永远相信美好的事情">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x4E00;&amp;#x5982;&amp;#x5F80;&amp;#x5E38;&amp;#x5730;&amp;#x5750;&amp;#x516C;&amp;#x4EA4;&amp;#x56DE;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4E0B;&amp;#x8FC7;&amp;#x4E00;&amp;#x573A;&amp;#x96E8;&amp;#x4EE5;&amp;#x540E;&amp;#xFF0C;&amp;#x5929;&amp;#x7A7A;&amp;#x88AB;&amp;#x6D17;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">米花之味：永远相信美好的事情</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">米花之味：永远相信美好的事情</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-07-02T09:50:17.000Z" itemprop="datePublished" class="page-time">
  2018-07-02
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-米花之味：永远相信美好的事情" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">米花之味：永远相信美好的事情</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-07-02 09:50:17" datetime="2018-07-02T09:50:17.000Z" itemprop="datePublished">2018-07-02</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        16 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x4E00;&#x5982;&#x5F80;&#x5E38;&#x5730;&#x5750;&#x516C;&#x4EA4;&#x56DE;&#x5BB6;&#xFF0C;&#x4E0B;&#x8FC7;&#x4E00;&#x573A;&#x96E8;&#x4EE5;&#x540E;&#xFF0C;&#x5929;&#x7A7A;&#x88AB;&#x6D17;&#x5237;&#x5F97;&#x5E72;&#x5E72;&#x51C0;&#x51C0;&#xFF0C;&#x6D17;&#x53BB;&#x4E86;&#x590F;&#x5929;&#x7684;&#x9A84;&#x9633;&#x4F3C;&#x706B;&#xFF0C;&#x6D17;&#x53BB;&#x4E86;&#x5F52;&#x9014;&#x7684;&#x6708;&#x660E;&#x661F;&#x7A00;&#x3002;&#x62AC;&#x773C;&#x77A5;&#x89C1;&#x5BF9;&#x9762;&#x8F66;&#x7A97;&#xFF0C;&#x4E00;&#x4E2A;&#x88AB;&#x5915;&#x9633;&#x88C1;&#x526A;&#x5F97;&#x6574;&#x9F50;&#x7684;&#x8F6E;&#x5ED3;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x9759;&#x9759;&#x5730;&#x6620;&#x5728;&#x73BB;&#x7483;&#x4E0A;&#xFF0C;&#x4E00;&#x77AC;&#x95F4;&#x6563;&#x53D1;&#x67D0;&#x79CD;&#x795E;&#x5723;&#x7684;&#x6C14;&#x606F;&#x3002;&#x7A81;&#x7136;&#x95F4;&#xFF0C;&#x6211;&#x60F3;&#x5230;&#x4E86;&#x88AB;&#x5632;&#x7B11;&#x4E0D;&#x4F1A;&#x64A9;&#x59B9;&#x7684;X&#x541B;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x81EA;&#x5632;&#x4E0D;&#x4F1A;&#x62D2;&#x7EDD;&#x522B;&#x4EBA;&#x7684;Y&#x541B;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x800C;&#x7231;&#x4E0D;&#x5F97;&#x7684;Z&#x541B;&#x2026;&#x2026;&#x5927;&#x6982;&#x8FD9;&#x4E2A;&#x6A21;&#x7CCA;&#x7684;&#x8F6E;&#x5ED3;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x60F3;&#x8BF4;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4F60;&#x7684;&#x751F;&#x547D;&#x4E5F;&#x8BB8;&#x4ECE;&#x6765;&#x90FD;&#x5E73;&#x6DE1;&#x65E0;&#x5947;&#xFF0C;&#x53EF;&#x56E0;&#x4E3A;&#x8FD9;&#x4E00;&#x573A;&#x79CB;&#x96E8;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x773C;&#x775B;&#x91CC;&#xFF0C;&#x5C31;&#x7A81;&#x7136;&#x5E73;&#x6DFB;&#x65E0;&#x6570;&#x7684;&#x795E;&#x5723;&#x611F;&#x3002;&#x539F;&#x6765;&#x6E29;&#x6696;&#x4ECE;&#x6765;&#x90FD;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x5BFB;&#x627E;&#xFF0C;&#x5373;&#x4F7F;&#x592A;&#x9633;&#x7684;&#x5BFF;&#x547D;&#x610F;&#x5916;&#x7684;&#x6F2B;&#x957F;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x50CF;&#x661F;&#x8FB0;&#x4E00;&#x822C;&#x6619;&#x82B1;&#x4E00;&#x73B0;&#xFF0C;&#x4F60;&#x8089;&#x773C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7684;&#x661F;&#x661F;&#xFF0C;&#x53EF;&#x80FD;&#x4E0B;&#x4E00;&#x79D2;&#x949F;&#x5C31;&#x6D88;&#x901D;&#x4E0D;&#x89C1;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x6BCF;&#x5929;&#x90FD;&#x89C1;&#x5230;&#x7684;&#x5915;&#x9633;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x610F;&#x5916;&#x5730;&#x70B9;&#x7F00;&#x4E9B;&#x91D1;&#x8272;&#x6216;&#x8005;&#x9EC4;&#x8272;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#x5B83;&#x6D51;&#x8EAB;&#x90FD;&#x662F;&#x6E29;&#x6696;&#x7684;&#x529B;&#x91CF;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x90A3;&#x662F;&#x6781;&#x5176;&#x5E73;&#x6DE1;&#x7684;&#x4E00;&#x5929;&#xFF0C;&#x5C31;&#x50CF;&#x7C73;&#x82B1;&#x7684;&#x5473;&#x9053;&#x4E00;&#x6837;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x592A;&#x7279;&#x6B8A;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x53EF;&#x4F60;&#x603B;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5FC3;&#x8DB3;&#x591F;&#x8654;&#x8BDA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x795E;&#x7075;&#x5C31;&#x53EF;&#x4EE5;&#x542C;&#x5230;&#x4F60;&#x7684;&#x5FC3;&#x58F0;&#xFF0C;&#x8BA9;&#x90A3;&#x4E9B;&#x5947;&#x8FF9;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7C73;&#x82B1;&#x4E4B;&#x5473;&#xFF0C;&#x8FD9;&#x90E8;&#x5C0F;&#x6E05;&#x65B0;&#x5F97;&#x4E0D;&#x50CF;&#x56FD;&#x4EA7;&#x7535;&#x5F71;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x5C31;&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x5B83;&#x4E0D;&#x540C;&#x4E8E;&#x4EE5;&#x5F80;&#x56FD;&#x4EA7;&#x7535;&#x5F71;&#x7684;&#x6C14;&#x8D28;&#xFF0C;&#x6BD4;&#x5982;&#x7535;&#x5F71;&#x4E2D;&#x5356;&#x9E21;&#x86CB;&#x7684;&#x5C0F;&#x5973;&#x5B69;&#xFF0C;&#x5728;&#x7535;&#x5F71;&#x4E2D;&#x524D;&#x540E;&#x5171;&#x51FA;&#x73B0;2&#x6B21;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x662F;&#x5973;&#x4E3B;&#x8F9E;&#x6389;&#x57CE;&#x91CC;&#x5DE5;&#x4F5C;&#x56DE;&#x6765;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x662F;&#x5973;&#x4E3B;&#x72EC;&#x81EA;&#x9A71;&#x8F66;&#x524D;&#x5F80;&#x673A;&#x573A;&#x7684;&#x8DEF;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x7B2C;&#x4E00;&#x6B21;&#x662F;&#x5973;&#x4E3B;&#x51FA;&#x4E8E;&#x5584;&#x826F;&#x800C;&#x4E70;&#x5C0F;&#x5973;&#x5B69;&#x7684;&#x9E21;&#x86CB;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x4E8C;&#x6B21;&#x5219;&#x662F;&#x5BF9;&#x5BB6;&#x4E61;&#x73B0;&#x72B6;&#x7684;&#x4E00;&#x79CD;&#x65E0;&#x529B;&#x611F;&#x3002;&#x8FD9;&#x57FA;&#x672C;&#x4E0A;&#x5960;&#x5B9A;&#x4E86;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x6574;&#x4F53;&#x7684;&#x57FA;&#x8C03;&#xFF0C;&#x73B0;&#x5B9E;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x59CB;&#x7EC8;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4F5C;&#x4E3A;&#x77DB;&#x76FE;&#x51B2;&#x7A81;&#x7A7F;&#x63D2;&#x5728;&#x6BCD;&#x5973;&#x4E24;&#x4EBA;&#x4E2D;&#x95F4;&#xFF0C;&#x53EF;&#x5BFC;&#x6F14;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x60F3;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6765;&#x8868;&#x8FBE;&#x4EC0;&#x4E48;&#x89C2;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x9020;&#x6210;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x5355;&#x770B;&#x753B;&#x9762;&#x8D28;&#x611F;&#x662F;&#x975E;&#x5E38;&#x7F8E;&#x7684;&#xFF0C;&#x53EF;&#x6574;&#x90E8;&#x7535;&#x5F71;&#x7684;&#x7ACB;&#x610F;&#x5B9E;&#x5728;&#x4E0D;&#x7B97;&#x592A;&#x9AD8;&#x3002;</p>
<p>&#x2003;&#x2003;&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7535;&#x5F71;&#x91CC;&#x770B;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8DF3;&#x5E7F;&#x573A;&#x821E;&#x5927;&#x5988;&#x7684;&#x4E00;&#x8138;&#x751F;&#x65E0;&#x53EF;&#x604B;&#x3001;&#x6751;&#x91CC;&#x4EBA;&#x5938;&#x5938;&#x5176;&#x8C08;&#x7684;&#x81F4;&#x5BCC;&#x68A6;&#x60F3;&#x3001;&#x8868;&#x9762;&#x5949;&#x627F;&#x80CC;&#x5730;&#x91CC;&#x8BF4;&#x4EBA;&#x957F;&#x77ED;&#x3001;&#x5B66;&#x6821;&#x8001;&#x5E08;&#x4F1A;&#x63A5;&#x53D7;&#x5B66;&#x751F;&#x201C;&#x8D3F;&#x8D42;&#x201D;&#x3001;&#x6CB9;&#x817B;&#x611F;&#x5341;&#x8DB3;&#x7684;&#x65B0;&#x90CE;&#x3001;&#x201C;&#x74DC;&#x5206;&#x201D;&#x52DF;&#x6350;&#x6765;&#x7684;&#x5584;&#x6B3E;&#x3001;&#x641E;&#x5C01;&#x5EFA;&#x8FF7;&#x4FE1;&#x201C;&#x8BF7;&#x795E;&#x201D;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x975E;&#x5E38;&#x771F;&#x5B9E;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x50CF;&#x4E00;&#x5F20;&#x5DE8;&#x5927;&#x7684;&#x7F51;&#x5C06;&#x6BCD;&#x5973;&#x4FE9;&#x88F9;&#x5728;&#x5176;&#x4E2D;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4E24;&#x4E2A;&#x4EBA;&#x7684;&#x77DB;&#x76FE;&#xFF0C;&#x662F;&#x7559;&#x5B88;&#x513F;&#x7AE5;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x5728;&#x6211;&#x7684;&#x7406;&#x89E3;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x73B0;&#x5B9E;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x4E00;&#x79CD;&#x78B0;&#x649E;&#xFF0C;&#x7559;&#x5B88;&#x513F;&#x7AE5;&#x4E0D;&#x518D;&#x662F;&#x5370;&#x8C61;&#x4E2D;&#x5185;&#x5411;&#x95ED;&#x585E;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x800C;&#x6216;&#x8BB8;&#x662F;&#x8DDF;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#xFF0C;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x5403;&#x9E21;&#x201D;&#xFF0C;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x738B;&#x8005;&#x519C;&#x836F;&#x201D;&#xFF0C;&#x5C0F;&#x9547;&#x6751;&#x6C11;&#x4E0D;&#x518D;&#x662F;&#x5370;&#x8C61;&#x4E2D;&#x5584;&#x826F;&#x6DF3;&#x6734;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x800C;&#x6216;&#x8BB8;&#x662F;&#x77E5;&#x9053;&#x751F;&#x75C5;&#x4E86;&#x5E94;&#x8BE5;&#x53BB;&#x533B;&#x9662;&#xFF0C;&#x4F46;&#x201C;&#x558A;&#x9B42;&#x201D;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x540C;&#x6837;&#x9700;&#x8981;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x52DF;&#x6350;&#x6765;&#x7684;&#x94B1;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4E2A;&#x4EBA;&#x8FD8;&#x662F;&#x96C6;&#x4F53;&#xFF0C;&#x90FD;&#x5E0C;&#x671B;&#x80FD;&#x5206;&#x4E00;&#x70B9;&#x513F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F71;&#x7247;&#x4E2D;&#x5583;&#x676D;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x5583;&#x6E58;&#x9732;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x9519;&#x8FC7;&#x6700;&#x4F73;&#x6CBB;&#x7597;&#x65F6;&#x673A;&#x800C;&#x6B7B;&#xFF0C;&#x800C;&#x7B2C;&#x4E00;&#x4E2A;&#x9001;&#x5B69;&#x5B50;&#x53BB;&#x533B;&#x9662;&#x7684;&#x4EBA;&#xFF0C;&#x6070;&#x6070;&#x662F;&#x5979;&#x4EEC;&#x4E0D;&#x5927;&#x559C;&#x6B22;&#x7684;&#x8001;&#x5E08;&#xFF0C;&#x5927;&#x4EBA;&#x4EEC;&#x8BF4;&#x8981;&#x7B49;&#x673A;&#x573A;&#x4FEE;&#x597D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5750;&#x98DE;&#x673A;&#x53BB;&#x5916;&#x9762;&#x6CBB;&#x75C5;&#xFF0C;&#x63A5;&#x8FD1;&#x5C3E;&#x58F0;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x770B;&#x5230;&#x5934;&#x9876;&#x547C;&#x5578;&#x800C;&#x8FC7;&#x7684;&#x98DE;&#x673A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4F1A;&#x4E0D;&#x4F1A;&#x60F3;&#x8D77;&#x5583;&#x6E58;&#x9732;&#x8FD9;&#x4E2A;&#x5B69;&#x5B50;&#x3002;&#x6BCD;&#x5973;&#x4FE9;&#x5B8C;&#x6210;&#x548C;&#x89E3;&#x662F;&#x56E0;&#x4E3A;&#x5583;&#x6E58;&#x9732;&#x7684;&#x6B7B;&#x4EA1;&#xFF0C;&#x501F;&#x5583;&#x676D;&#x7684;&#x8BDD;&#x8BF4;&#xFF0C;&#x201C;&#x5979;&#x4E0D;&#x76F8;&#x4FE1;&#x5583;&#x6E58;&#x9732;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;&#xFF0C;&#x751A;&#x81F3;&#x90FD;&#x611F;&#x89C9;&#x4E0D;&#x5230;&#x60B2;&#x4F24;&#x201D;&#xFF0C;&#x53EF;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x5973;&#x4E3B;&#x5C31;&#x544A;&#x8BC9;&#x5973;&#x513F;&#xFF0C;&#x4EE5;&#x540E;&#x4E0D;&#x8981;&#x548C;&#x5583;&#x6E58;&#x9732;&#x4E00;&#x8D77;&#x73A9;&#x513F;&#x3002;&#x201C;&#x8BF7;&#x795E;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x4EEC;&#x8BF4;&#x5DF2;&#x7ECF;&#x6709;5&#x5E74;&#x6CA1;&#x6709;&#x53BB;&#x796D;&#x62DC;&#x8FC7;&#x77F3;&#x4F5B;&#x5566;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x796D;&#x62DC;&#x77F3;&#x4F5B;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x4EBA;&#x4EEC;&#x76F8;&#x4FE1;&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4EE5;&#x540E;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x9EBB;&#x70E6;&#x51FA;&#x73B0;&#xFF0C;&#x53EF;&#x5F53;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x88AB;&#x5F00;&#x53D1;&#x4E3A;&#x65C5;&#x6E38;&#x666F;&#x70B9;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x5F80;&#x6240;&#x73CD;&#x89C6;&#x7684;&#x90A3;&#x4E9B;&#x4F20;&#x7EDF;&#xFF0C;&#x7A76;&#x7ADF;&#x662F;&#x5426;&#x80FD;&#x5728;&#x73B0;&#x4EE3;&#x6587;&#x660E;&#x7684;&#x6D17;&#x793C;&#x4E0B;&#x4FDD;&#x5B58;&#x5B8C;&#x6574;&#xFF1F;</p>
<p>&#x2003;&#x2003;&#x6751;&#x6C11;&#x7A7F;&#x6234;&#x7740;&#x4F20;&#x7EDF;&#x7684;&#x6C11;&#x65CF;&#x670D;&#x9970;&#xFF0C;&#x643A;&#x5E26;&#x7740;&#x4F9B;&#x5949;&#x795E;&#x7075;&#x7684;&#x7269;&#x54C1;&#xFF0C;&#x4E00;&#x8D77;&#x5230;&#x5C71;&#x91CC;&#x796D;&#x62DC;&#x77F3;&#x4F5B;&#xFF0C;&#x53EF;&#x95E8;&#x53E3;&#x60AC;&#x6302;&#x7740;&#x7684;&#x201C;Closed&#x201D;&#x7684;&#x6728;&#x724C;&#xFF0C;&#x8FDE;&#x540C;&#x5C06;&#x6751;&#x6C11;&#x9694;&#x7EDD;&#x5728;&#x5916;&#x7684;&#x90A3;&#x628A;&#x94C1;&#x9501;&#xFF0C;&#x53C8;&#x4EFF;&#x4F5B;&#x5C06;&#x6545;&#x4E8B;&#x5E26;&#x5165;&#x4E86;&#x540E;&#x73B0;&#x4EE3;&#x4E3B;&#x4E49;&#x7684;&#x80E1;&#x540C;&#x3002;&#x5982;&#x679C;&#x77F3;&#x4F5B;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x5E87;&#x4F51;&#x4E00;&#x65B9;&#x9ECE;&#x6C11;&#xFF0C;&#x4E3A;&#x4F55;&#x4F1A;&#x88AB;&#x65C5;&#x6E38;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x4E00;&#x9053;&#x94C1;&#x95E8;&#x62E6;&#x622A;&#xFF1F;&#x5982;&#x679C;&#x77F3;&#x4F5B;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;&#x4EBA;&#x4EEC;&#x7684;&#x8654;&#x8BDA;&#xFF0C;&#x4E3A;&#x4F55;&#x4E00;&#x5B9A;&#x8981;&#x5230;&#x5C71;&#x6797;&#x6DF1;&#x5904;&#x53BB;&#x671D;&#x5723;&#x796D;&#x62DC;&#xFF1F;&#x5C31;&#x50CF;&#x5583;&#x676D;&#x95EE;&#x5979;&#x6BCD;&#x4EB2;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x7ED9;&#x795E;&#x8DF3;&#x821E;&#xFF0C;&#x795E;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x77E5;&#x9053;&#x5417;&#xFF1F;&#x201D;&#xFF0C;&#x5973;&#x4E3B;&#x56DE;&#x7B54;&#x8BF4;&#xFF0C;&#x201C;&#x53EA;&#x8981;&#x4F60;&#x7684;&#x5FC3;&#x8DB3;&#x591F;&#x8654;&#x8BDA;&#xFF0C;&#x795E;&#x5C31;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5F97;&#x5230;&#x201D;&#x3002;&#x8FD9;&#x6070;&#x6070;&#x5370;&#x8BC1;&#x4E86;&#x8001;&#x8D3A;&#x7684;&#x4E3E;&#x52A8;&#xFF0C;&#x4E00;&#x884C;&#x4EBA;&#x88AB;&#x666F;&#x533A;&#x524D;&#x7684;&#x4E00;&#x9053;&#x94C1;&#x95E8;&#x7ED9;&#x62E6;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x6B63;&#x6697;&#x81EA;&#x6CAE;&#x4E27;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8001;&#x8D3A;&#x8BF4;&#xFF0C;&#x201C;&#x65E2;&#x7136;&#x6765;&#x90FD;&#x6765;&#x4E86;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x54EA;&#x91CC;&#x8DF3;&#x821E;&#xFF0C;&#x4F5B;&#x90FD;&#x4F1A;&#x770B;&#x89C1;&#x7684;&#x201D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x751F;&#x6D3B;&#x672C;&#x8EAB;&#x800C;&#x8A00;&#xFF0C;&#x9E21;&#x6C64;&#x56FA;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5B9E;&#x9645;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x53EF;&#x4EBA;&#x4EEC;&#x5F80;&#x5F80;&#x53C8;&#x9700;&#x8981;&#x9E21;&#x6C64;&#xFF0C;&#x56E0;&#x4E3A;&#x5FC3;&#x91CC;&#x7F3A;&#x5C11;&#x4E86;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x88AB;&#x5176;&#x5B83;&#x7684;&#x4E1C;&#x897F;&#x586B;&#x6EE1;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x6211;&#x4EEC;&#x90FD;&#x53EB;&#x505A;&#x5B83;&#x4FE1;&#x4EF0;&#x3002;&#x4F60;&#x603B;&#x8981;&#x8BD5;&#x7740;&#x53BB;&#x76F8;&#x4FE1;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x552F;&#x7269;&#x7684;&#x8FD8;&#x662F;&#x552F;&#x5FC3;&#x7684;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x4F1A;&#x7126;&#x8651;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7D22;&#x53D6;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x591A;&#x3002;&#x5176;&#x5B9E;&#x751F;&#x547D;&#x91CC;&#x5C11;&#x4E86;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x53C8;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x4F60;&#x7FA1;&#x6155;&#x522B;&#x4EBA;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x90FD;&#x6709;&#x4EBA;&#x966A;&#x4F34;&#xFF0C;&#x53EF;&#x5F53;&#x4F60;&#x5C1D;&#x8BD5;&#x53BB;&#x548C;&#x522B;&#x4EBA;&#x4E00;&#x8D77;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5373;&#x4F7F;&#x770B;&#x7535;&#x5F71;&#x8FD9;&#x6837;&#x4E00;&#x4EF6;&#x5C0F;&#x4E8B;&#xFF0C;&#x90FD;&#x4F1A;&#x5B58;&#x5728;&#x5343;&#x5DEE;&#x4E07;&#x522B;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x559C;&#x6B22;&#x770B;&#x597D;&#x83B1;&#x575E;&#x89C6;&#x89C9;&#x5927;&#x7247;&#xFF0C;&#x800C;&#x6211;&#x559C;&#x6B22;&#x770B;&#x65E5;&#x5F0F;&#x7530;&#x56ED;&#x5C0F;&#x6E05;&#x65B0;&#xFF0C;&#x771F;&#x8981;&#x627E;&#x4E00;&#x90E8;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x559C;&#x6B22;&#x770B;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x5F15;&#x53D1;&#x6211;&#x7684;&#x9009;&#x62E9;&#x56F0;&#x96BE;&#x75C7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5206;&#x4E0D;&#x6E05;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x559C;&#x6B22;Ta&#x8FD8;&#x662F;&#x559C;&#x6B22;Ta&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x5206;&#x5F00;&#x4EE5;&#x540E;&#x7684;&#x60C5;&#x4FA3;&#xFF0C;&#x67D0;&#x4E00;&#x5929;&#x610F;&#x5916;&#x5730;&#x91CD;&#x9022;&#xFF0C;&#x4F60;&#x8BF4;&#x7740;&#x5BF9;&#x65B9;&#x90A3;&#x65F6;&#x8FD9;&#x6837;&#x6216;&#x90A3;&#x6837;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x800C;&#x5BF9;&#x65B9;&#x82E6;&#x7B11;&#x7740;&#x8BF4;&#x65E9;&#x5C31;&#x4E0D;&#x559C;&#x6B22;&#x90A3;&#x6837;&#x5B50;&#x5566;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x5F00;&#x59CB;&#x6000;&#x7591;&#xFF0C;&#x5BF9;&#x65B9;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x559C;&#x6B22;&#x8FD9;&#x4E9B;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x5B58;&#x5728;&#x2026;&#x2026;&#x5583;&#x676D;&#x6253;&#x4F24;&#x4E86;&#x5927;&#x5634;&#xFF0C;&#x5C31;&#x5728;&#x8001;&#x5E08;&#x966A;&#x7740;&#x5927;&#x5634;&#x5728;&#x533B;&#x9662;&#x63A5;&#x53D7;&#x6CBB;&#x7597;&#x7684;&#x95F4;&#x9699;&#xFF0C;&#x5979;&#x5BF9;&#x6BCD;&#x4EB2;&#x6492;&#x8C0E;&#x8BF4;&#xFF0C;&#x201C;&#x8001;&#x5E08;&#x5DF2;&#x7ECF;&#x548C;&#x5927;&#x5634;&#x56DE;&#x53BB;&#x4E86;&#x201D;&#x2026;&#x2026;&#x7136;&#x540E;&#x5C31;&#x662F;&#x6BCD;&#x5973;&#x4E24;&#x4EBA;&#x7684;&#x51B2;&#x7A81;&#x7206;&#x53D1;&#xFF0C;&#x5468;&#x56F4;&#x4EBA;&#x7684;&#x98CE;&#x8A00;&#x98CE;&#x8BED;&#xFF0C;&#x6BCD;&#x4EB2;&#x5BF9;&#x5973;&#x513F;&#x5B66;&#x4E60;&#x3001;&#x751F;&#x6D3B;&#x4E0A;&#x7684;&#x79CD;&#x79CD;&#x4E0D;&#x6EE1;&#xFF0C;&#x5973;&#x513F;&#x5BF9;&#x6BCD;&#x4EB2;&#x7684;&#x90A3;&#x79CD;&#x758F;&#x79BB;&#x611F;&#xFF0C;&#x76F8;&#x4E92;&#x7EA0;&#x7F20;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5583;&#x6E58;&#x9732;&#x5E73;&#x65F6;&#x90FD;&#x89C1;&#x4E0D;&#x5230;&#x7236;&#x6BCD;&#xFF0C;&#x751A;&#x81F3;&#x5F00;&#x73A9;&#x7B11;&#x5730;&#x8BF4;&#xFF0C;&#x7B49;&#x5230;&#x751F;&#x4E00;&#x573A;&#x5927;&#x75C5;&#x770B;&#x4ED6;&#x4EEC;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x53EF;&#x5979;&#x4F9D;&#x7136;&#x76F8;&#x4FE1;&#xFF0C;&#x6CA1;&#x6709;&#x6BCD;&#x4EB2;&#x4F1A;&#x4E0D;&#x7231;&#x81EA;&#x5DF1;&#x7684;&#x5B69;&#x5B50;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6700;&#x4EE4;&#x6211;&#x52A8;&#x5BB9;&#x7684;&#x662F;&#xFF0C;&#x5583;&#x676D;&#x8BF4;&#x8981;&#x7ED9;&#x5979;&#x53D8;&#x4E00;&#x4E2A;&#x9B54;&#x672F;&#xFF0C;&#x7136;&#x540E;&#x5583;&#x6E58;&#x9732;&#x5C31;&#x89C1;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7236;&#x6BCD;&#xFF0C;&#x4E09;&#x4E2A;&#x4EBA;&#xFF0C;&#x516D;&#x53EA;&#x773C;&#x775B;&#xFF0C;&#x6709;&#x60CA;&#x5F02;&#x3001;&#x6709;&#x8F9B;&#x9178;&#xFF0C;&#x970E;&#x65F6;&#x4E4B;&#x95F4;&#x5168;&#x90E8;&#x6D8C;&#x4E0A;&#x5FC3;&#x5934;&#x3002;&#x201C;&#x795E;&#x5A46;&#x201D;&#x8BF4;&#x7C73;&#x82B1;&#x7C73;&#x9152;&#x90FD;&#x53D8;&#x5473;&#x4E86;&#x4E0D;&#x597D;&#x5403;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7F3A;&#x5C11;&#x4E86;&#x90A3;&#x79CD;&#x7B80;&#x5355;&#x548C;&#x7EAF;&#x7CB9;&#xFF0C;&#x6BCD;&#x5973;&#x4FE9;&#x4E00;&#x8D77;&#x70B8;&#x7C73;&#x82B1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E2D;&#x95F4;&#x5973;&#x4E3B;&#x88AB;&#x53EB;&#x53BB;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5583;&#x676D;&#x70B8;&#x7684;&#x7C73;&#x82B1;&#x5728;&#x7FFB;&#x52A8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECE;&#x4E2D;&#x95F4;&#x7834;&#x788E;&#x6210;&#x4E24;&#x534A;&#xFF0C;&#x6216;&#x8BB8;&#x4EBA;&#x7684;&#x5FC3;&#x539F;&#x672C;&#x5982;&#x6B64;&#xFF0C;&#x5F53;&#x6709;&#x4E86;&#x9694;&#x9602;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x518D;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x4F1A;&#x505A;&#x4E0D;&#x597D;&#x3002;&#x8001;&#x4EBA;&#x8BF4;&#x5C71;&#x91CC;&#x4E0D;&#x8BB8;&#x5973;&#x4EBA;&#x8FDB;&#x53BB;&#xFF0C;&#x6BCD;&#x5973;&#x4FE9;&#x7EC8;&#x4E8E;&#x51B3;&#x5B9A;&#x4EB2;&#x81EA;&#x8D70;&#x8FDB;&#x6D1E;&#x91CC;&#x53BB;&#xFF0C;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#xFF0C;&#x795E;&#x5723;&#x65E0;&#x6BD4;&#x7684;&#x77F3;&#x4F5B;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5BFB;&#x5E38;&#x65E0;&#x6BD4;&#x7684;&#x949F;&#x4E73;&#x77F3;&#x6D1E;&#x91CC;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x6E05;&#x8106;&#x65E0;&#x6BD4;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6E38;&#x5BA2;&#x968F;&#x624B;&#x4E22;&#x5F03;&#x5728;&#x5730;&#x4E0A;&#x7684;&#x6613;&#x62C9;&#x7F50;&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x5FC3;&#x4E2D;&#x53BB;&#x656C;&#x754F;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x662F;&#x6C38;&#x8FDC;&#x88AB;&#x8868;&#x8C61;&#x8FF7;&#x60D1;&#x800C;&#x4E14;&#x4E0D;&#x6562;&#x6709;&#x6240;&#x6000;&#x7591;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x4FE1;&#x79D1;&#x5B66;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x540C;&#x6837;&#x656C;&#x754F;&#x4E00;&#x5207;&#x8D85;&#x8D8A;&#x4EBA;&#x529B;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x4E91;&#x5357;&#x7684;&#x5973;&#x5B69;&#x5B50;&#x90FD;&#x4F1A;&#x8DF3;&#x821E;&#xFF0C;&#x6BD4;&#x5982;&#x66FE;&#x7ECF;&#x8868;&#x6F14;&#x8FC7;&#x5343;&#x624B;&#x89C2;&#x97F3;&#x7684;&#x6768;&#x4E3D;&#x840D;&#x8001;&#x5E08;&#x5C31;&#x6765;&#x81EA;&#x4E91;&#x5357;&#xFF0C;&#x5F20;&#x5927;&#x80E1;&#x5B50;&#x751A;&#x81F3;&#x4E3A;&#x4E86;&#x627E;&#x4E00;&#x53CC;&#x597D;&#x770B;&#x7684;&#x624B;&#xFF0C;&#x800C;&#x8BA9;&#x5979;&#x51FA;&#x6F14;&#x4E86;&#x53F2;&#x4E0A;&#x6700;&#x7F8E;&#x7684;&#x6885;&#x8D85;&#x98CE;&#xFF0C;&#x4E8E;&#x662F;&#x4F5B;&#x50CF;&#x524D;&#x7684;&#x4E00;&#x6BB5;&#x821E;&#x8E48;&#xFF0C;&#x6210;&#x4E3A;&#x4E86;&#x4E0D;&#x4E9A;&#x4E8E;&#x4F55;&#x5C0F;&#x840D;&#x64CD;&#x573A;&#x72EC;&#x821E;&#x7684;&#x60CA;&#x9E3F;&#x4E00;&#x77A5;&#xFF0C;&#x5047;&#x5982;&#x771F;&#x7684;&#x6709;&#x6765;&#x751F;&#xFF0C;&#x5C31;&#x7948;&#x7977;&#x5583;&#x6E58;&#x9732;&#x51FA;&#x751F;&#x5728;&#x4E00;&#x4E2A;&#x5BCC;&#x8DB3;&#x7684;&#x5BB6;&#x5EAD;&#x91CC;&#x5427;&#xFF01;&#x4F60;&#x95EE;&#x795E;&#x771F;&#x7684;&#x4F1A;&#x7075;&#x9A8C;&#x5417;&#xFF1F;&#x4E0D;&#xFF0C;&#x4E0D;&#x8981;&#x53BB;&#x95EE;&#x795E;&#xFF0C;&#x800C;&#x662F;&#x53BB;&#x95EE;&#x4F60;&#x81EA;&#x5DF1;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x5FC3;&#x8BDA;&#x5219;&#x7075;&#x201D;&#xFF0C;&#x76F8;&#x4FE1;&#x4E00;&#x5207;&#x7F8E;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;All is well&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2613006280/">一念执着，千山无阻</a></li><li><a href="https://qinyuanpei.github.io/posts/2462008667/">关于电影《暗杀》背后的故事和想法</a></li><li><a href="https://qinyuanpei.github.io/posts/1933583281/">愿你和我一样喜欢蛋炒饭</a></li><li><a href="http://www.davidfnck.com/talkshow/no_surprise_in_the_end.html/">预告片好过正片的电影</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/2941880815/" rel="external">米花之味：永远相信美好的事情</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/2941880815/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/2941880815/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/影评/">影评</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/电影/">电影</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/米花之味/">米花之味</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2941880815/&title=《米花之味：永远相信美好的事情》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2941880815/&title=《米花之味：永远相信美好的事情》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2941880815/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《米花之味：永远相信美好的事情》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2941880815/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2941880815/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/380519286/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">声明式RESTful客户端WebApiClient在项目中的应用</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3995512051/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">基于Docker构建.NET持续集成环境</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/2941880815/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/2941880815/&title=《米花之味：永远相信美好的事情》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/2941880815/&title=《米花之味：永远相信美好的事情》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/2941880815/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《米花之味：永远相信美好的事情》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/2941880815/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/2941880815/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/2941880815/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
