<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        罗马数字与阿拉伯数字的相互转换 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x9047;&amp;#x5230;&amp;#x4E00;&amp;#x9053;&amp;#x975E;&amp;#x5E38;&amp;#x6709;&amp;#x8DA3;&amp;#x7684;&amp;#x9898;&amp;#x76EE;&amp;#xFF0C;&amp;#x9898;&amp;#x76EE;&amp;#x5927;&amp;#x610F;&amp;#x5982;&amp;#x4E0B;&amp;#xFF1A;&amp;#x6709;&amp;#x4E00;">
<meta name="keywords" content="数学,算法,数字">
<meta property="og:type" content="article">
<meta property="og:title" content="罗马数字与阿拉伯数字的相互转换">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/4158690468/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x9047;&amp;#x5230;&amp;#x4E00;&amp;#x9053;&amp;#x975E;&amp;#x5E38;&amp;#x6709;&amp;#x8DA3;&amp;#x7684;&amp;#x9898;&amp;#x76EE;&amp;#xFF0C;&amp;#x9898;&amp;#x76EE;&amp;#x5927;&amp;#x610F;&amp;#x5982;&amp;#x4E0B;&amp;#xFF1A;&amp;#x6709;&amp;#x4E00;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.524Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="罗马数字与阿拉伯数字的相互转换">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x6700;&amp;#x8FD1;&amp;#x9047;&amp;#x5230;&amp;#x4E00;&amp;#x9053;&amp;#x975E;&amp;#x5E38;&amp;#x6709;&amp;#x8DA3;&amp;#x7684;&amp;#x9898;&amp;#x76EE;&amp;#xFF0C;&amp;#x9898;&amp;#x76EE;&amp;#x5927;&amp;#x610F;&amp;#x5982;&amp;#x4E0B;&amp;#xFF1A;&amp;#x6709;&amp;#x4E00;">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">罗马数字与阿拉伯数字的相互转换</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">罗马数字与阿拉伯数字的相互转换</h1>
        <h5 class="subtitle">
            
                <time datetime="2018-04-30T10:59:46.000Z" itemprop="datePublished" class="page-time">
  2018-04-30
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/编程语言/">编程语言</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#罗马数字起源"><span class="post-toc-number">1.</span> <span class="post-toc-text">罗马数字起源</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#数字转换实现"><span class="post-toc-number">2.</span> <span class="post-toc-text">数字转换实现</span></a><ol class="post-toc-child"><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#阿拉伯转罗马"><span class="post-toc-number">2.1.</span> <span class="post-toc-text">阿拉伯转罗马</span></a></li><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#罗马转阿拉伯"><span class="post-toc-number">2.2.</span> <span class="post-toc-text">罗马转阿拉伯</span></a></li></ol></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#为什么会溢出"><span class="post-toc-number">3.</span> <span class="post-toc-text">为什么会溢出</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#选择阿拉伯数字"><span class="post-toc-number">4.</span> <span class="post-toc-text">选择阿拉伯数字</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#本文小结"><span class="post-toc-number">5.</span> <span class="post-toc-text">本文小结</span></a></li><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">6.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-罗马数字与阿拉伯数字的相互转换" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">罗马数字与阿拉伯数字的相互转换</h1>
        <div class="post-meta">
            <time class="post-time" title="2018-04-30 10:59:46" datetime="2018-04-30T10:59:46.000Z" itemprop="datePublished">2018-04-30</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/编程语言/">编程语言</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        30 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x9047;&#x5230;&#x4E00;&#x9053;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x9898;&#x76EE;&#x5927;&#x610F;&#x5982;&#x4E0B;&#xFF1A;&#x6709;&#x4E00;&#x4E2A;&#x5BCC;&#x7FC1;&#x5728;&#x94F6;&#x6CB3;&#x7CFB;&#x91CC;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x800C;&#x94F6;&#x6CB3;&#x7CFB;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7CBE;&#x660E;&#x80FD;&#x5E72;&#x7684;&#x52A9;&#x624B;&#xFF0C;&#x5E2E;&#x52A9;&#x4ED6;&#x5B8C;&#x6210;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x4E0E;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x7684;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#xFF0C;&#x9898;&#x76EE;&#x5728;&#x8FD9;&#x4E2A;&#x80CC;&#x666F;&#x4E0B;&#x884D;&#x751F;&#x51FA;&#x4EA4;&#x6613;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5E2E;&#x52A9;&#x4ED6;&#x8BA1;&#x7B97;&#x51FA;&#x76F8;&#x5173;&#x5546;&#x54C1;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x9053;&#x9898;&#x76EE;&#xFF0C;&#x5982;&#x679C;&#x5265;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x672C;&#x8EAB;&#x7684;&#x4EA4;&#x6613;&#x573A;&#x666F;&#xFF0C;&#x8FD9;&#x9053;&#x9898;&#x76EE;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7EAF;&#x7CB9;&#x7684;&#x7B97;&#x6CD5;&#x95EE;&#x9898;&#x3002;&#x8BF4;&#x6765;&#x60ED;&#x6127;&#xFF0C;&#x535A;&#x4E3B;&#x5F53;&#x65F6;&#x5E76;&#x672A;&#x80FD;&#x5FEB;&#x901F;&#x5730;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E8B;&#x540E;&#x901A;&#x8FC7;&#x7814;&#x8BFB;&#x522B;&#x4EBA;&#x7684;&#x6587;&#x7AE0;&#x59CB;&#x80FD;&#x6709;&#x6240;&#x9886;&#x609F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4ECA;&#x5929;&#x60F3;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#xFF0C;&#x540C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x6765;&#x8BA8;&#x8BBA;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x5728;&#x4F7F;&#x7528;0&#x5230;9&#x8FD9;10&#x4E2A;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;&#x6BD4;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x65E9;2000&#x5E74;&#x7684;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x6D41;&#x4F20;&#x4E0B;&#x6765;&#x4E3A;&#x540E;&#x4E16;&#x6240;&#x7528;&#x5462;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x610F;&#x601D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x5B66;&#x540C;&#x8BA1;&#x7B97;&#x673A;&#x5B66;&#x79D1;&#x95F4;&#x90A3;&#x79CD;&#x5343;&#x4E1D;&#x4E07;&#x7F15;&#x7684;&#x8054;&#x7CFB;&#x3001;&#x6280;&#x672F;&#x6F14;&#x8FDB;&#x8FC7;&#x7A0B;&#x4E2D;&#x82E5;&#x6709;&#x82E5;&#x65E0;&#x7684;&#x67D0;&#x79CD;&#x5FC5;&#x7136;&#x6027;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4EE4;&#x6211;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x6709;&#x610F;&#x601D;&#x7684;&#x5730;&#x65B9;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x597D;&#xFF1F;</p>
<h1 id="&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8D77;&#x6E90;"><a href="#&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8D77;&#x6E90;" class="headerlink" title="&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8D77;&#x6E90;"></a>&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8D77;&#x6E90;</h1><p>&#x2003;&#x2003;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x53E4;&#x7F57;&#x9A6C;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x4E2D;&#xFF0C;&#x5171;&#x6709;7&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x5B57;&#xFF0C;&#x5373;I&#x3001;V&#x3001;X&#x3001;L&#x3001;C&#x3001;D&#x3001;M&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x8868;&#x793A;1&#x3001;5&#x3001;10&#x3001;50&#x3001;100&#x3001;500&#x3001;1000&#x3002;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5728;&#x8FD9;&#x5957;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;0&#x4E0D;&#x88AB;&#x89C6;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x3002;&#x636E;&#x8BF4;&#xFF0C;&#x66FE;&#x7ECF;&#x6709;&#x4E00;&#x4F4D;&#x7F57;&#x9A6C;&#x5B66;&#x8005;&#x4E0D;&#x987E;&#x6559;&#x7687;&#x7684;&#x53CD;&#x5BF9;&#xFF0C;&#x6267;&#x610F;&#x5C06;&#x4E0E;0&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x4EE5;&#x53CA;0&#x5728;&#x8FD0;&#x7B97;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x5411;&#x6C11;&#x4F17;&#x4F20;&#x64AD;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x6559;&#x7687;&#x56DA;&#x7981;&#x5E76;&#x6295;&#x5165;&#x76D1;&#x72F1;&#xFF0C;&#x7406;&#x7531;&#x662F;0&#x662F;&#x4E00;&#x4E2A;&#x90AA;&#x7269;&#xFF0C;&#x7834;&#x574F;&#x4E86;&#x795E;&#x5723;&#x7684;&#x6570;&#x3002;&#x540C;&#x6837;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x65E0;&#x6CD5;&#x8868;&#x793A;&#x5C0F;&#x6570;(<strong>&#x6CE8;&#xFF1A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6709;&#x5206;&#x6570;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EC5;&#x4EC5;&#x80FD;&#x8868;&#x793A;1/12&#x7684;&#x6574;&#x6570;&#x500D;</strong>)&#xFF0C;&#x56E0;&#x6B64;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x5E38;&#x5E38;&#x7528;&#x6765;&#x8868;&#x793A;&#x7EAA;&#x5E74;&#xFF0C;&#x5728;&#x6B27;&#x6D32;&#x56FD;&#x5BB6;&#x7684;&#x53E4;&#x4E66;&#x7C4D;&#x3001;&#x5EFA;&#x7B51;&#x548C;&#x949F;&#x8868;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x89C1;&#x5230;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x8EAB;&#x5F71;&#x3002;&#x6211;&#x4EEC;&#x719F;&#x6089;&#x7684;&#x5143;&#x7D20;&#x5468;&#x671F;&#x8868;&#xFF0C;&#x540C;&#x6837;&#x91C7;&#x7528;&#x4E86;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6765;&#x8868;&#x793A;&#x5143;&#x7D20;&#x6240;&#x5728;&#x7684;&#x201D;&#x65CF;&#x201D;&#x3002;&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x662F;&#x4E00;&#x79CD;&#x8BA1;&#x6570;&#x89C4;&#x5219;&#xFF0C;&#x800C;&#x975E;&#x8BA1;&#x7B97;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x8005;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x662F;&#x6CA1;&#x6709;&#x8FDB;&#x4F4D;&#x548C;&#x6743;&#x91CD;&#x7684;&#x6982;&#x5FF5;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x53EA;&#x7528;&#x4EE5;&#x8BA1;&#x6570;&#x800C;&#x4E0D;&#x7528;&#x4EE5;&#x6F14;&#x7B97;&#x3002;</p>
<p>&#x2003;&#x2003;&#x65E2;&#x7136;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x662F;&#x4E00;&#x79CD;&#x8BA1;&#x6570;&#x89C4;&#x5219;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x4E00;&#x8BF4;&#x5B83;&#x7684;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#xFF0C;&#x56E0;&#x4E3A;4000&#x4EE5;&#x5185;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;7&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x5B57;&#x7EC4;&#x5408;&#x8868;&#x793A;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x57FA;&#x672C;&#x89C4;&#x5219;&#x6709;&#x4EE5;&#x4E0B;4&#x6761;&#xFF1A;</p>
<ul>
<li>&#x91CD;&#x590D;&#x6B21;&#x6570;&#xFF1A;<strong>&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x91CD;&#x590D;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x6240;&#x8868;&#x793A;&#x7684;&#x6570;&#x5B57;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x591A;&#x5C11;&#x500D;&#xFF1B;&#x4E00;&#x4E2A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6700;&#x591A;&#x91CD;&#x590D;&#x4E09;&#x6B21;&#x3002;</strong>&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x8BE5;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;I&#x3001;II&#x3001;III&#x5206;&#x522B;&#x8868;&#x793A;1&#x3001;2&#x3001;3&#xFF1B;&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;4&#x5FC5;&#x987B;&#x88AB;&#x8868;&#x793A;&#x4E3A;IV&#xFF0C;&#x800C;&#x4E0D;&#x662F;IIII&#x3002;&#x5173;&#x4E8E;4&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x4E89;&#x8BAE;&#xFF0C;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#x8BA4;&#x4E3A;IIII&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x5360;&#x7528;&#x4E66;&#x5199;&#x7A7A;&#x95F4;&#xFF0C;IV&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x7B80;&#x5316;&#x4E66;&#x5199;&#x7684;&#x4F5C;&#x7528;&#xFF1B;&#x800C;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#x5219;&#x8BA4;&#x4E3A;IV&#x6709;&#x4EB5;&#x6E0E;&#x795E;&#x7075;&#x6731;&#x5E87;&#x7279;&#x3001;&#x542B;&#x4E0D;&#x656C;&#x4FAE;&#x8FB1;&#x4E4B;&#x610F;&#x3002;</li>
<li>&#x5DE6;&#x51CF;&#x539F;&#x5219;&#xFF1A;<strong>&#x5F53;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#x88AB;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x6570;&#x5B57;&#x7684;&#x5DE6;&#x8FB9;&#x65F6;&#xFF0C;&#x6240;&#x8868;&#x793A;&#x7684;&#x6570;&#x5B57;&#x7B49;&#x4E8E;&#x8FD9;&#x4E2A;&#x5927;&#x6570;&#x51CF;&#x53BB;&#x8FD9;&#x4E2A;&#x5C0F;&#x6570;&#xFF0C;&#x4E14;&#x5DE6;&#x8FB9;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x653E;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x5B57;</strong>&#x3002;&#x8054;&#x7CFB;&#x7B2C;&#x4E00;&#x6761;&#x539F;&#x5219;&#xFF0C;IV&#x8868;&#x793A;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x662F;V-I&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x8868;&#x793A;4&#xFF1B;&#x540C;&#x7406;&#xFF0C;9&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E00;&#x6761;&#x539F;&#x5219;&#xFF0C;&#x5FC5;&#x987B;&#x88AB;&#x8868;&#x793A;&#x6210;IX&#x3002;</li>
<li>&#x53F3;&#x52A0;&#x539F;&#x5219;&#xFF1A;<strong>&#x5F53;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#x88AB;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x6570;&#x5B57;&#x7684;&#x53F3;&#x8FB9;&#x65F6;&#xFF0C;&#x6240;&#x8868;&#x793A;&#x7684;&#x6570;&#x5B57;&#x7B49;&#x4E8E;&#x8FD9;&#x4E2A;&#x5927;&#x6570;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x5C0F;&#x6570;&#xFF0C;&#x4E14;&#x53F3;&#x8FB9;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x653E;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x5B57;</strong>&#x3002;&#x8FD9;&#x4E00;&#x6761;&#x539F;&#x5219;&#x548C;&#x7B2C;&#x4E8C;&#x6761;&#x539F;&#x5219;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x4F8B;&#x5982;11&#x4F1A;&#x88AB;&#x8868;&#x793A;&#x6210;XI&#x3001;21&#x4F1A;&#x88AB;&#x8868;&#x793A;&#x4E3A;XXI&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</li>
<li>&#x642D;&#x914D;&#x539F;&#x5219;&#xFF1A;<strong>I&#x53EA;&#x80FD;&#x88AB;&#x653E;&#x5728;V&#x548C;X&#x7684;&#x5DE6;&#x8FB9;&#xFF1B;X&#x53EA;&#x80FD;&#x88AB;&#x653E;&#x5728;L&#x548C;C&#x7684;&#x5DE6;&#x8FB9;&#xFF1B;C&#x53EA;&#x80FD;&#x88AB;&#x653E;&#x5728;D&#x548C;M&#x7684;&#x5DE6;&#x8FB9;&#xFF1B;V&#x3001;L&#x3001;D&#x4E0D;&#x80FD;&#x88AB;&#x653E;&#x5728;&#x5DE6;&#x8FB9;</strong>&#x3002;&#x8FD9;&#x4E00;&#x6761;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x5BF9;&#x662F;&#x7B2C;&#x4E8C;&#x6761;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x8BF4;&#x7684;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x597D;&#x4E86;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7EC4;&#x5408;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x5448;&#x73B0;&#x51FA;1&#x3001;4&#x3001;5&#x3001;9&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x4EC0;&#x4E48;&#x662F;1&#x3001;4&#x3001;5&#x3001;9&#x7684;&#x89C4;&#x5F8B;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;4&#x548C;9&#x662F;&#x4E24;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x6570;&#x5B57;&#xFF0C;4&#x5FC5;&#x987B;&#x901A;&#x8FC7;5&#x5DE6;&#x51CF;&#x6765;&#x5F97;&#x5230;&#xFF0C;9&#x5FC5;&#x987B;&#x901A;&#x8FC7;10&#x5DE6;&#x51CF;&#x6765;&#x5F97;&#x5230;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8981;&#x6EE1;&#x8DB3;&#x6700;&#x591A;&#x91CD;&#x590D;&#x4E09;&#x6B21;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x800C;4&#x548C;9&#x76F8;&#x5BF9;1&#x548C;5&#x7684;&#x504F;&#x79FB;&#x91CF;&#x6070;&#x597D;&#x662F;4&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x548C;&#x5176;&#x4ED6;&#x6570;&#x5B57;&#x4E0D;&#x540C;&#x3002;&#x56E0;&#x4E3A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6CA1;&#x6709;&#x8FDB;&#x4F4D;&#x548C;&#x6743;&#x91CD;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6240;&#x4EE5;&#x9664;&#x4E86;&#x5DE6;&#x51CF;&#x548C;&#x53F3;&#x589E;&#x8FD9;&#x4E24;&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4EE5;&#x5916;&#xFF0C;&#x5B83;&#x7684;&#x57FA;&#x672C;&#x6570;&#x5B57;&#x5E94;&#x8BE5;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x4F9D;&#x6B21;&#x9012;&#x51CF;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5DE6;&#x51CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5DE6;&#x8FB9;&#x7684;&#x6570;&#x5B57;&#x5E94;&#x8BE5;&#x548C;&#x53F3;&#x8FB9;&#x7684;&#x6570;&#x5B57;&#x5904;&#x5728;&#x540C;&#x4E00;&#x5E8F;&#x5217;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x4F8B;&#x5982;&#xFF0C;90&#x5FC5;&#x987B;&#x7528;100-10&#x6765;&#x8868;&#x793A;&#xFF1B;&#x800C;99&#x5FC5;&#x987B;&#x62C6;&#x89E3;&#x4E3A;90&#x548C;9&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x7528;100-10&#x548C;10-1&#x6765;&#x8868;&#x793A;&#xFF0C;&#x552F;&#x72EC;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;100-1&#x6765;&#x8868;&#x793A;&#xFF0C;&#x56E0;&#x4E3A;100&#x548C;1&#x5206;&#x5C5E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5E8F;&#x5217;&#x3002;</p>
<h1 id="&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x5B9E;&#x73B0;"><a href="#&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x5B9E;&#x73B0;" class="headerlink" title="&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x5B9E;&#x73B0;"></a>&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x5B9E;&#x73B0;</h1><p>&#x2003;&#x2003;&#x4E86;&#x89E3;&#x5B8C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x5386;&#x53F2;&#x6E0A;&#x6E90;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5BF9;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x73B0;&#x5728;&#x6765;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x548C;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#x3002;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x786E;&#x662F;&#x53E4;&#x7F57;&#x9A6C;&#x4EBA;&#x53D1;&#x660E;&#x7684;&#xFF0C;&#x53EF;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x5B9E;&#x9645;&#x4E0A;&#x5374;&#x662F;&#x53E4;&#x5370;&#x5EA6;&#x4EBA;&#x53D1;&#x660E;&#x7684;&#x3002;&#x4ECA;&#x5929;&#x5168;&#x4E16;&#x754C;&#x4EBA;&#x90FD;&#x5728;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E24;&#x8005;&#x95F4;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x4E00;&#x5F00;&#x59CB;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5047;&#x5982;&#x94F6;&#x6CB3;&#x7CFB;&#x91CC;&#x7684;&#x4EBA;&#x4EEC;&#x90FD;&#x4F7F;&#x7528;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6765;&#x8BA1;&#x6570;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5730;&#x7403;&#x4E0A;&#x7684;&#x5BCC;&#x7FC1;&#x6765;&#x5230;&#x94F6;&#x6CB3;&#x7CFB;&#x4EE5;&#x540E;&#xFF0C;&#x4ED6;&#x8981;&#x5982;&#x4F55;&#x53BB;&#x548C;&#x8FD9;&#x91CC;&#x7684;&#x4EBA;&#x4EEC;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x8F6C;&#x6362;&#x5E94;&#x8BE5;&#x662F;&#x53CC;&#x5411;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x9762;&#x5206;&#x522B;&#x6765;&#x770B;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x76F8;&#x5E94;&#x7684;&#x8F6C;&#x6362;&#x3002;</p>
<h2 id="&#x963F;&#x62C9;&#x4F2F;&#x8F6C;&#x7F57;&#x9A6C;"><a href="#&#x963F;&#x62C9;&#x4F2F;&#x8F6C;&#x7F57;&#x9A6C;" class="headerlink" title="&#x963F;&#x62C9;&#x4F2F;&#x8F6C;&#x7F57;&#x9A6C;"></a>&#x963F;&#x62C9;&#x4F2F;&#x8F6C;&#x7F57;&#x9A6C;</h2><p>&#x2003;&#x2003;&#x9996;&#x5148;&#x6765;&#x8003;&#x8651;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x8F6C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x5FC5;&#x7136;&#x662F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x4F9D;&#x6B21;&#x9012;&#x51CF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x8FD9;7&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x5B57;&#x4ECE;&#x5927;&#x5230;&#x5C0F;&#x6392;&#x5217;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x4E0D;&#x5C0F;&#x4E8E;&#x6307;&#x5B9A;&#x6570;&#x5B57;&#x7684;&#x6570;&#x4F4D;&#x5373;&#x53EF;&#x3002;&#x4F8B;&#x5982;1024&#x663E;&#x7136;&#x8D85;&#x8FC7;&#x4E86;1000&#xFF0C;&#x800C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x4E2D;&#x7684;1000&#x5BF9;&#x5E94;M&#xFF0C;&#x56E0;&#x6B64;1024&#x7684;&#x7B2C;&#x4E00;&#x4F4D;&#x5E94;&#x8BE5;&#x662F;M&#x3002;&#x63A5;&#x4E0B;&#x6765;24&#xFF0C;&#x663E;&#x7136;&#x8D85;&#x8FC7;10&#xFF0C;&#x56E0;&#x6B64;1024&#x7684;&#x7B2C;&#x4E8C;&#x4F4D;&#x6570;&#x5B57;&#x5E94;&#x8BE5;&#x662F;X&#x3002;&#x63A5;&#x4E0B;&#x6765;14&#xFF0C;&#x663E;&#x7136;&#x8D85;&#x8FC7;10&#xFF0C;&#x56E0;&#x6B64;1024&#x7684;&#x7B2C;&#x4E09;&#x4F4D;&#x6570;&#x5B57;&#x540C;&#x6837;&#x662F;X&#x3002;&#x63A5;&#x4E0B;&#x6765;4&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x9700;&#x8981;&#x88AB;&#x8868;&#x793A;&#x4E3A;IV&#xFF0C;&#x8FD9;&#x662F;1024&#x7684;&#x7B2C;&#x56DB;&#x4F4D;&#x6570;&#x5B57;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;1024&#x7684;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x5F62;&#x5F0F;MXXIV&#x3002;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;4&#x548C;9&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x4F5C;&#x4E3A;&#x8F85;&#x52A9;&#x6570;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;1&#x5230;3&#x3001;6&#x5230;8&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x5730;&#x91CD;&#x590D;1&#x6765;&#x5F97;&#x5230;&#xFF0C;&#x5C31;&#x50CF;&#x8F97;&#x8F6C;&#x76F8;&#x9664;&#x6CD5;&#x4E00;&#x6837;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FD9;&#x4E24;&#x4E2A;&#x8F85;&#x52A9;&#x6570;&#x5B57;&#x4F1A;&#x600E;&#x6837;&#x5462;&#xFF1F;4&#x4F1A;&#x53D8;&#x6210;IIII&#xFF0C;&#x800C;9&#x4F1A;&#x53D8;&#x6210;VIIII&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x9884;&#x671F;&#x7684;&#x3002;&#x6574;&#x7406;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;<br></p><figure class="highlight typescript"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span> <span class="keyword">static</span> <span class="built_in">string</span> ConvertToRoman(int <span class="built_in">number</span>)</span><br><span class="line">{</span><br><span class="line">    <span class="keyword">var</span> output = <span class="keyword">new</span> StringBuilder();</span><br><span class="line">    <span class="keyword">var</span> digitMap = <span class="keyword">new</span> Dictionary&lt;int,<span class="built_in">string</span>&gt;()</span><br><span class="line">    {</span><br><span class="line">      {<span class="number">1</span>,<span class="string">&quot;I&quot;</span>},{<span class="number">4</span>,<span class="string">&quot;IV&quot;</span>},{<span class="number">5</span>,<span class="string">&quot;V&quot;</span>},{<span class="number">9</span>,<span class="string">&quot;IX&quot;</span>},</span><br><span class="line">      {<span class="number">10</span>,<span class="string">&quot;X&quot;</span>},{<span class="number">40</span>,<span class="string">&quot;XL&quot;</span>},{<span class="number">50</span>,<span class="string">&quot;L&quot;</span>},{<span class="number">90</span>,<span class="string">&quot;XC&quot;</span>},</span><br><span class="line">      {<span class="number">100</span>,<span class="string">&quot;C&quot;</span>},{<span class="number">400</span>,<span class="string">&quot;CD&quot;</span>},{<span class="number">500</span>,<span class="string">&quot;D&quot;</span>},{<span class="number">900</span>,<span class="string">&quot;CM&quot;</span>},</span><br><span class="line">      {<span class="number">1000</span>,<span class="string">&quot;M&quot;</span>}</span><br><span class="line">    };</span><br><span class="line">    <span class="keyword">var</span> digits = digitMap.OrderByDescending(<span class="function"><span class="params">e</span> =&gt;</span> e.Key).ToList();</span><br><span class="line"></span><br><span class="line">    <span class="keyword">for</span> (int i = <span class="number">0</span>; i &lt; digits.Count &amp;&amp; <span class="built_in">number</span> &gt; <span class="number">0</span>; i++)</span><br><span class="line">    {</span><br><span class="line">        <span class="keyword">if</span> (<span class="built_in">number</span> &lt; digits[i].Key) <span class="keyword">continue</span>;</span><br><span class="line">        <span class="keyword">while</span> (<span class="built_in">number</span> &gt;= digits[i].Key)</span><br><span class="line">        {</span><br><span class="line">            <span class="built_in">number</span> -= digits[i].Key;</span><br><span class="line">            output.Append(digits[i].Value);</span><br><span class="line">        }</span><br><span class="line">    }</span><br><span class="line"></span><br><span class="line">    <span class="keyword">return</span> output.ToString();</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<h2 id="&#x7F57;&#x9A6C;&#x8F6C;&#x963F;&#x62C9;&#x4F2F;"><a href="#&#x7F57;&#x9A6C;&#x8F6C;&#x963F;&#x62C9;&#x4F2F;" class="headerlink" title="&#x7F57;&#x9A6C;&#x8F6C;&#x963F;&#x62C9;&#x4F2F;"></a>&#x7F57;&#x9A6C;&#x8F6C;&#x963F;&#x62C9;&#x4F2F;</h2><p>&#x2003;&#x2003;&#x63A5;&#x4E0B;&#x6765;&#x8003;&#x8651;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x5982;&#x4F55;&#x8F6C;&#x6362;&#x4E3A;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x660E;&#x786E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x4F9D;&#x6B21;&#x9012;&#x51CF;&#x6392;&#x5217;&#x7684;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x5DE6;&#x4FA7;&#x548C;&#x53F3;&#x4FA7;&#x51FA;&#x73B0;&#x7684;&#x6570;&#x5B57;&#x4E00;&#x5B9A;&#x5904;&#x4E8E;&#x5F53;&#x524D;&#x6570;&#x5B57;&#x7684;&#x540C;&#x4E00;&#x5E8F;&#x5217;&#x3002;&#x6BD4;&#x5982;&#xFF0C;I&#x53EA;&#x80FD;&#x88AB;&#x653E;&#x5728;V&#x548C;X&#x7684;&#x5DE6;&#x8FB9;&#xFF1B;X&#x53EA;&#x80FD;&#x88AB;&#x653E;&#x5728;L&#x548C;C&#x7684;&#x5DE6;&#x8FB9;&#xFF1B;C&#x53EA;&#x80FD;&#x88AB;&#x653E;&#x5728;D&#x548C;M&#x7684;&#x5DE6;&#x8FB9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x4F9D;&#x6B21;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x8F6C;&#x5316;&#x4E3A;&#x5BF9;&#x5E94;&#x7684;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x7136;&#x540E;&#x7D2F;&#x52A0;&#x5373;&#x53EF;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x5C0F;&#x4E8E;&#x4E0B;&#x4E00;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x4E3A;&#x8D1F;&#x6570;&#xFF1B;&#x5F53;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x5927;&#x4E8E;&#x4E0B;&#x4E00;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x4E3A;&#x6B63;&#x6570;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x91CC;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x5E94;&#x8BE5;&#x662F;&#x6B63;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;&#x4E0B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x3002;&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x68B3;&#x7406;&#x51FA;&#x6574;&#x4E2A;&#x601D;&#x8DEF;&#xFF1A;&#x4ECE;&#x7B2C;&#x4E00;&#x4F4D;&#x5230;&#x7B2C;n-1&#x4F4D;&#x4F9D;&#x6B21;&#x5FAA;&#x73AF;&#xFF0C;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x6B63;&#x8D1F;&#x7136;&#x540E;&#x7D2F;&#x52A0;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x5143;&#x7D20;&#x7684;&#x503C;&#x5373;&#x53EF;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF1A;<br></p><figure class="highlight cs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">public</span> <span class="keyword">static</span> <span class="keyword">int</span> <span class="title">ConvertToNumber</span>(<span class="params"><span class="keyword">string</span> romanNumber</span>)</span></span><br><span class="line"><span class="function"></span>{</span><br><span class="line">    <span class="keyword">var</span> number = <span class="number">0</span>;</span><br><span class="line">    <span class="keyword">var</span> length = romanNumber.Length;</span><br><span class="line">    <span class="keyword">var</span> digits = <span class="keyword">new</span> Dictionary&lt;<span class="keyword">string</span>,<span class="keyword">int</span>&gt;()</span><br><span class="line">    {</span><br><span class="line">      {<span class="string">&quot;I&quot;</span>,<span class="number">1</span>},{<span class="string">&quot;V&quot;</span>,<span class="number">5</span>},{<span class="string">&quot;X&quot;</span>,<span class="number">10</span>},{<span class="string">&quot;L&quot;</span>,<span class="number">50</span>},{<span class="string">&quot;C&quot;</span>,<span class="number">100</span>},{<span class="string">&quot;D&quot;</span>,<span class="number">500</span>},{<span class="string">&quot;M&quot;</span>,<span class="number">1000</span>}</span><br><span class="line">    };</span><br><span class="line"></span><br><span class="line">    <span class="keyword">for</span> (<span class="keyword">int</span> i = <span class="number">0</span>; i &lt; length - <span class="number">1</span>; i++)</span><br><span class="line">    {</span><br><span class="line">        <span class="comment">//&#x524D;&#x9762; n-1 &#x4F4D;&#x6570;&#x5B57;&#x901A;&#x8FC7;&#x5DE6;&#x53F3;&#x6BD4;&#x8F83;&#x51B3;&#x5B9A;&#x6B63;&#x8D1F; &amp; &#x7B2C; n &#x4F4D;&#x6570;&#x5B57;&#x5FC5;&#x7136;&#x4E3A;&#x6B63;</span></span><br><span class="line">        <span class="keyword">if</span> ((digits[romanNumber[i].ToString()] &gt;= digits[romanNumber[i + <span class="number">1</span>].ToString()]) || i + <span class="number">1</span> &gt;= length)</span><br><span class="line">        {</span><br><span class="line">            number += digits[romanNumber[i].ToString()];</span><br><span class="line">        }</span><br><span class="line">        <span class="keyword">else</span></span><br><span class="line">        {</span><br><span class="line">            number -= digits[romanNumber[i].ToString()];</span><br><span class="line">        }</span><br><span class="line">    }</span><br><span class="line">    <span class="keyword">return</span> number;</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<h1 id="&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6EA2;&#x51FA;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6EA2;&#x51FA;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6EA2;&#x51FA;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6EA2;&#x51FA;</h1><p>&#x2003;&#x2003;&#x76F8;&#x4FE1;&#x4E0A;&#x9762;&#x8FD9;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5DF2;&#x7136;&#x628A;&#x73A9;&#x8FC7;&#x4E86;&#x3002;&#x53EF;&#x6211;&#x4EEC;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF0C;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x4E8B;&#x513F;&#x4E0D;&#x9760;&#x8C31;&#x3002;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x7F51;&#x7EDC;&#x4E0A;&#x4E00;&#x76F4;&#x6D41;&#x4F20;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x4F5B;&#x7CFB;&#x9752;&#x5E74;&#x6B63;&#x5728;&#x88AB;&#x540C;&#x9F84;&#x4EBA;&#x629B;&#x5F03;&#x3002;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x91CC;&#x6211;&#x4EEC;&#x6240;&#x9762;&#x5BF9;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x4E00;&#x4E2A;&#x6765;&#x81EA;&#x5730;&#x7403;&#x7684;&#x7684;&#x5BCC;&#x7FC1;&#x554A;&#xFF01;&#x5BCC;&#x7FC1;&#x7684;&#x94B1;&#x4E0D;&#x90FD;&#x662F;&#x6309;&#x4EBF;&#x6765;&#x8BA1;&#x6570;&#x7684;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBF;&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x76EE;&#x6807;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6708;&#x5165;5&#x4E07;&#x554A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x4E0A;&#x6D41;&#x884C;&#x7684;&#x8BF4;&#x6CD5;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x4E2D;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8F93;&#x5165;50000&#x8FD9;&#x4E2A;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;&#x5B83;&#x4F1A;&#x8F93;&#x51FA;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;50&#x4E2A;M&#xFF0C;&#x8FD9;&#x5F88;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x554A;&#xFF0C;&#x5F53;&#x7136;&#x66F4;&#x795E;&#x5947;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x628A;&#x8FD9;&#x7531;50&#x4E2A;M&#x7EC4;&#x6210;&#x7684;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x4E3A;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x4E0D;&#x80FD;&#x50CF;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x5730;&#x8F93;&#x51FA;50000&#xFF0C;&#x800C;&#x4F1A;&#x53D8;&#x6210;&#x662F;&#x4E00;&#x4E2A;&#x8D1F;&#x6570;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x91CC;&#x662F;&#x8D1F;&#x6570;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x6EA2;&#x51FA;&#x5566;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x8FC7;&#x53BB;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x542C;&#x5230;&#x201D;&#x6EA2;&#x51FA;&#x201C;&#x8FD9;&#x4E2A;&#x8BCD;&#x513F;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x53D1;&#x751F;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x636E;&#x8D85;&#x8FC7;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7684;&#x8868;&#x793A;&#x8303;&#x56F4;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#xFF0C;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7C97;&#x6D45;&#x7684;&#x8BA4;&#x8BC6;&#x662F;&#xFF0C;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x5DF2;&#x7ECF;&#x5927;&#x5230;&#x975E;&#x5E38;&#x5BA2;&#x89C2;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x4EEC;&#x7684;&#x786C;&#x76D8;&#x90FD;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;TB&#x8FD9;&#x6837;&#x7684;&#x5BB9;&#x91CF;&#x5355;&#x4F4D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x662F;&#x4F1A;&#x53D1;&#x751F;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x5462;&#xFF1F;&#x56DE;&#x5230;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6B8B;&#x9177;&#x7684;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x53E4;&#x7F57;&#x9A6C;&#x4EBA;&#x5E76;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;1000&#x4EE5;&#x4E0A;&#x7684;&#x6570;&#x5B57;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x548C;&#x53E4;&#x7F57;&#x9A6C;&#x4EBA;&#x53D1;&#x660E;&#x6570;&#x5B57;&#x7684;&#x8FC7;&#x7A0B;&#x6709;&#x5173;&#x3002;&#x53E4;&#x4EBA;&#x6700;&#x65E9;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x624B;&#x6307;&#x3001;&#x7EF3;&#x7ED3;&#x3001;&#x7AF9;&#x7B79;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x8BA1;&#x6570;&#xFF0C;&#x5728;&#x4EBA;&#x4EEC;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x5230;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x6570;&#x5B57;&#x4EE5;&#x524D;&#xFF0C;&#x4EBA;&#x4EEC;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E9B;&#x6570;&#x7684;&#x8868;&#x793A;&#x662F;&#x8DB3;&#x591F;&#x7684;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7ECF;&#x5386;&#x4E86;&#x4ECE;8&#x4F4D;&#x3001;16&#x4F4D;&#x3001;32&#x4F4D;&#x5230;64&#x4F4D;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x662F;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x65B9;&#x6848;&#x52BF;&#x5FC5;&#x8981;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x6F14;&#x5316;&#x800C;&#x6269;&#x5C55;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x66FE;&#x63D0;&#x5230;&#xFF0C;&#x8FD9;7&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x8868;&#x793A;4000&#x4EE5;&#x5185;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;4000&#x4EE5;&#x5185;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6839;&#x636E;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6700;&#x591A;&#x91CD;&#x590D;&#x4E09;&#x6B21;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7528;5000-1000&#x6765;&#x8868;&#x793A;4000&#xFF0C;&#x53EF;&#x95EE;&#x9898;&#x662F;&#x8FD9;7&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x5B57;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;5000&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x662F;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x90FD;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x73B0;&#x6709;&#x7684;&#x6784;&#x9020;&#x53BB;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x548C;&#x6570;&#x5B66;&#x4E0A;&#x7684;&#x90A3;&#x4E9B;&#x201D;&#x6269;&#x5145;&#x201C;&#x6709;&#x7740;&#x6781;&#x5176;&#x76F8;&#x4F3C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x6240;&#x6709;&#x7684;&#x6570;&#x4E0D;&#x90FD;&#x662F;&#x6574;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x5206;&#x6570;/&#x5C0F;&#x6570;&#xFF1B;&#x5F53;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x6240;&#x6709;&#x7684;&#x6570;&#x4E0D;&#x90FD;&#x662F;&#x6709;&#x7406;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x65E0;&#x7406;&#x6570;&#xFF1B; &#x5F53;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x6240;&#x6709;&#x7684;&#x6570;&#x4E0D;&#x90FD;&#x662F;&#x5B9E;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x865A;&#x6570;&#x3002;&#x5728;&#x6570;&#x5B66;&#x4E0A;&#xFF0C;&#x8FD9;&#x53EB;&#x505A;&#x6570;&#x7684;&#x6269;&#x5145;&#xFF1B;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x91CC;&#xFF0C;&#x8FD9;&#x53EB;&#x505A;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x3002;&#x6570;&#x5B66;&#x4F5C;&#x4E3A;&#x4E00;&#x672C;&#x5B66;&#x79D1;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B8C;&#x5584;&#x7406;&#x8BBA;&#x6765;&#x81EA;&#x5706;&#x5176;&#x8BF4;&#xFF1B;&#x800C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CC;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x4E00;&#x5957;&#x89C4;&#x8303;&#xFF0C;&#x5B83;&#x65E0;&#x6CD5;&#x66F4;&#x4E0D;&#x5E94;&#x8BE5;&#x7ECF;&#x5E38;&#x53BB;&#x4FEE;&#x6539;&#xFF0C;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x53BB;&#x89E3;&#x51B3;&#x7A0B;&#x5E8F;&#x4E2D;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x5DF2;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x53E4;&#x7F57;&#x9A6C;&#x4EBA;&#x662F;&#x600E;&#x4E48;&#x505A;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;&#x806A;&#x660E;&#x7684;&#x7F57;&#x9A6C;&#x4EBA;&#x81EA;&#x7136;&#x60F3;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4EEC;&#x63D0;&#x51FA;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x4E0A;&#x9762;&#x52A0;&#x4E00;&#x6761;&#x6A2A;&#x7EBF;&#xFF0C;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x6570;&#x589E;&#x503C;1000&#x500D;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;4000&#x5E94;&#x8BE5;&#x7531;IV&#x53D8;&#x5316;&#x800C;&#x6765;&#xFF0C;9000&#x5E94;&#x8BE5;&#x7531;10000&#x53D8;&#x5316;&#x800C;&#x6765;&#xFF0C;&#x800C;10000&#x5219;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;10&#x7684;1000&#x500D;&#xFF0C;&#x5373;10000&#x5E94;&#x8BE5;&#x7531;X&#x53D8;&#x5316;&#x800C;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x6700;&#x521D;&#x7684;&#x89C4;&#x5219;&#x4E2D;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x8BF4;&#x8FD9;&#x4E00;&#x6761;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5728;&#x6570;&#x5B57;&#x4E0A;&#x9762;&#x589E;&#x52A0;&#x4E00;&#x6761;&#x6A2A;&#x7EBF;&#xFF0C;&#x8FD9;&#x66F4;&#x63A5;&#x8FD1;&#x4E00;&#x4E2A;&#x4E66;&#x5199;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5B83;&#x589E;&#x52A0;&#x4E86;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x89E3;&#x6790;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x4E0A;&#x9762;&#x51FA;&#x73B0;&#x6A2A;&#x7EBF;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x6309;&#x7167;&#x539F;&#x6765;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x8F6C;&#x6362;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD8;&#x662F;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x95EE;&#x9898;&#x672C;&#x8EAB;&#xFF0C;&#x8FD9;&#x9053;&#x9898;&#x76EE;&#x4E2D;&#x540C;&#x6837;&#x56DE;&#x907F;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7F57;&#x9A6C;&#x4EBA;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x786E;&#x5F88;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x773C;&#x4E0B;&#x6211;&#x4EEC;&#x6240;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x65F6;&#x95F4;&#x4E45;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x7F57;&#x9A6C;&#x4EBA;&#x53D1;&#x73B0;&#x8FD9;&#x5957;&#x8BA1;&#x6570;&#x89C4;&#x5219;&#x4E66;&#x5199;&#x4E86;&#x7E41;&#x7410;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x800C;&#x8FD9;&#x5957;&#x89C4;&#x5219;&#x6E10;&#x6E10;&#x5730;&#x5C31;&#x88AB;&#x4EBA;&#x4EEC;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x5728;2015&#x5E74;&#x610F;&#x5927;&#x5229;&#x5B98;&#x65B9;&#x5BA3;&#x5E03;&#xFF0C;&#x56FD;&#x5185;&#x8857;&#x9053;&#x7F16;&#x7801;&#x3001;&#x6587;&#x4EF6;&#x7F16;&#x7801;&#x7B49;&#x5168;&#x90E8;&#x5E9F;&#x5F03;&#x539F;&#x6709;&#x7684;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#xFF0C;&#x6539;&#x4E3A;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x3002;</p>
<h1 id="&#x9009;&#x62E9;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;"><a href="#&#x9009;&#x62E9;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;" class="headerlink" title="&#x9009;&#x62E9;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;"></a>&#x9009;&#x62E9;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;</h1><p>&#x2003;&#x2003;&#x5386;&#x53F2;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5DE7;&#x5408;&#xFF0C;&#x5C3D;&#x7BA1;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8981;&#x6BD4;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x65E9;2000&#x5E74;&#x3002;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x7F3A;&#x9677;&#x4E0D;&#x4EC5;&#x4EC5;&#x5728;&#x4E8E;&#x5176;&#x4E66;&#x5199;&#x7684;&#x7E41;&#x6742;&#xFF0C;&#x4E00;&#x4E2A;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x63A8;&#x52A8;&#x6570;&#x5B66;&#x5B66;&#x79D1;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x7F57;&#x9A6C;&#x4EBA;&#x53D1;&#x660E;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8BA1;&#x6570;&#xFF0C;&#x53EF;&#x4E00;&#x65E6;&#x4EA7;&#x751F;&#x4E86;&#x6570;&#xFF0C;&#x5C31;&#x52BF;&#x5FC5;&#x4F1A;&#x4EA7;&#x751F;&#x8BA1;&#x7B97;&#x3002;&#x53EF;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x8BA1;&#x7B97;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5BF9;&#x6570;&#x5B57;&#x7684;&#x6784;&#x9020;&#x5E76;&#x4E0D;&#x662F;&#x6B63;&#x4EA4;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x6700;&#x4E3A;&#x76F4;&#x89C2;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x6570;&#x5B57;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x3001;&#x4E24;&#x4E2A;&#x5B57;&#x6BCD;&#x6216;&#x8005;&#x4E09;&#x4E2A;&#x5B57;&#x6BCD;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x8981;&#x8FDB;&#x884C;&#x52A0;&#x51CF;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x7684;&#x6570;&#x5B57;&#x662F;&#x65E0;&#x6CD5;&#x201D;&#x5BF9;&#x9F50;&#x201C;&#x7684;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#x5730;&#x5206;&#x6E05;&#x695A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x4F4D;&#xFF0C;&#x800C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6070;&#x597D;&#x662F;&#x6CA1;&#x6709;&#x6570;&#x4F4D;&#x7684;&#x6982;&#x5FF5;&#x7684;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x6570;&#x5B57;&#x52A0;&#x51CF;&#x65F6;&#x4F1A;&#x4EA7;&#x751F;&#x8FDB;&#x4F4D;&#x6216;&#x8005;&#x501F;&#x4F4D;&#xFF0C;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x6784;&#x9020;&#x4F1A;&#x5BFC;&#x81F4;&#x7275;&#x4E00;&#x53D1;&#x800C;&#x52A8;&#x5168;&#x8EAB;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x6B65;&#x9AA4;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x5C06;&#x6574;&#x4E2A;&#x7ED3;&#x679C;&#x91CD;&#x5199;&#x3002;&#x53CD;&#x89C2;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;0&#x5230;9&#x5171;10&#x4E2A;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E00;&#x5207;&#xFF0C;&#x5F62;&#x5F0F;&#x4E0A;&#x7684;&#x7EDF;&#x4E00;&#x8BA9;&#x8BA1;&#x7B97;&#x66F4;&#x52A0;&#x4FBF;&#x6377;&#xFF0C;&#x4E66;&#x5199;&#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#xFF0C;&#x8FD9;&#x5957;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x65E0;&#x9650;&#x5927;&#x7684;&#x6570;&#x4E0A;&#x9762;&#x53BB;&#xFF0C;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x5C0F;&#x6570;&#x3001;&#x5206;&#x6570;&#x751A;&#x81F3;&#x65E0;&#x7406;&#x6570;&#x3001;&#x865A;&#x6570;&#x3002;&#x8FD9;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x5316;&#x7684;&#x5B9A;&#x4E49;&#x6216;&#x8005;&#x6784;&#x9020;&#xFF0C;&#x66F4;&#x9002;&#x5408;&#x53BB;&#x505A;&#x76F8;&#x5173;&#x7684;&#x8FD0;&#x7B97;&#x6D41;&#x7A0B;&#x6216;&#x8005;&#x903B;&#x8F91;&#x6D41;&#x7A0B;&#x5462;&#xFF1F;</p>
<h1 id="&#x672C;&#x6587;&#x5C0F;&#x7ED3;"><a href="#&#x672C;&#x6587;&#x5C0F;&#x7ED3;" class="headerlink" title="&#x672C;&#x6587;&#x5C0F;&#x7ED3;"></a>&#x672C;&#x6587;&#x5C0F;&#x7ED3;</h1><p>&#x2003;&#x2003;&#x672C;&#x6587;&#x4ECE;&#x4E00;&#x9053;&#x6709;&#x8DA3;&#x7684;&#x9898;&#x76EE;&#x4F5C;&#x4E3A;&#x5F15;&#x5B50;&#xFF0C;&#x5F15;&#x51FA;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x4E3B;&#x9898;&#xFF1A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4E3A;&#x5927;&#x5BB6;&#x56DE;&#x987E;&#x4E86;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7684;&#x5386;&#x53F2;&#x6E0A;&#x6E90;&#x3002;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x53E4;&#x7F57;&#x9A6C;&#x4EBA;&#x521B;&#x9020;&#x7684;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x5957;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x4E3B;&#x8981;&#x7684;&#x7528;&#x9014;&#x662F;&#x8FDB;&#x884C;&#x8BA1;&#x6570;&#x3002;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x7531;I&#x3001;V&#x3001;X&#x3001;L&#x3001;C&#x3001;D&#x3001;M&#x5171;7&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x5176;&#x57FA;&#x672C;&#x89C4;&#x5219;&#x662F;&#x6700;&#x591A;&#x91CD;&#x590D;&#x4E09;&#x6B21;&#x3001;&#x5DE6;&#x51CF;&#x53F3;&#x589E;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x4E86;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x4E0E;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x5F53;&#x524D;&#x65B9;&#x6848;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x51FA;&#x4E86;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x4E2D;&#x7684;&#x201D;4000&#x201C;&#x95EE;&#x9898;&#xFF0C;&#x8054;&#x7CFB;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6EA2;&#x51FA;&#x7684;&#x76F8;&#x5173;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x5F53;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x8D85;&#x8FC7;4000&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x201D;&#x6EA2;&#x51FA;&#x201C;&#xFF0C;&#x4EE5;&#x53CA;&#x7F57;&#x9A6C;&#x4EBA;&#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x3002;&#x867D;&#x7136;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6BD4;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x65E9;2000&#x5E74;&#xFF0C;&#x53EF;&#x5386;&#x53F2;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7B80;&#x8981;&#x5730;&#x5206;&#x6790;&#x4E86;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x8BA1;&#x7B97;&#xFF0C;&#x800C;&#x6570;&#x5B57;&#x4F5C;&#x4E3A;&#x6570;&#x5B66;&#x7684;&#x57FA;&#x672C;&#x8981;&#x7D20;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x88AB;&#x8FD0;&#x7528;&#x5230;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#xFF0C;&#x6700;&#x7EC8;&#x514D;&#x9664;&#x4E0D;&#x4E86;&#x88AB;&#x4EBA;&#x4EEC;&#x629B;&#x5F03;&#x7684;&#x547D;&#x8FD0;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x4E94;&#x4E00;&#x8282;&#x524D;&#x7684;&#x6587;&#x7AE0; &#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5566;&#xFF0C;4&#x6708;&#x518D;&#x89C1;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/2186770732/">贝塞尔曲线学习笔记</a></li><li><a href="https://qinyuanpei.github.io/posts/2752169106/">写给永远单纯的自己</a></li><li><a href="https://qinyuanpei.github.io/posts/3247186509/">一个关于概率的问题的思考</a></li><li><a href="https://zymin.cn/arcticle/matlab-symbol-toolbox.html">Matlab符号工具箱</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/4158690468/" rel="external">罗马数字与阿拉伯数字的相互转换</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/4158690468/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/4158690468/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/数字/">数字</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/数学/">数学</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/算法/">算法</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/4158690468/&title=《罗马数字与阿拉伯数字的相互转换》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/4158690468/&title=《罗马数字与阿拉伯数字的相互转换》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/4158690468/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《罗马数字与阿拉伯数字的相互转换》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/4158690468/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/4158690468/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/4891372/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">使用SonarCloud为.NET/.NET Core项目集成静态检查</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/3668933172/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">邂逅AOP：说说JavaScript中的修饰器</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/4158690468/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/4158690468/&title=《罗马数字与阿拉伯数字的相互转换》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/4158690468/&title=《罗马数字与阿拉伯数字的相互转换》 — PayneQinのBlog&source=" data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/4158690468/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《罗马数字与阿拉伯数字的相互转换》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/4158690468/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/4158690468/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/4158690468/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
