<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        在平凡中蜕变，我的2014 - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;如果生命可以轻到像一枚羽毛，我愿意飞过那片时间的海，突然造访那些曾经让我怀念过的日子，看看那时的我是不是和现在一样，从来不曾后悔过当初的选择。2014年12月31日，面对即将到来的2015，我相信这将是我在平凡中蜕变的一年。回首2014，从年初开始学习Unity3D游戏开发到现在，我的博客共积累了230335次访问量和700名粉丝的关注。首先要感谢各位长期以来关注和支持我的">
<meta name="keywords" content="感悟,平凡,2014">
<meta property="og:type" content="article">
<meta property="og:title" content="在平凡中蜕变，我的2014">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/124807650/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;如果生命可以轻到像一枚羽毛，我愿意飞过那片时间的海，突然造访那些曾经让我怀念过的日子，看看那时的我是不是和现在一样，从来不曾后悔过当初的选择。2014年12月31日，面对即将到来的2015，我相信这将是我在平凡中蜕变的一年。回首2014，从年初开始学习Unity3D游戏开发到现在，我的博客共积累了230335次访问量和700名粉丝的关注。首先要感谢各位长期以来关注和支持我的">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://img.blog.csdn.net/20141231183443265?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast">
<meta property="og:image" content="http://img.blog.csdn.net/20141231185457483?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast">
<meta property="og:image" content="http://img.blog.csdn.net/20141231193113811?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast">
<meta property="og:updated_time" content="2019-02-15T11:11:38.520Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="在平凡中蜕变，我的2014">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;如果生命可以轻到像一枚羽毛，我愿意飞过那片时间的海，突然造访那些曾经让我怀念过的日子，看看那时的我是不是和现在一样，从来不曾后悔过当初的选择。2014年12月31日，面对即将到来的2015，我相信这将是我在平凡中蜕变的一年。回首2014，从年初开始学习Unity3D游戏开发到现在，我的博客共积累了230335次访问量和700名粉丝的关注。首先要感谢各位长期以来关注和支持我的">
<meta name="twitter:image" content="http://img.blog.csdn.net/20141231183443265?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">在平凡中蜕变，我的2014</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">在平凡中蜕变，我的2014</h1>
        <h5 class="subtitle">
            
                <time datetime="2014-12-30T19:34:34.000Z" itemprop="datePublished" class="page-time">
  2014-12-30
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-在平凡中蜕变，我的2014" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">在平凡中蜕变，我的2014</h1>
        <div class="post-meta">
            <time class="post-time" title="2014-12-30 19:34:34" datetime="2014-12-30T19:34:34.000Z" itemprop="datePublished">2014-12-30</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/生活感悟/">生活感悟</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        11 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5982;&#x679C;&#x751F;&#x547D;&#x53EF;&#x4EE5;&#x8F7B;&#x5230;&#x50CF;&#x4E00;&#x679A;&#x7FBD;&#x6BDB;&#xFF0C;&#x6211;&#x613F;&#x610F;&#x98DE;&#x8FC7;&#x90A3;&#x7247;&#x65F6;&#x95F4;&#x7684;&#x6D77;&#xFF0C;&#x7A81;&#x7136;&#x9020;&#x8BBF;&#x90A3;&#x4E9B;&#x66FE;&#x7ECF;&#x8BA9;&#x6211;&#x6000;&#x5FF5;&#x8FC7;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x770B;&#x770B;&#x90A3;&#x65F6;&#x7684;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x548C;&#x73B0;&#x5728;&#x4E00;&#x6837;&#xFF0C;&#x4ECE;&#x6765;&#x4E0D;&#x66FE;&#x540E;&#x6094;&#x8FC7;&#x5F53;&#x521D;&#x7684;&#x9009;&#x62E9;&#x3002;2014&#x5E74;12&#x6708;31&#x65E5;&#xFF0C;&#x9762;&#x5BF9;&#x5373;&#x5C06;&#x5230;&#x6765;&#x7684;2015&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x5C06;&#x662F;&#x6211;&#x5728;&#x5E73;&#x51E1;&#x4E2D;&#x8715;&#x53D8;&#x7684;&#x4E00;&#x5E74;&#x3002;&#x56DE;&#x9996;2014&#xFF0C;&#x4ECE;&#x5E74;&#x521D;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Unity3D&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x5171;&#x79EF;&#x7D2F;&#x4E86;230335&#x6B21;&#x8BBF;&#x95EE;&#x91CF;&#x548C;700&#x540D;&#x7C89;&#x4E1D;&#x7684;&#x5173;&#x6CE8;&#x3002;&#x9996;&#x5148;&#x8981;&#x611F;&#x8C22;&#x5404;&#x4F4D;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x5173;&#x6CE8;&#x548C;&#x652F;&#x6301;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4EEC;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x652F;&#x6301;&#x5C31;&#x662F;&#x6211;&#x4E0D;&#x65AD;&#x5199;&#x4E0B;&#x53BB;&#x7684;&#x52A8;&#x529B;&#x3002;2014&#x5E74;&#xFF0C;&#x5F53;&#x6211;&#x6E10;&#x6E10;&#x5730;&#x4ECE;&#x4E00;&#x540D;&#x5927;&#x56DB;&#x5B66;&#x751F;&#x7684;&#x89D2;&#x8272;&#x8F6C;&#x6362;&#x5230;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x8BA4;&#x8BC6;&#x5230;&#x539F;&#x6765;&#x751F;&#x6D3B;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x5E73;&#x51E1;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x90FD;&#x53EA;&#x662F;&#x5728;&#x505A;&#x7740;&#x666E;&#x666E;&#x901A;&#x901A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x90FD;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x666E;&#x901A;&#x901A;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x9897;&#x4E0D;&#x7518;&#x4E8E;&#x5E73;&#x51E1;&#x7684;&#x5FC3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x5728;&#x8FFD;&#x9010;&#x68A6;&#x60F3;&#x7684;&#x8DEF;&#x4E0A;&#x5B8C;&#x6210;&#x4E00;&#x6B21;&#x6B21;&#x7684;&#x8715;&#x53D8;&#x3002;&#x6574;&#x4E2A;2014&#x5E74;&#x57FA;&#x672C;&#x4E0A;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;</p>
<a id="more"></a>
<p>#2014&#x5E74;1&#x6708;~2014&#x5E74;6&#x6708;<br>&#x2003;&#x2003;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x662F;&#x5927;&#x4E09;&#x7684;&#x7B2C;&#x4E8C;&#x5B66;&#x671F;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x4E0A;&#x8BFE;&#x770B;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6280;&#x672F;&#x7C7B;&#x4E66;&#x7C4D;&#xFF0C;&#x4E0B;&#x8BFE;&#x6709;&#x65F6;&#x95F4;&#x5C31;&#x7F16;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5B66;&#x671F;&#x6709;CAD&#x8BFE;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x7EC3;&#x4E60;&#x753B;&#x56FE;&#x3002;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x5230;&#x4E86;Linux&#xFF0C;&#x56E0;&#x4E3A;&#x538C;&#x5026;&#x4E86;&#x5728;Windows&#x5E73;&#x53F0;&#x4E0A;&#x4F7F;&#x7528;&#x76D7;&#x7248;&#x548C;&#x7834;&#x89E3;&#x8F6F;&#x4EF6;&#x7684;&#x73B0;&#x72B6;&#xFF0C;&#x6211;&#x66FE;&#x4E00;&#x5EA6;&#x60F3;&#x6362;&#x5230;Linux&#x5E73;&#x53F0;&#xFF0C;&#x4E0D;&#x8FC7;&#x8003;&#x8651;&#x5230;&#x6211;&#x4ECD;&#x7136;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;Windows&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x7684;&#x613F;&#x671B;&#x53EA;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x5962;&#x671B;&#x3002;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;Sublime&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x6211;&#x5C06;&#x5B83;&#x6269;&#x5C55;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E07;&#x80FD;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x6211;&#x4F1A;&#x7528;&#x5B83;&#x6765;&#x5199;C#&#x3001;C++&#x3001;Java&#x3001;Lua&#x548C;Python&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4F9D;&#x7136;&#x5F88;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x524D;&#x51E0;&#x5929;&#x6211;&#x7ED9;&#x5B83;&#x88C5;&#x4E0A;&#x4E86;Markdown Preview&#x63D2;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x7F16;&#x5199;Markdown&#x6587;&#x4EF6;&#x3002;&#x4E94;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x548C;&#x540C;&#x5B66;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x53BB;&#x4E86;&#x6EDA;&#x949F;&#x53E3;&#xFF0C;&#x8FD9;&#x5927;&#x6982;&#x662F;&#x5927;&#x4E09;&#x7684;&#x65F6;&#x5019;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x548C;&#x540C;&#x5B66;&#x51FA;&#x53BB;&#x73A9;&#x5566;&#x3002;&#x5927;&#x6982;4&#x6708;&#x5E95;&#x5DE6;&#x53F3;&#xFF0C;&#x6211;&#x5C06;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x300B;&#x7CFB;&#x5217;&#x7684;&#x7B2C;&#x4E8C;&#x90E8;&#x6E38;&#x620F;&#x901A;&#x5173;&#x3002;6&#x6708;&#x4EFD;&#x6211;&#x840C;&#x751F;&#x4E86;&#x5229;&#x7528;Unity&#x6765;&#x5F00;&#x53D1;&#x4ED9;&#x5251;&#x540C;&#x4EBA;&#x6E38;&#x620F;&#x7684;&#x60F3;&#x6CD5;&#x3002;<br><img alt="&#x535A;&#x5BA2;&#x914D;&#x56FE;1" src="http://img.blog.csdn.net/20141231183443265?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast" width="75%"></p>
<p>#2014&#x5E74;7&#x6708;~2014&#x5E74;10&#x6708;<br>&#x2003;&#x2003;&#x5728;&#x7ED3;&#x675F;&#x4E86;&#x8FD9;&#x5B66;&#x671F;&#x7684;&#x8003;&#x8BD5;&#x540E;&#xFF0C;7&#x6708;&#x4EFD;&#x6211;&#x4EEC;&#x5728;&#x897F;&#x5B89;&#x548C;&#x4E0A;&#x6D77;&#x8FDB;&#x884C;&#x4E86;&#x4E3A;&#x671F;&#x534A;&#x4E2A;&#x6708;&#x7684;&#x91CE;&#x5916;&#x8BFE;&#x7A0B;&#x5B9E;&#x4E60;&#x3002;7&#x6708;&#x4EFD;&#x7684;&#x897F;&#x5B89;&#x6B63;&#x503C;&#x9177;&#x6691;&#xFF0C;&#x6574;&#x4E2A;&#x5B9E;&#x4E60;&#x8FC7;&#x7A0B;&#x603B;&#x662F;&#x4E0E;&#x6C57;&#x6C34;&#x4E3A;&#x4F34;&#x3002;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x672C;&#x79D1;&#x7684;&#x4E13;&#x4E1A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5B9E;&#x4E60;&#x9664;&#x4E86;&#x8BA9;&#x6211;&#x6709;&#x673A;&#x4F1A;&#x770B;&#x770B;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#x5F00;&#x9614;&#x773C;&#x754C;&#x4EE5;&#x5916;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5B9E;&#x9645;&#x7684;&#x610F;&#x4E49;&#x3002;&#x5728;&#x5B9E;&#x4E60;&#x671F;&#x95F4;&#xFF0C;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x52A8;&#x4F5C;&#x7C7B;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x4E09;&#x8FDE;&#x51FB;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5728;&#x5B9E;&#x4E60;&#x4E2D;&#x505A;&#x8FC7;&#x7684;&#x552F;&#x4E00;&#x4E00;&#x4EF6;&#x4E0E;&#x4E13;&#x4E1A;&#x65E0;&#x5173;&#x7684;&#x4E8B;&#x60C5;&#x3002;8&#x6708;&#x4EFD;&#x56DE;&#x5230;&#x5BB6;&#x91CC;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5929;&#x5929;&#x5B85;&#x5728;&#x5BB6;&#x91CC;&#x505A;&#x6E38;&#x620F;&#xFF0C;&#x505A;&#x4E86;&#x4E24;&#x4E2A;&#x5C04;&#x51FB;&#x7C7B;&#x7684;&#x5C0F;&#x6E38;&#x620F;&#x548C;&#x4E00;&#x4E2A;RPG&#x6E38;&#x620F;&#x3002;9&#x6708;&#x4EFD;&#x5230;&#x4E86;&#x5B66;&#x6821;&#xFF0C;&#x4E3A;&#x4E86;&#x7ED9;&#x6211;&#x7684;&#x4ED9;&#x5251;&#x540C;&#x4EBA;&#x6E38;&#x620F;&#x9879;&#x76EE;&#x5BFB;&#x627E;&#x7D20;&#x6750;&#xFF0C;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x300A;&#x4ED9;&#x5251;&#x5947;&#x4FA0;&#x4F20;&#x300B;&#x3001;&#x300A;&#x53E4;&#x5251;&#x5947;&#x8C2D;&#x300B;&#x7B49;&#x6E38;&#x620F;&#x7684;&#x89E3;&#x5305;&#xFF0C;&#x5E76;&#x4ECE;&#x4E2D;&#x63D0;&#x53D6;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6E38;&#x620F;&#x6A21;&#x578B;&#x3002;&#x4E3A;&#x4E86;&#x7ED9;&#x6A21;&#x578B;&#x6DFB;&#x52A0;&#x52A8;&#x753B;&#xFF0C;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5B66;&#x4E60;Blender&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0D;&#x8FC7;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x7ED9;&#x6A21;&#x578B;&#x7ED1;&#x9AA8;&#x662F;&#x4EF6;&#x76F8;&#x5F53;&#x9EBB;&#x70E6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x597D;&#x653E;&#x5F03;3D&#x5EFA;&#x6A21;&#x7684;&#x5B66;&#x4E60;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x5229;&#x7528;CAD&#x548C;SU&#x5EFA;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5E0C;&#x671B;&#x4EE5;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x518D;&#x5B66;&#x4E60;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x77E5;&#x8BC6;&#x5427;&#x3002;&#x7136;&#x540E;&#x5269;&#x4E0B;&#x7684;&#x65F6;&#x95F4;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x5728;&#x6363;&#x9F13;Linux&#x548C;Github&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x505A;&#x6E38;&#x620F;&#x5566;&#x3002;&#x671F;&#x95F4;&#x7814;&#x7A76;&#x4E86;Unity&#x4E0E;Android&#x5E73;&#x53F0;&#x3001;Lua&#x811A;&#x672C;&#x7684;&#x4EA4;&#x4E92;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5199;&#x6210;&#x7684;&#x6587;&#x7AE0;&#x6DF1;&#x53D7;&#x5927;&#x5BB6;&#x7684;&#x559C;&#x7231;&#xFF0C;&#x8FD9;&#x91CC;&#x518D;&#x6B21;&#x5BF9;&#x5927;&#x5BB6;&#x7684;&#x652F;&#x6301;&#x8868;&#x793A;&#x611F;&#x8C22;&#x3002;<br><img alt="&#x535A;&#x5BA2;&#x914D;&#x56FE;2" src="http://img.blog.csdn.net/20141231185457483?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast"></p>
<p>#2014&#x5E74;11&#x6708;~2014&#x5E74;12&#x6708;<br>&#x2003;&#x2003;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x6309;&#x7167;&#x53CC;11&#x6765;&#x5212;&#x5206;&#x7684;&#x8BDD;&#xFF0C;&#x53CC;11&#x4EE5;&#x524D;&#x662F;&#x8003;&#x8BD5;&#xFF0C;&#x53CC;11&#x4EE5;&#x540E;&#x662F;&#x5B9E;&#x4E60;&#x3002;&#x8003;&#x8BD5;&#x6CA1;&#x4EC0;&#x4E48;&#x503C;&#x5F97;&#x8BF4;&#x7684;&#xFF0C;&#x6C38;&#x8FDC;&#x662F;&#x8BB0;&#x5FC6;&#x7684;&#x5185;&#x5BB9;&#x6BD4;&#x5B9E;&#x7528;&#x7684;&#x5185;&#x5BB9;&#x591A;&#x3002;&#x4E0D;&#x8FC7;&#x5F53;&#x6211;&#x9762;&#x5BF9;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x8003;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x5FC3;&#x60C5;&#x6781;&#x5176;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x679C;&#x518D;&#x7ED9;&#x6211;&#x56DB;&#x5E74;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x8FD8;&#x4F1A;&#x8FD9;&#x6837;&#x9009;&#x62E9;&#x6211;&#x7684;&#x4EBA;&#x751F;&#x3002;&#x5B9E;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x6BB5;&#x6682;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x5B9E;&#x4E60;&#x4E2D;&#x6211;&#x6536;&#x83B7;&#x7684;&#x4E1C;&#x897F;&#x5374;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x6536;&#x83B7;&#x4E86;&#x4E3A;&#x4EBA;&#x5904;&#x4E16;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x540C;&#x65F6;&#x6536;&#x83B7;&#x4E86;&#x4E00;&#x4EFD;&#x73CD;&#x8D35;&#x7684;&#x53CB;&#x8C0A;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x60F3;&#x53BB;&#x7ECF;&#x5386;&#x548C;&#x4F53;&#x9A8C;&#x7684;&#x4E1C;&#x897F;&#x5427;&#x3002;&#x5728;&#x5B9E;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5229;&#x7528;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x7814;&#x7A76;&#x4E86;&#x5854;&#x9632;&#x6E38;&#x620F;&#x548C;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;Hexo&#xFF0C;&#x6211;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x8FD8;&#x662F;Linux&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6BD4;&#x8F83;&#x7ED9;&#x529B;&#xFF0C;&#x50CF;Ruby&#x8FD9;&#x6837;&#x7684;&#x73AF;&#x5883;&#x5728;Windows&#x4E0B;&#x5B89;&#x88C5;&#x7B80;&#x76F4;&#x5C31;&#x662F;&#x5728;&#x627E;&#x8650;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x4E0D;&#x5410;&#x69FD;&#x4E86;&#xFF0C;&#x6211;&#x5229;&#x7528;Hexo&#x548C;Github Page&#x642D;&#x5EFA;&#x4E86;&#x6211;&#x7684;&#x72EC;&#x7ACB;&#x535A;&#x5BA2;<a href="http://qinyuanpei.github.io/">http://qinyuanpei.github.io/</a><br>&#x4EE5;&#x540E;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x4F1A;&#x540C;&#x65F6;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x535A;&#x5BA2;&#x4E0A;&#x53D1;&#x5E03;&#xFF0C;&#x5E0C;&#x671B;&#x559C;&#x6B22;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x7684;&#x670B;&#x53CB;&#x80FD;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x652F;&#x6301;&#x6211;&#xFF01;<br><img alt="&#x535A;&#x5BA2;&#x914D;&#x56FE;3" src="http://img.blog.csdn.net/20141231193113811?
watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvcWlueXVhbnBlaQ==/font/5a6L5L2T/fontsi
ze/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast"></p>
<p>&#x2003;&#x2003;2014&#x5E74;&#x5373;&#x5C06;&#x8FC7;&#x53BB;&#xFF0C;&#x9762;&#x5BF9;&#x5373;&#x5C06;&#x5230;&#x6765;&#x7684;2015&#x5E74;&#xFF0C;&#x6211;&#x60F3;&#x505A;&#x5230;5&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ul>
<li>&#x8BA4;&#x771F;&#x5B8C;&#x6210;&#x672C;&#x79D1;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#x2014;&#x2014;&#x505A;&#x597D;&#x5927;&#x5B66;&#x91CC;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;</li>
<li>&#x627E;&#x4E00;&#x4EFD;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x5DE5;&#x4F5C;&#x2014;&#x2014;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x7684;&#x8FFD;&#x9010;&#x81EA;&#x5DF1;&#x7684;&#x68A6;&#x60F3;</li>
<li>&#x52AA;&#x529B;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x8D23;&#x4EFB;&#x611F;&#x7684;&#x4EBA;&#x2014;&#x2014;&#x7ED9;&#x5979;&#x60F3;&#x8981;&#x7684;&#x6E29;&#x6696;</li>
<li>&#x52AA;&#x529B;&#x505A;&#x4E00;&#x4E2A;&#x5584;&#x826F;&#x7684;&#x4EBA;&#x2014;&#x2014;&#x4F17;&#x751F;&#x867D;&#x82E6;&#xFF0C;&#x8BF8;&#x6076;&#x83AB;&#x4F5C;</li>
<li>&#x52AA;&#x529B;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x5185;&#x6DB5;&#x7684;&#x4EBA;&#x2014;&#x2014;&#x8BFB;&#x4E66;&#x3001;&#x5199;&#x4F5C;&#x3001;&#x7F16;&#x7A0B;&#x3001;&#x6E38;&#x620F;</li>
</ul>
<p>&#x2003;&#x2003;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x535A;&#x5BA2;&#xFF1A;</p>
<ul>
<li>CSDN&#x535A;&#x5BA2;:<a href="http://blog.csdn.net/qinyuanpei" target="_blank" rel="noopener">http://blog.csdn.net/qinyuanpei</a></li>
<li>&#x72EC;&#x7ACB;&#x535A;&#x5BA2;:<a href="http://qinyuanpei.github.io/">http://qinyuanpei.github.io/</a></li>
</ul>
<p>&#x2003;&#x2003;&#x6700;&#x540E;&#x795D;&#x5927;&#x5BB6;&#x5728;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x91CC;&#x4E8B;&#x4E1A;&#x6709;&#x6210;&#x3001;&#x68A6;&#x60F3;&#x6210;&#x771F;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/3111375079/">冬天来了，春天还会远吗？</a></li><li><a href="https://qinyuanpei.github.io/posts/2617501472/">秋风劲似去年时</a></li><li><a href="https://qinyuanpei.github.io/posts/3417652955/">长安不见使人愁</a></li><li><a href="http://www.davidfnck.com/talkshow/gambling_life.html/">随笔｜人生就是投资</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/124807650/" rel="external">在平凡中蜕变，我的2014</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/124807650/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/124807650/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/2014/">2014</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/平凡/">平凡</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/感悟/">感悟</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/124807650/&title=《在平凡中蜕变，我的2014》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/124807650/&title=《在平凡中蜕变，我的2014》 — PayneQinのBlog&source=&emsp;&emsp;如果生命可以轻到像一枚羽毛，我愿意飞过那片时间的海，突然造访那些曾经让我怀念过的日子，看看那时的我是不是和现在一样，从来不曾后悔过..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/124807650/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《在平凡中蜕变，我的2014》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/124807650/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/124807650/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/2752169106/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">写给永远单纯的自己</h4>
      </a>
    </div>
  

  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/124807650/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/124807650/&title=《在平凡中蜕变，我的2014》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/124807650/&title=《在平凡中蜕变，我的2014》 — PayneQinのBlog&source=&emsp;&emsp;如果生命可以轻到像一枚羽毛，我愿意飞过那片时间的海，突然造访那些曾经让我怀念过的日子，看看那时的我是不是和现在一样，从来不曾后悔过..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/124807650/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《在平凡中蜕变，我的2014》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/124807650/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/124807650/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/124807650/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
