<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    

    
<!-- Tencent Speed -->
<script>var _speedMark = new Date()</script>
<!-- End Tencent Speed -->
<!-- Tencent Analysis -->
<script async src="//tajs.qq.com/stats?sId=65355341"></script>
<!-- End Tencent Analysis -->


    



    <meta charset="utf-8">
    <!-- HTTP 1.1 -->  
    <meta http-equiv="pragma" content="no-cache">  
    <!-- HTTP 1.0 -->  
    <meta http-equiv="cache-control" content="no-cache">
    
    
    
    <title>
        互联网黑洞读书笔记(2) - PayneQinのBlog
    </title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="theme-color" content="#3F51B5">
    
    <meta name="keywords" content="undefined">
    <meta name="description" content="&amp;emsp;&amp;emsp;在移动互联网时代地大潮中，微信无疑是整个行业的弄潮儿。从“微信之父”张小龙最初定义微信这个产品的那一刻开始，就注定微信将走上一条平台化的道路，各种各样可能的商业模式成为人们开始不断探索微信的价值，可是这一切和你有关系吗？">
<meta name="keywords" content="互联网,哲学,微信,人文">
<meta property="og:type" content="article">
<meta property="og:title" content="互联网黑洞读书笔记(2)">
<meta property="og:url" content="https://qinyuanpei.github.io/posts/1930050594/index.html">
<meta property="og:site_name" content="PayneQinのBlog">
<meta property="og:description" content="&amp;emsp;&amp;emsp;在移动互联网时代地大潮中，微信无疑是整个行业的弄潮儿。从“微信之父”张小龙最初定义微信这个产品的那一刻开始，就注定微信将走上一条平台化的道路，各种各样可能的商业模式成为人们开始不断探索微信的价值，可是这一切和你有关系吗？">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-02-15T11:11:38.516Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="互联网黑洞读书笔记(2)">
<meta name="twitter:description" content="&amp;emsp;&amp;emsp;在移动互联网时代地大潮中，微信无疑是整个行业的弄潮儿。从“微信之父”张小龙最初定义微信这个产品的那一刻开始，就注定微信将走上一条平台化的道路，各种各样可能的商业模式成为人们开始不断探索微信的价值，可是这一切和你有关系吗？">
    
        <link rel="alternate" type="application/atom+xml" title="PayneQinのBlog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/assets/images/favicon.ico">
    
        <link rel="manifest" href="/manifest.json">
    
    <link rel="stylesheet" href="/assets/styles/style.css?v=1.7.1">
    <script>window.lazyScripts=[]</script>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
    <script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
    <!-- custom head -->
    

</head>

<body>
    <div id="loading" class="active"></div>

    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap" style="background-image:url(/assets/images/brand.jpg)">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/assets/images/avatar.jpg">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname">Payne</h5>
          <a href="mailto:qinyuanpei@163.com" title="qinyuanpei@163.com" class="mail">qinyuanpei@163.com</a>
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
            <li class="waves-block waves-effect">
              <a href="/">
                <i class="icon icon-lg icon-home"></i>
                主页
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/archives">
                <i class="icon icon-lg icon-archives"></i>
                归档
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/tags">
                <i class="icon icon-lg icon-tags"></i>
                标签
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/categories">
                <i class="icon icon-lg icon-th-list"></i>
                分类
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/books">
                <i class="icon icon-lg icon-bookmark"></i>
                读书
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/movies">
                <i class="icon icon-lg icon-film"></i>
                电影
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/works">
                <i class="icon icon-lg icon-code"></i>
                作品
              </a>
            </li>
        
            <li class="waves-block waves-effect">
              <a href="/albums">
                <i class="icon icon-lg icon-link"></i>
                相册
              </a>
            </li>
        
      </ul>
    </div>
  </div>
</aside>

    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">互联网黑洞读书笔记(2)</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menuShare">
            <i class="icon icon-lg icon-share-alt"></i>
        </a>
        
    </div>
</header>
<header class="content-header post-header">

    <div class="container fade-scale">
        <h1 class="title">互联网黑洞读书笔记(2)</h1>
        <h5 class="subtitle">
            
                <time datetime="2015-02-11T15:50:55.000Z" itemprop="datePublished" class="page-time">
  2015-02-11
</time>


	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>

            
        </h5>
    </div>

    


</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>目录</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-1"><a class="post-toc-link" href="#undefined"><span class="post-toc-number">1.</span> <span class="post-toc-text">你可能感兴趣</span></a></li></ol>
        </nav>
    </aside>
    
<article id="post-互联网黑洞读书笔记(2)" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">互联网黑洞读书笔记(2)</h1>
        <div class="post-meta">
            <time class="post-time" title="2015-02-11 15:50:55" datetime="2015-02-11T15:50:55.000Z" itemprop="datePublished">2015-02-11</time>

            
	<ul class="article-category-list"><li class="article-category-list-item"><a class="article-category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>



            

            
    <span>
        <i class="icon icon-clock-o"></i>
        14 min.
    </span>
    
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <p>&#x2003;&#x2003;&#x5728;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x5730;&#x5927;&#x6F6E;&#x4E2D;&#xFF0C;&#x5FAE;&#x4FE1;&#x65E0;&#x7591;&#x662F;&#x6574;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x5F04;&#x6F6E;&#x513F;&#x3002;&#x4ECE;&#x201C;&#x5FAE;&#x4FE1;&#x4E4B;&#x7236;&#x201D;&#x5F20;&#x5C0F;&#x9F99;&#x6700;&#x521D;&#x5B9A;&#x4E49;&#x5FAE;&#x4FE1;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x5F00;&#x59CB;&#xFF0C;&#x5C31;&#x6CE8;&#x5B9A;&#x5FAE;&#x4FE1;&#x5C06;&#x8D70;&#x4E0A;&#x4E00;&#x6761;&#x5E73;&#x53F0;&#x5316;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x5404;&#x79CD;&#x5404;&#x6837;&#x53EF;&#x80FD;&#x7684;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x6210;&#x4E3A;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x4E0D;&#x65AD;&#x63A2;&#x7D22;&#x5FAE;&#x4FE1;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x4E00;&#x5207;&#x548C;&#x4F60;&#x6709;&#x5173;&#x7CFB;&#x5417;&#xFF1F;</p>
<a id="more"></a>
<blockquote>
<p>&#x5728;&#x4E2D;&#x56FD;&#x8FD9;&#x79CD;&#x4EBA;&#x60C5;&#x793E;&#x4F1A;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x8106;&#x5F31;&#x7684;&#x4FE1;&#x4EFB;&#x7EBD;&#x5E26;&#xFF0C;&#x6025;&#x9700;&#x6709;&#x5FAE;&#x4FE1;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x52A0;&#x56FA;&#xFF1B;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x7684;&#x4EA4;&#x5F80;&#x6210;&#x672C;&#xFF0C;&#x66F4;&#x6025;&#x9700;&#x5FAE;&#x4FE1;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x964D;&#x4F4E;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x5FAE;&#x4FE1;&#x7ED9;&#x4E2D;&#x56FD;&#x793E;&#x4F1A;&#x5E26;&#x6765;&#x7684;&#x5F3A;&#x5927;&#x9707;&#x611F;&#x548C;&#x51B2;&#x51FB;&#xFF0C;&#x5176;&#x5B9E;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x5708;&#x5B50;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x8BB2;&#x7A76;&#x7684;&#x662F;&#x5927;&#x683C;&#x5C40;&#xFF0C;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x8DE8;&#x8D8A;&#x65F6;&#x7A7A;&#x3002;&#x53EF;&#x662F;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4E2D;&#x56FD;&#x4EBA;&#x90FD;&#x4E0D;&#x5728;&#x8FD9;&#x4E2A;&#x683C;&#x5C40;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5177;&#x5907;&#x7A7F;&#x8D8A;&#x65F6;&#x7A7A;&#x7684;&#x6761;&#x4EF6;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E2D;&#x56FD;&#x68A6;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x626A;&#x5FC3;&#x81EA;&#x95EE;&#xFF1A;&#x4F60;&#x8DDF;&#x522B;&#x4EBA;&#x7684;&#x4E2D;&#x56FD;&#x68A6;&#x5171;&#x540C;&#x7684;&#x6709;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x5F88;&#x5B85;&#xFF0C;&#x800C;&#x5FAE;&#x4FE1;&#x4E0D;&#x8FC7;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x5B85;&#x800C;&#x5DF2;&#xFF0C;&#x4E0D;&#x7BA1;&#x6709;&#x6CA1;&#x6709;&#x5FAE;&#x4FE1;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x5728;&#x8FC7;&#x7740;&#x67F4;&#x7C73;&#x6CB9;&#x76D0;&#x9171;&#x918B;&#x8336;&#x8FD9;&#x6837;&#x7684;&#x666E;&#x901A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x4E2D;&#x56FD;&#x4EBA;&#x6027;&#x683C;&#x91CC;&#x4F1A;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x7684;&#x5BF9;&#x5916;&#x754C;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x6212;&#x5907;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5708;&#x5B50;&#x5176;&#x5B9E;&#x5C31;&#x90A3;&#x4E48;&#x5927;&#x3002;</p>
<blockquote>
<p>&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x5F7C;&#x6B64;&#x4F24;&#x5BB3;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x601D;&#x7EF4;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5F00;&#x660E;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x4E00;&#x79CD;&#x80FD;&#x770B;&#x5230;&#x5927;&#x683C;&#x5C40;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x4E00;&#x79CD;&#x8D85;&#x8D8A;&#x81EA;&#x6211;&#x7684;&#x601D;&#x7EF4;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x5C31;&#x50CF;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x6240;&#x7406;&#x89E3;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4E00;&#x6837;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x81EA;&#x7531;&#x7CBE;&#x795E;&#x5728;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x4FBF;&#x5229;&#x7684;&#x751F;&#x6D3B;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7ED9;&#x67D0;&#x4E9B;&#x4EBA;&#x4EE5;&#x53EF;&#x4E58;&#x4E4B;&#x673A;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x8DDD;&#x79BB;&#x4E92;&#x8054;&#x7F51;&#x8FD1;&#x5728;&#x54AB;&#x5C3A;&#x800C;&#x53C8;&#x9065;&#x4E0D;&#x53EF;&#x53CA;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4E60;&#x60EF;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x8FD9;&#x79CD;&#x4FBF;&#x5229;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x5C06;&#x4E92;&#x8054;&#x7F51;&#x89C6;&#x4E3A;&#x6D2A;&#x6C34;&#x731B;&#x517D;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x4E16;&#x754C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5168;&#x6C11;&#x5236;&#x8861;&#x5386;&#x6765;&#x662F;&#x79CD;&#x5BF9;&#x793E;&#x4F1A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x529B;&#x91CF;&#x3002;&#x8FD9;&#x79CD;&#x5236;&#x8861;&#x4E00;&#x65E6;&#x5236;&#x5EA6;&#x53D8;&#x5316;&#xFF0C;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x6301;&#x7EED;&#x800C;&#x7A33;&#x5B9A;&#xFF0C;&#x76F4;&#x63A5;&#x540E;&#x679C;&#x5C31;&#x662F;&#x56FD;&#x5BB6;&#x7684;&#x56DE;&#x5F52;&#x3002;&#x4F9D;&#x6B21;&#x662F;&#x4E09;&#x79CD;&#x5883;&#x754C;&#xFF1A;&#x56DE;&#x5F52;&#x793E;&#x4F1A;&#x3001;&#x56DE;&#x5F52;&#x56FD;&#x6C11;&#x3001;&#x56DE;&#x5F52;&#x81EA;&#x7136;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x559C;&#x6B22;&#x653F;&#x6CBB;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x653F;&#x6CBB;&#x662F;&#x4E00;&#x79CD;&#x6781;&#x5176;&#x5FAE;&#x5999;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6B63;&#x76F4;&#x4E14;&#x5355;&#x7EAF;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x9002;&#x5408;&#x653F;&#x6CBB;&#xFF0C;&#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8206;&#x8BBA;&#x4F5C;&#x7528;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x5168;&#x6C11;&#x5236;&#x8861;&#x5F00;&#x59CB;&#x4E0D;&#x65AD;&#x5730;&#x548C;&#x653F;&#x6CBB;&#x53D1;&#x751F;&#x7740;&#x53CD;&#x5E94;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7CBE;&#x795E;&#x7684;&#x7EC8;&#x6781;&#x76EE;&#x6807;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x53D6;&#x4EE3;&#x548C;&#x98A0;&#x8986;&#x73B0;&#x6709;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x5E0C;&#x671B;&#x5728;&#x548C;&#x653F;&#x6CBB;&#x535A;&#x5F08;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BA9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#x3002;</p>
<blockquote>
<p>&#x56E0;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x6587;&#x660E;&#x5C06;&#x6467;&#x6BC1;&#x4E00;&#x5207;&#x65E7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E00;&#x5207;&#x5927;&#x5BB6;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#x7684;&#x4E1C;&#x897F;&#x3002;<br>&#x5728;&#x4E92;&#x8054;&#x7F51;&#x9762;&#x524D;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x5E73;&#x7B49;&#x7684;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x3001;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x5C55;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5BF9;&#x8EAB;&#x8FB9;&#x7684;&#x4E00;&#x5207;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5374;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x4E0E;&#x4E16;&#x754C;&#x63A5;&#x89E6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x521B;&#x65B0;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x53D8;&#x9769;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x5F53;&#x4E92;&#x8054;&#x7F51;&#x4EE5;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x6A21;&#x5F0F;&#x53BB;&#x98A0;&#x8986;&#x73B0;&#x6709;&#x6A21;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EFB;&#x4F55;&#x7684;&#x4EE5;&#x653F;&#x6CBB;&#x7406;&#x7531;&#x4E3A;&#x51FA;&#x53D1;&#x70B9;&#x7684;&#x5E72;&#x9884;&#x5728;&#x6211;&#x770B;&#x6765;&#x90FD;&#x662F;&#x5F92;&#x7136;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5E72;&#x9884;&#x8005;&#x4E4B;&#x6240;&#x4EE5;&#x5E72;&#x9884;&#x65E0;&#x975E;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x53D8;&#x9769;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x5176;&#x5229;&#x76CA;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;&#x653F;&#x6CBB;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x5177;&#x5907;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x56FD;&#x5BB6;&#x961F;&#x7684;&#x641C;&#x7D22;&#x5728;&#x5E02;&#x573A;&#x7ADE;&#x4E89;&#x4E2D;&#x5931;&#x8D25;&#x4FBF;&#x662F;&#x6700;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<blockquote>
<p>&#x4E0D;&#x4EC5;&#x4EC5;&#x4E0A;&#x6D41;&#x793E;&#x4F1A;&#x548C;&#x4E3B;&#x6D41;&#x793E;&#x4F1A;&#x6F20;&#x89C6;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x5168;&#x793E;&#x4F1A;&#x90FD;&#x6F20;&#x89C6;&#x4E92;&#x8054;&#x7F51;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x4F7F;&#x7528;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x4E86;&#x89E3;&#x4E92;&#x8054;&#x7F51;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x5730;&#x4F9D;&#x8D56;&#x7740;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x5374;&#x4ECE;&#x6765;&#x4E0D;&#x5BF9;&#x4E3A;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x52AA;&#x529B;&#x4ED8;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x8868;&#x793A;&#x5C0A;&#x656C;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x6CA1;&#x6709;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x4F1A;&#x53D8;&#x5F97;&#x6DF7;&#x4E71;&#x4E0D;&#x582A;&#xFF1F;</p>
<blockquote>
<p>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4EBA;&#x6587;&#x5C5E;&#x6027;&#xFF0C;&#x51B3;&#x5B9A;&#x4E86;&#x76C8;&#x5229;&#x6A21;&#x5F0F;&#x7684;&#x5730;&#x57DF;&#x5C40;&#x9650;&#x548C;&#x793E;&#x4F1A;&#x5DEE;&#x5F02;&#x3002;<br>&#x4ECE;&#x4E92;&#x8054;&#x7F51;&#x7B2C;&#x4E00;&#x5929;&#x8FDB;&#x5165;&#x4E2D;&#x56FD;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x65E0;&#x6570;&#x7F8E;&#x56FD;&#x7684;&#x76C8;&#x5229;&#x6A21;&#x5F0F;&#xFF0C;&#x90FD;&#x6CA1;&#x5728;&#x4E2D;&#x56FD;&#x706B;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4EBA;&#x6587;&#x5C5E;&#x6027;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6BCF;&#x4E00;&#x4E2A;&#x56FD;&#x5BB6;&#x3001;&#x6BCF;&#x4E00;&#x4E2A;&#x5730;&#x533A;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x76C8;&#x5229;&#x6A21;&#x5F0F;&#x90FD;&#x4F1A;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4EBA;&#x6587;&#x5C5E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#x56FD;&#x5916;&#x7528;&#x6237;&#x90FD;&#x6709;&#x8D2D;&#x4E70;&#x4ED8;&#x8D39;&#x8F6F;&#x4EF6;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x4E2D;&#x56FD;&#x4EBA;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x76D7;&#x7248;&#x751A;&#x81F3;&#x7834;&#x89E3;&#x3002;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x514D;&#x8D39;&#xFF0C;&#x53EF;&#x662F;&#x514D;&#x8D39;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x6700;&#x8D35;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x56FD;&#x5916;&#x7528;&#x6237;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x56FD;&#x5185;&#x7528;&#x6237;&#x5219;&#x4F1A;&#x9009;&#x62E9;XX&#x52A9;&#x624B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4EBA;&#x6587;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<blockquote>
<p>&#x5F20;&#x5C0F;&#x9F99;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x4E09;&#x4E2A;&#x542F;&#x793A;</p>
<ul>
<li>&#x5173;&#x7CFB;&#x80FD;&#x4E3A;&#x6280;&#x672F;&#x5E26;&#x6765;&#x8D85;&#x4E4E;&#x60F3;&#x8C61;&#x7684;&#x9644;&#x52A0;&#x503C;</li>
<li>&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x9644;&#x52A0;&#x503C;&#x538B;&#x8FEB;&#x57FA;&#x4E8E;&#x672C;&#x571F;&#x5B9E;&#x73B0;</li>
<li>&#x65B0;&#x578B;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x5728;&#x5784;&#x65AD;&#x7528;&#x6237;&#x6570;&#x636E;&#x65B9;&#x9762;&#x66F4;&#x5177;&#x9B54;&#x529B;</li>
</ul>
</blockquote>
<p>&#x2003;&#x2003;&#x5F53;&#x6211;&#x4EEC;&#x611F;&#x6168;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x6084;&#x7136;&#x6765;&#x4E34;&#xFF0C;&#x5728;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E91;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6536;&#x96C6;&#x8D77;&#x6765;&#x52A0;&#x4EE5;&#x5229;&#x7528;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#x7559;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x673A;&#x4F1A;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x65E0;&#x8BBA;&#x662F;&#x4EC0;&#x4E48;&#x601D;&#x7EF4;&#xFF0C;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4FBF;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x5982;&#x679C;&#x8981;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x60F3;&#x53BB;&#x505A;&#x4E00;&#x540D;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6211;&#x4F1A;&#x8BF4;&#x56E0;&#x4E3A;&#x6211;&#x559C;&#x6B22;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
<blockquote>
<p>&#x9A6C;&#x5316;&#x817E;&#x7684;&#x6545;&#x4E8B;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF1A;&#x4E0D;&#x56DE;&#x5230;&#x539F;&#x70B9;&#xFF0C;&#x4E0D;&#x7ACB;&#x8DB3;&#x521D;&#x59CB;&#x5316;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x4E16;&#x754C;&#x5BF9;&#x4F60;&#x800C;&#x8A00;&#xFF0C;&#x5C06;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x964C;&#x751F;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x4EE5;&#x524D;&#x6211;&#x7684;&#x53D4;&#x53D4;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5C31;&#x7B97;&#x6CA1;&#x6709;&#x767E;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4ECD;&#x4F1A;&#x6709;&#x5343;&#x5EA6;&#x751A;&#x81F3;&#x4E07;&#x5EA6;&#x3002;&#x53EF;&#x662F;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x6211;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#xFF0C;&#x590D;&#x5236;&#x4E00;&#x79CD;&#x4EA7;&#x54C1;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#xFF0C;&#x53EF;&#x662F;&#x5982;&#x4F55;&#x53D1;&#x6325;&#x81EA;&#x6211;&#x7684;&#x4F18;&#x52BF;&#x5C06;&#x4EA7;&#x54C1;&#x505A;&#x5230;&#x6781;&#x81F4;&#xFF0C;&#x8FD9;&#x662F;&#x5236;&#x80DC;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4ECD;&#x7136;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x6BD4;&#x674E;&#x5F66;&#x5B8F;&#x66F4;&#x4E86;&#x89E3;&#x641C;&#x7D22;&#x3001;&#x505A;&#x597D;&#x641C;&#x7D22;&#x3002;&#x5FAE;&#x4FE1;&#x7684;&#x6210;&#x529F;&#x5E76;&#x975E;&#x662F;&#x5FAE;&#x4FE1;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x800C;&#x662F;&#x817E;&#x8BAF;&#x61C2;&#x5F97;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x81EA;&#x6211;&#x3001;&#x7A81;&#x7834;&#x81EA;&#x6211;&#xFF0C;&#x8FD9;&#x662F;&#x7528;&#x6237;&#x5173;&#x7CFB;&#x4E0A;&#x7684;&#x6210;&#x529F;&#x3002;</p>
<blockquote>
<p>&#x5176;&#x5B9E;&#x4EBA;&#x751F;&#x5982;&#x767D;&#x9A79;&#x8FC7;&#x9699;&#xFF0C;&#x5230;&#x5934;&#x6765;&#x4E0D;&#x8FC7;&#x662F;&#x5173;&#x7CFB;&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x800C;&#x5DF2;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6B63;&#x5982;&#x5112;&#x5BB6;&#x7814;&#x7A76;&#x4EBA;&#x4E0E;&#x4EBA;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3001;&#x9053;&#x5BB6;&#x7814;&#x7A76;&#x4EBA;&#x4E0E;&#x81EA;&#x5DF1;&#x7684;&#x5173;&#x7CFB;&#x3001;&#x4F5B;&#x5BB6;&#x7814;&#x7A76;&#x4EBA;&#x7684;&#x4ECA;&#x751F;&#x4E0E;&#x524D;&#x4E16;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5F52;&#x6839;&#x5230;&#x5E95;&#x90FD;&#x662F;&#x5173;&#x7CFB;&#xFF0C;&#x4EBA;&#x6D3B;&#x7740;&#x6240;&#x4EE5;&#x5E78;&#x82E6;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x5C06;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x7528;&#x5230;&#x4E86;&#x7EF4;&#x62A4;&#x4EBA;&#x4E0E;&#x4EBA;&#x7684;&#x5173;&#x7CFB;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x672C;&#x8D28;&#x2014;&#x2014;&#x5173;&#x7CFB;&#x3002;</p>
<blockquote>
<p>&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x5F7C;&#x6B64;&#x3001;&#x8BA9;&#x6211;&#x4EEC;&#x8DDF;&#x4E16;&#x754C;&#x65E0;&#x9650;&#x8D8B;&#x8FD1;&#x4E8E;&#x65E0;&#x7F1D;&#x8FDE;&#x63A5;&#x800C;&#x5DF2;&#x3002;&#x8FD9;&#x79CD;&#x8FDE;&#x63A5;&#xFF0C;&#x5C31;&#x662F;&#x5F7C;&#x6B64;&#x7684;&#x56DE;&#x5F52;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x684C;&#x9762;&#x4E92;&#x8054;&#x7F51;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x3001;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x3001;&#x5927;&#x6570;&#x636E;&#x5219;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x83B7;&#x53D6;&#x5173;&#x7CFB;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x610F;&#x65E0;&#x610F;&#x95F4;&#xFF0C;&#x673A;&#x4F1A;&#x4F1A;&#x53D8;&#x5F97;&#x6709;&#x9650;&#x800C;&#x65E0;&#x9650;&#x3002;&#x8D85;&#x8D8A;&#x662F;&#x4EE5;&#x522B;&#x4EBA;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#x98A0;&#x8986;&#xFF0C;&#x5C31;&#x662F;&#x60F3;&#x6253;&#x57AE;&#x5BF9;&#x65B9;;&#x98A0;&#x8986;&#x662F;&#x4EE5;&#x81EA;&#x5DF1;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#x8D85;&#x8D8A;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x5B75;&#x5316;&#x81EA;&#x5DF1;&#x3002;&#x867D;&#x7136;&#x90FD;&#x662F;&#x6709;&#x610F;&#x7684;&#xFF0C;&#x76EE;&#x6807;&#x5F88;&#x660E;&#x786E;&#xFF0C;&#x7ED3;&#x679C;&#x5374;&#x4E0D;&#x540C;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x540C;&#x4E00;&#x4EF7;&#x503C;&#x4F53;&#x7CFB;&#x5185;&#x7684;&#x8D85;&#x8D8A;&#x548C;&#x98A0;&#x8986;&#xFF0C;&#x56FA;&#x7136;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x7136;&#x800C;&#x4F53;&#x7CFB;&#x4E0E;&#x4F53;&#x7CFB;&#x95F4;&#x7684;&#x8D85;&#x8D8A;&#x548C;&#x98A0;&#x8986;&#x5374;&#x66F4;&#x52A0;&#x81F4;&#x547D;&#x3002;</p>
<blockquote>
<p>&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;&#x81F3;&#x4ECA;&#x4ECD;&#x7136;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5236;&#x9AD8;&#x70B9;&#xFF0C;&#x641C;&#x7D22;&#x51B3;&#x5B9A;&#x8BBF;&#x95EE;&#xFF0C;&#x79BB;&#x5F00;&#x6709;&#x6548;&#x8BBF;&#x95EE;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x4E00;&#x5207;&#xFF0C;&#x56E0;&#x6B64;&#x641C;&#x7D22;&#x786E;&#x5B9A;&#x4E00;&#x5207;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x5C0A;&#x91CD;&#x81EA;&#x7136;&#x641C;&#x7D22;&#x3001;&#x641C;&#x7D22;&#x51B3;&#x5B9A;&#x4E00;&#x5207;&#x662F;&#x73B0;&#x4EE3;&#x7F51;&#x7EDC;&#x8425;&#x9500;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x79BB;&#x5F00;&#x8FD9;&#x4E9B;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x5F92;&#x52B3;&#x7684;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script><div><h1>你可能感兴趣</h1><ul><li><a href="https://qinyuanpei.github.io/posts/1478979553/">互联网黑洞读书笔记(1)</a></li><li><a href="https://qinyuanpei.github.io/posts/1478979553/">互联网黑洞读书笔记(1)</a></li><li><a href="https://qinyuanpei.github.io/posts/4205536912/">当黑客遇见画家</a></li><li><a href="https://blogs.kainy.cn/2010/03/2010年中国互联网的6大问题/">2010年中国互联网的6大问题</a></li></ul></div>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        <p><b>版权声明：</b>
        <a href="https://qinyuanpei.github.io/posts/1930050594/" rel="external">互联网黑洞读书笔记(2)</a>
        ，由&nbsp;<a href="/about" target="_blank" rel="external">Payne</a>&nbsp;
        首次发表于&nbsp;<a href="/" target="_blank" rel="external">PayneQinのBlog</a>&nbsp;
        ，本文地址为：<a href="https://qinyuanpei.github.io/posts/1930050594/" target="_blank" rel="external">https://qinyuanpei.github.io/posts/1930050594/</a>
        ，转载请注明<b>作者</b>和<b>出处</b>。</p>
    </div>
    <footer>
        <a href="https://qinyuanpei.github.io">
            <img src="/assets/images/avatar.jpg" alt="Payne">
            Payne
        </a>
    </footer>
</blockquote>

        <div class="post-footer">
            
	<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/互联网/">互联网</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/人文/">人文</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/哲学/">哲学</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/微信/">微信</a></li></ul>


            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1930050594/&title=《互联网黑洞读书笔记(2)》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1930050594/&title=《互联网黑洞读书笔记(2)》 — PayneQinのBlog&source=&emsp;&emsp;在移动互联网时代地大潮中，微信无疑是整个行业的弄潮儿。从“微信之父”张小龙最初定义微信这个产品的那一刻开始，就注定微信将走上一条平..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1930050594/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《互联网黑洞读书笔记(2)》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1930050594/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1930050594/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/2038378679/" id="post-prev" class="post-nav-link">
        <div class="tips"><i class="icon icon-angle-left icon-lg icon-pr"></i> Prev</div>
        <h4 class="title">HTML5游戏开发技术基础整理</h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/2583252123/" id="post-next" class="post-nav-link">
        <div class="tips">Next <i class="icon icon-angle-right icon-lg icon-pl"></i></div>
        <h4 class="title">使用Mecanim动画系统来控制2D动画</h4>
      </a>
    </div>
  
</nav>



    
    <div id="comment"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src="//unpkg.com/valine/dist/Valine.min.js"></script>
<script type="text/javascript">
new Valine({
    el: '#comment' ,
    notify:false, 
    verify:false, 
    appId: 'JbHqRp2eMrTgIwYpfERH0g79-gzGzoHsz',
    appKey: 'VsiKvLuiBGvJL1XrAfv7siY2',
    placeholder: '',
    path:'https://qinyuanpei.github.io/posts/1930050594/', 
    avatar:'identicon',
    visitor: true
});
</script>




</article>

<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        赠人玫瑰，手有余香
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" src="/assets/images/wechat.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/assets/images/wechat.png" data-alipay="/assets/images/alipay.jpg">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechat">微信</span>
                <span class="reward-toggle-label"></span>
                <span class="reward-toggle-item alipay">支付宝</span>
            </div>
        </label>
        
    </div>
</div>



</div>

        <footer class="footer">
    <div class="top">
        

        <p>
            
                <span><a href="/atom.xml" target="_blank" class="rss" title="rss"><i class="icon icon-lg icon-rss"></i></a></span>
            
            <span>
                <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" rel="license">
                    BY-NC-SA
                </a>
            </span>
            <span>
                <a href="https://www.travis-ci.org/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Travis CI
                </a>
            </span>
            <span>
                <a href="https://github.com/qinyuanpei/qinyuanpei.github.io" rel="license">
                    Github
                </a>
            </span>
            <span>
                <a href="https://coding.net/u/qinyuanpei/p/qinyuanpei.coding.me" rel="license">
                    Coding
                </a>
            </span>
        </p>
    </div>
    <div class="bottom">
        <p><span>Payne &copy; 2014 - 2019</span>
            <span>
                
                    <a href="http://www.miitbeian.gov.cn/" target="_blank">宁ICP备6666666号</a><br>
                
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> Theme <a href="https://github.com/yscoder/hexo-theme-indigo" target="_blank">indigo</a><br>
                
                    <p>Hosted by <a href="https://pages.github.com" style="font-weight: bold">Github Pages</a></p>
                
            </span>
        </p>
    </div>
</footer>

    </main>
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://qinyuanpei.github.io/posts/1930050594/&title=《互联网黑洞读书笔记(2)》 — PayneQinのBlog&pic=https://qinyuanpei.github.ioassets/images/avatar.jpg" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://qinyuanpei.github.io/posts/1930050594/&title=《互联网黑洞读书笔记(2)》 — PayneQinのBlog&source=&emsp;&emsp;在移动互联网时代地大潮中，微信无疑是整个行业的弄潮儿。从“微信之父”张小龙最初定义微信这个产品的那一刻开始，就注定微信将走上一条平..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://qinyuanpei.github.io/posts/1930050594/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《互联网黑洞读书笔记(2)》 — PayneQinのBlog&url=https://qinyuanpei.github.io/posts/1930050594/&via=https://qinyuanpei.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://qinyuanpei.github.io/posts/1930050594/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <img src="//api.qrserver.com/v1/create-qr-code/?data=https://qinyuanpei.github.io/posts/1930050594/" alt="微信分享二维码">
</div>




    <script src="//cdn.bootcss.com/node-waves/0.7.6/waves.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.bootcss.com/axios/0.18.0/axios.min.js"></script>
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };


</script>

<script src="/assets/scripts/main.min.js?v=1.7.1"></script>

    
<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item">
    <a href="{path}" class="waves-block waves-effect">
        <div class="title ellipsis" title="{title}">{title}</div>
        <div class="flex-row flex-middle">
            <div class="tags ellipsis">
                {tags}
            </div>
            <time class="flex-col time">{date}</time>
        </div>
    </a>
</li>
</template>

    <script src="/assets/scripts/search.min.js?v=1.7.1" async></script>


    <script src="/assets/scripts/bixin.min.js?v=1.7.1" async></script>










</body>
</html>
